[Killed] PublicVisibility
app/Events/Employee/EmployeeUpdateOrDeletedEvent.php:27:5
         $this->employeeId = $employeeId;
     }
 
-    public function employeeId(): int
+    protected function employeeId(): int
     {
         return $this->employeeId;
killedBy: Tests\Feature\App\Events\Employee\EmployeeUpdateOrDeletedEventTest::test_employeeId_should_return_int
statusReason: 1) Tests\Feature\App\Events\Employee\EmployeeUpdateOrDeletedEventTest::test_employeeId_should_return_int
Error: Call to protected method App\Events\Employee\EmployeeUpdateOrDeletedEvent::employeeId() from scope Tests\Feature\App\Events\Employee\EmployeeUpdateOrDeletedEventTest

/var/www/abacusSystem-new/tests/Feature/App/Events/Employee/EmployeeUpdateOrDeletedEventTest.php:31

ERRORS!
Tests: 2, As

[Killed] PublicVisibility
app/Events/Employee/EmployeeUpdateOrDeletedEvent.php:37:5
      *
      * @return array<int, Channel>
      */
-    public function broadcastOn(): array
+    protected function broadcastOn(): array
     {
         return [
killedBy: Tests\Feature\App\Events\Employee\EmployeeUpdateOrDeletedEventTest::test_broadcastOn_should_return_array_object
statusReason: 1) Tests\Feature\App\Events\Employee\EmployeeUpdateOrDeletedEventTest::test_broadcastOn_should_return_array_object
Error: Call to protected method App\Events\Employee\EmployeeUpdateOrDeletedEvent::broadcastOn() from scope Tests\Feature\App\Events\Employee\EmployeeUpdateOrDeletedEventTest

/var/www/abacusSystem-new/tests/Feature/App/Events/Employee/EmployeeUpdateOrDeletedEventTest.php:39

ERRORS!
T

[Killed] ArrayItemRemoval
app/Events/Employee/EmployeeUpdateOrDeletedEvent.php:39:9
      */
     public function broadcastOn(): array
     {
-        return [
-            new PrivateChannel('channel-name'),
-        ];
+        return [];
     }
 }
killedBy: Tests\Feature\App\Events\Employee\EmployeeUpdateOrDeletedEventTest::test_broadcastOn_should_return_array_object
statusReason: 1) Tests\Feature\App\Events\Employee\EmployeeUpdateOrDeletedEventTest::test_broadcastOn_should_return_array_object
Failed asserting that actual size 0 matches expected size 1.

/var/www/abacusSystem-new/tests/Feature/App/Events/Employee/EmployeeUpdateOrDeletedEventTest.php:42

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.
