[Killed] PublicVisibility
app/Events/Profile/ModuleUpdatedOrDeletedEvent.php:27:5
         $this->moduleId = $moduleId;
     }
 
-    public function moduleId(): int
+    protected function moduleId(): int
     {
         return $this->moduleId;
killedBy: Tests\Feature\App\Events\Profile\ModuleUpdatedOrDeletedEventTest::test_moduleId_should_return_int
statusReason: 1) Tests\Feature\App\Events\Profile\ModuleUpdatedOrDeletedEventTest::test_moduleId_should_return_int
Error: Call to protected method App\Events\Profile\ModuleUpdatedOrDeletedEvent::moduleId() from scope Tests\Feature\App\Events\Profile\ModuleUpdatedOrDeletedEventTest

/var/www/abacusSystem-new/tests/Feature/App/Events/Profile/ModuleUpdatedOrDeletedEventTest.php:29

ERRORS!
Tests: 2, Assertions: 2,

[Survived] ArrayItemRemoval
app/Events/Profile/ModuleUpdatedOrDeletedEvent.php:39:9
      */
     public function broadcastOn(): array
     {
-        return [
-            new PrivateChannel('channel-profile'),
-        ];
+        return [];
     }
 }
