[Killed] PublicVisibility
app/Events/Profile/ProfileUpdatedOrDeletedEvent.php:27:5
         $this->profileId = $id;
     }
 
-    public function profileId(): int
+    protected function profileId(): int
     {
         return $this->profileId;
killedBy: Tests\Feature\App\Events\Profile\ProfileUpdatedOrDeletedEventTest::test_profileId_should_return_int
statusReason: 1) Tests\Feature\App\Events\Profile\ProfileUpdatedOrDeletedEventTest::test_profileId_should_return_int
Error: Call to protected method App\Events\Profile\ProfileUpdatedOrDeletedEvent::profileId() from scope Tests\Feature\App\Events\Profile\ProfileUpdatedOrDeletedEventTest

/var/www/abacusSystem-new/tests/Feature/App/Events/Profile/ProfileUpdatedOrDeletedEventTest.php:29

ERRORS!
Tests: 2, Assertio
