[Survived] ArrayItemRemoval
app/Events/User/RefreshModulesSessionEvent.php:30:9
      */
     public function broadcastOn(): array
     {
-        return [
-            new PrivateChannel('channel-user'),
-        ];
+        return [];
     }
 }
