[Killed] PublicVisibility
app/Events/User/UserUpdateOrDeleteEvent.php:26:5
         $this->userId = $id;
     }
 
-    public function userId(): int
+    protected function userId(): int
     {
         return $this->userId;
killedBy: Tests\Feature\App\Events\User\UserUpdateOrDeleteEventTest::test_userId_should_return_int
statusReason: 1) Tests\Feature\App\Events\User\UserUpdateOrDeleteEventTest::test_userId_should_return_int
Error: Call to protected method App\Events\User\UserUpdateOrDeleteEvent::userId() from scope Tests\Feature\App\Events\User\UserUpdateOrDeleteEventTest

/var/www/abacusSystem-new/tests/Feature/App/Events/User/UserUpdateOrDeleteEventTest.php:29

ERRORS!
Tests: 2, Assertions: 2, Errors: 1.
