[Killed] PublicVisibility
Http/Controllers/ActionExecutors/ActionExecutorHandler.php:22:5
         $this->actionExecutors = [];
     }
 
-    public function addActionExecutor(ActionExecutor $actionExecutor): self
+    protected function addActionExecutor(ActionExecutor $actionExecutor): self
     {
         $this->actionExecutors[$actionExecutor->canExecute()] = $actionExecutor;
killedBy: Tests\Feature\App\Http\Controllers\ActionExecutors\ActionExecutorHandlerTest::test_invoke_should_return_mixed
statusReason: 1) Tests\Feature\App\Http\Controllers\ActionExecutors\ActionExecutorHandlerTest::test_invoke_should_return_mixed
Error: Call to protected method App\Http\Controllers\ActionExecutors\ActionExecutorHandler::addActionExecutor() from scope Tests\Feature\App\Http\Controllers\ActionExecutors\ActionExecutorHandlerTest

/var/www/abacusSystem-new/tests/Feature/App/Http/Controllers/ActionExecutors/ActionExe

[Killed] PublicVisibility
Http/Controllers/ActionExecutors/ActionExecutorHandler.php:32:5
     /**
      * @throws ActionExecutorNotFoundException
      */
-    public function invoke(string $action, Request $request): mixed
+    protected function invoke(string $action, Request $request): mixed
     {
         if (empty($this->actionExecutors[$action])) {
killedBy: Tests\Feature\App\Http\Controllers\ActionExecutors\ActionExecutorHandlerTest::test_invoke_should_return_mixed
statusReason: 1) Tests\Feature\App\Http\Controllers\ActionExecutors\ActionExecutorHandlerTest::test_invoke_should_return_exception
/var/www/abacusSystem-new/tests/Feature/App/Http/Controllers/ActionExecutors/ActionExecutorHandlerTest.php:80
.

ERRORS!
Tests: 2, Assertions: 1, Errors: 1, Failures: 1.

[Killed] Throw_
Http/Controllers/ActionExecutors/ActionExecutorHandler.php:35:13
     public function invoke(string $action, Request $request): mixed
     {
         if (empty($this->actionExecutors[$action])) {
-            throw new ActionExecutorNotFoundException;
+            new ActionExecutorNotFoundException();
         }
 
killedBy: Tests\Feature\App\Http\Controllers\ActionExecutors\ActionExecutorHandlerTest::test_invoke_should_return_exception
statusReason: 1) Tests\Feature\App\Http\Controllers\ActionExecutors\ActionExecutorHandlerTest::test_invoke_should_return_exception
Failed asserting that exception of type "ErrorException" matches expected exception "App\Http\Exceptions\ActionExecutorNotFoundException". Message was: "Undefined array key "testing"" at
/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Foundation/Bootstrap/HandleExc
