[Killed] MethodCallRemoval
Controllers/ActionExecutors/EmployeeActions/CreateEmployeeActionExecutor.php:19:9
     public function __construct(
         OrchestratorHandlerContract $orchestratorHandler,
     ) {
-        parent::__construct($orchestratorHandler);
+        
     }
 
killedBy: Tests\Feature\App\Http\Controllers\ActionExecutors\EmployeeActions\CreateEmployeeActionExecutorTest::test_invoke_should_return_employee
statusReason: 1) Tests\Feature\App\Http\Controllers\ActionExecutors\EmployeeActions\CreateEmployeeActionExecutorTest::test_invoke_should_return_employee
Error: Typed property App\Http\Controllers\ActionExecutors\EmployeeActions\EmployeeActionExecutor::$orchestratorHandler must not be accessed before initialization

/var/www/abacusSystem-new/app/Http/Controllers/ActionExecutors/EmployeeActions/CreateEmployeeActi

[Killed] MethodCallRemoval
Controllers/ActionExecutors/EmployeeActions/CreateEmployeeActionExecutor.php:31:9
         /** @var Employee $employee */
         $employee = $this->orchestratorHandler->handler('create-employee', $request);
 
-        $request->merge(['image' => $employee->image()->value()]);
+        
         $request->merge(['employeeId' => $employee->id()->value()]);
 
killedBy: Tests\Feature\App\Http\Controllers\ActionExecutors\EmployeeActions\CreateEmployeeActionExecutorTest::test_invoke_should_return_employee
statusReason: 1) Tests\Feature\App\Http\Controllers\ActionExecutors\EmployeeActions\CreateEmployeeActionExecutorTest::test_invoke_should_return_employee
Expectation failed for method name is "image" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] MethodCallRemoval
Controllers/ActionExecutors/EmployeeActions/CreateEmployeeActionExecutor.php:32:9
         $employee = $this->orchestratorHandler->handler('create-employee', $request);
 
         $request->merge(['image' => $employee->image()->value()]);
-        $request->merge(['employeeId' => $employee->id()->value()]);
+        
 
         /** @var User $user */
killedBy: Tests\Feature\App\Http\Controllers\ActionExecutors\EmployeeActions\CreateEmployeeActionExecutorTest::test_invoke_should_return_employee
statusReason: 1) Tests\Feature\App\Http\Controllers\ActionExecutors\EmployeeActions\CreateEmployeeActionExecutorTest::test_invoke_should_return_employee
Expectation failed for method name is "id" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Survived] ArrayItem
Controllers/ActionExecutors/EmployeeActions/CreateEmployeeActionExecutor.php:32:9
         $employee = $this->orchestratorHandler->handler('create-employee', $request);
 
         $request->merge(['image' => $employee->image()->value()]);
-        $request->merge(['employeeId' => $employee->id()->value()]);
+        $request->merge(['employeeId' > $employee->id()->value()]);
 
         /** @var User $user */

[Killed] MethodCallRemoval
Controllers/ActionExecutors/EmployeeActions/CreateEmployeeActionExecutor.php:36:9
 
         /** @var User $user */
         $user = $this->orchestratorHandler->handler('create-user', $request);
-        $employee->userId()->setValue($user->id()->value());
+        
 
         return $employee;
killedBy: Tests\Feature\App\Http\Controllers\ActionExecutors\EmployeeActions\CreateEmployeeActionExecutorTest::test_invoke_should_return_employee
statusReason: 1) Tests\Feature\App\Http\Controllers\ActionExecutors\EmployeeActions\CreateEmployeeActionExecutorTest::test_invoke_should_return_employee
Expectation failed for method name is "userId" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.
