[Killed] MethodCallRemoval
Controllers/ActionExecutors/EmployeeActions/UpdateEmployeeActionExecutor.php:28:9
         Hasher $hasher
     ) {
         parent::__construct($orchestratorHandler);
-        $this->setImageManager($imageManager);
+        
         $this->setHasher($hasher);
     }
killedBy: Tests\Feature\App\Http\Controllers\ActionExecutors\EmployeeActions\UpdateEmployeeActionExecutorTest::test_invoke_should_return_employee
statusReason: 1) Tests\Feature\App\Http\Controllers\ActionExecutors\EmployeeActions\UpdateEmployeeActionExecutorTest::test_invoke_should_return_employee
Error: Typed property App\Http\Controllers\ActionExecutors\EmployeeActions\UpdateEmployeeActionExecutor::$imageManager must not be accessed before initialization

/var/www/abacusSystem-new/app/Traits/MultimediaTrait.php:29
/var/www/abacusSystem-new/app/Http/Con

[Killed] MethodCallRemoval
Controllers/ActionExecutors/EmployeeActions/UpdateEmployeeActionExecutor.php:29:9
     ) {
         parent::__construct($orchestratorHandler);
         $this->setImageManager($imageManager);
-        $this->setHasher($hasher);
+        
     }
 
killedBy: Tests\Feature\App\Http\Controllers\ActionExecutors\EmployeeActions\UpdateEmployeeActionExecutorTest::test_invoke_should_return_employee
statusReason: 1) Tests\Feature\App\Http\Controllers\ActionExecutors\EmployeeActions\UpdateEmployeeActionExecutorTest::test_invoke_should_return_employee
Error: Typed property App\Http\Controllers\ActionExecutors\EmployeeActions\UpdateEmployeeActionExecutor::$hasher must not be accessed before initialization

/var/www/abacusSystem-new/app/Traits/UserTrait.php:18
/var/www/abacusSystem-new/app/Http/Controllers/Act

[Killed] IfNegation
Controllers/ActionExecutors/EmployeeActions/UpdateEmployeeActionExecutor.php:51:9
             'birthdate' => $birthdate->format('Y-m-d'),
         ];
 
-        if ($request->filled('token')) {
-            $filename = $this->saveImage($request->input('token'));
-            $dataUpdate['image'] = $filename;
-        }
+        if (!$request->filled('token')) {
         $request->merge(['dataUpdate' => json_encode($dataUpdate)]);
 
killedBy: Tests\Feature\App\Http\Controllers\ActionExecutors\EmployeeActions\UpdateEmployeeActionExecutorTest::test_invoke_should_return_employee
statusReason: 1) Tests\Feature\App\Http\Controllers\ActionExecutors\EmployeeActions\UpdateEmployeeActionExecutorTest::test_invoke_should_return_employee
Expectation failed for method name is "make" when invoked 1 time
Parameter 0 for invocation Illuminate\Contracts\Hashing\Hasher::make('login', []) does not match expected value.
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'passwo

[Killed] MethodCallRemoval
Controllers/ActionExecutors/EmployeeActions/UpdateEmployeeActionExecutor.php:55:9
             $filename = $this->saveImage($request->input('token'));
             $dataUpdate['image'] = $filename;
         }
-        $request->merge(['dataUpdate' => json_encode($dataUpdate)]);
+        
 
         /** @var Employee $employee */
killedBy: Tests\Feature\App\Http\Controllers\ActionExecutors\EmployeeActions\UpdateEmployeeActionExecutorTest::test_invoke_should_return_employee
statusReason: 1) Tests\Feature\App\Http\Controllers\ActionExecutors\EmployeeActions\UpdateEmployeeActionExecutorTest::test_invoke_should_return_employee
Expectation failed for method name is "merge" when invoked 2 times.
Method was expected to be called 2 times, actually called 1 time.

FAILURES!
Tests: 1, Assertions: 6, Failures: 1.

[Survived] ArrayItem
Controllers/ActionExecutors/EmployeeActions/UpdateEmployeeActionExecutor.php:62:13
 
         $dataUpdateUser = [
             'profileId' => $request->input('profile'),
-            'login' => $request->input('login')
+            $dataUpdateUser = ['profileId' => $request->input('profile'), 'login' > $request->input('login')];
         ];
 

[Killed] IfNegation
Controllers/ActionExecutors/EmployeeActions/UpdateEmployeeActionExecutor.php:69:9
             $dataUpdateUser['image'] = $dataUpdate['image'];
         }
 
-        if ($request->filled('password')) {
-            $dataUpdateUser['password'] = $this->makeHashPassword($request->input('password'));
-        }
+        if (!$request->filled('password')) {
 
         $request->merge(['dataUpdate' => json_encode($dataUpdateUser)]);
killedBy: Tests\Feature\App\Http\Controllers\ActionExecutors\EmployeeActions\UpdateEmployeeActionExecutorTest::test_invoke_should_return_employee
statusReason: 1) Tests\Feature\App\Http\Controllers\ActionExecutors\EmployeeActions\UpdateEmployeeActionExecutorTest::test_invoke_should_return_employee
Expectation failed for method name is "make" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] MethodCallRemoval
Controllers/ActionExecutors/EmployeeActions/UpdateEmployeeActionExecutor.php:73:9
             $dataUpdateUser['password'] = $this->makeHashPassword($request->input('password'));
         }
 
-        $request->merge(['dataUpdate' => json_encode($dataUpdateUser)]);
+        
         $this->orchestratorHandler->handler('update-user', $request);
 
killedBy: Tests\Feature\App\Http\Controllers\ActionExecutors\EmployeeActions\UpdateEmployeeActionExecutorTest::test_invoke_should_return_employee
statusReason: 1) Tests\Feature\App\Http\Controllers\ActionExecutors\EmployeeActions\UpdateEmployeeActionExecutorTest::test_invoke_should_return_employee
Expectation failed for method name is "merge" when invoked 2 times.
Method was expected to be called 2 times, actually called 1 time.

FAILURES!
Tests: 1, Assertions: 6, Failures: 1.

[Killed] MethodCallRemoval
Controllers/ActionExecutors/EmployeeActions/UpdateEmployeeActionExecutor.php:74:9
         }
 
         $request->merge(['dataUpdate' => json_encode($dataUpdateUser)]);
-        $this->orchestratorHandler->handler('update-user', $request);
+        
 
         return $employee;
killedBy: Tests\Feature\App\Http\Controllers\ActionExecutors\EmployeeActions\UpdateEmployeeActionExecutorTest::test_invoke_should_return_employee
statusReason: 1) Tests\Feature\App\Http\Controllers\ActionExecutors\EmployeeActions\UpdateEmployeeActionExecutorTest::test_invoke_should_return_employee
Expectation failed for method name is "handler" when invoked 2 times.
Method was expected to be called 2 times, actually called 1 time.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.
