[Killed] MethodCallRemoval
Controllers/ActionExecutors/InstitutionActions/UpdateInstitutionActionExecutor.php:49:9
             $dataUpdate['logo'] = $filename;
         }
 
-        $request->merge(['dataUpdate' => json_encode($dataUpdate)]);
+        
         return $this->orchestratorHandler->handler('update-institution', $request);
     }
killedBy: Tests\Feature\App\Http\Controllers\ActionExecutors\InstitutionActions\UpdateInstitutionActionExecutorTest::test_invoke_should_return_institution
statusReason: 1) Tests\Feature\App\Http\Controllers\ActionExecutors\InstitutionActions\UpdateInstitutionActionExecutorTest::test_invoke_should_return_institution
Expectation failed for method name is "merge" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.
