[Killed] MethodCallRemoval
Controllers/ActionExecutors/ModuleActions/CreateModuleActionExecutor.php:23:9
         Router $router,
         LoggerInterface $logger
     ) {
-        parent::__construct($orchestratorHandler, $router, $logger);
+        
     }
 
killedBy: Tests\Feature\App\Http\Controllers\ActionExecutors\ModuleActions\CreateModuleActionExecutorTest::test_invoke_should_return_module
statusReason: 1) Tests\Feature\App\Http\Controllers\ActionExecutors\ModuleActions\CreateModuleActionExecutorTest::test_invoke_should_return_exception
Failed asserting that exception of type "Error" matches expected exception "App\Http\Exceptions\RouteNotFoundException". Message was: "Typed property App\Http\Controllers\ActionExecutors\ModuleActions\ModuleActionExecutor::$router must not be accessed before initi

[Killed] MethodCallRemoval
Controllers/ActionExecutors/ModuleActions/CreateModuleActionExecutor.php:33:9
      */
     public function invoke(Request $request): Module
     {
-        $this->validateRoute($request->input('route'));
+        
 
         return $this->orchestratorHandler->handler('create-module', $request);
killedBy: Tests\Feature\App\Http\Controllers\ActionExecutors\ModuleActions\CreateModuleActionExecutorTest::test_invoke_should_return_module
statusReason: 1) Tests\Feature\App\Http\Controllers\ActionExecutors\ModuleActions\CreateModuleActionExecutorTest::test_invoke_should_return_module
Expectation failed for method name is "getRoutes" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.
