[NoCoverage] ProtectedVisibility
Controllers/ActionExecutors/ModuleActions/ModuleActionExecutor.php:41:5
     /**
      * @throws RouteNotFoundException
      */
-    protected function validateRoute(string $route): void
+    private function validateRoute(string $route): void
     {
         $routes = $this->router->getRoutes();

[NoCoverage] Foreach_
Controllers/ActionExecutors/ModuleActions/ModuleActionExecutor.php:46:9
         $routes = $this->router->getRoutes();
         $slugs = [];
         /** @var Route $item */
-        foreach ($routes as $item) {
-            $method = $item->methods();
-            if ($method[0] === 'GET') {
-                $slugs[] = $item->uri();
-            }
-        }
+        foreach ([] as $item) {
         $slugs = array_unique($slugs);
 

[NoCoverage] IncrementInteger
Controllers/ActionExecutors/ModuleActions/ModuleActionExecutor.php:48:13
         /** @var Route $item */
         foreach ($routes as $item) {
             $method = $item->methods();
-            if ($method[0] === 'GET') {
+            if ($method[1] === 'GET') {
                 $slugs[] = $item->uri();
             }

[NoCoverage] Identical
Controllers/ActionExecutors/ModuleActions/ModuleActionExecutor.php:48:13
         /** @var Route $item */
         foreach ($routes as $item) {
             $method = $item->methods();
-            if ($method[0] === 'GET') {
+            if ($method[0] !== 'GET') {
                 $slugs[] = $item->uri();
             }

[NoCoverage] MethodCallRemoval
Controllers/ActionExecutors/ModuleActions/ModuleActionExecutor.php:55:13
         $slugs = array_unique($slugs);
 
         try {
-            Assertion::inArray($route, $slugs);
+            
         } catch (AssertionFailedException $exception) {
             $this->logger->warning('Route not found - Route: '.$route, $exception->getTrace());

[NoCoverage] MethodCallRemoval
Controllers/ActionExecutors/ModuleActions/ModuleActionExecutor.php:57:13
         try {
             Assertion::inArray($route, $slugs);
         } catch (AssertionFailedException $exception) {
-            $this->logger->warning('Route not found - Route: '.$route, $exception->getTrace());
+            
 
             throw new RouteNotFoundException('Route <'.$route.'> not found', Response::HTTP_NOT_FOUND);

[NoCoverage] ConcatOperandRemoval
Controllers/ActionExecutors/ModuleActions/ModuleActionExecutor.php:57:13
         try {
             Assertion::inArray($route, $slugs);
         } catch (AssertionFailedException $exception) {
-            $this->logger->warning('Route not found - Route: '.$route, $exception->getTrace());
+            $this->logger->warning('Route not found - Route: ', $exception->getTrace());
 
             throw new RouteNotFoundException('Route <'.$route.'> not found', Response::HTTP_NOT_FOUND);

[NoCoverage] ConcatOperandRemoval
Controllers/ActionExecutors/ModuleActions/ModuleActionExecutor.php:59:13
         } catch (AssertionFailedException $exception) {
             $this->logger->warning('Route not found - Route: '.$route, $exception->getTrace());
 
-            throw new RouteNotFoundException('Route <'.$route.'> not found', Response::HTTP_NOT_FOUND);
+            throw new RouteNotFoundException($route . '> not found', Response::HTTP_NOT_FOUND);
         }
     }

[NoCoverage] ConcatOperandRemoval
Controllers/ActionExecutors/ModuleActions/ModuleActionExecutor.php:59:13
         } catch (AssertionFailedException $exception) {
             $this->logger->warning('Route not found - Route: '.$route, $exception->getTrace());
 
-            throw new RouteNotFoundException('Route <'.$route.'> not found', Response::HTTP_NOT_FOUND);
+            throw new RouteNotFoundException('Route <' . '> not found', Response::HTTP_NOT_FOUND);
         }
     }
