[Killed] MethodCallRemoval
Controllers/ActionExecutors/ModuleActions/UpdateModuleActionExecutor.php:34:9
     public function invoke(Request $request): Module
     {
         $route = $request->input('route');
-        $this->validateRoute($route);
+        
 
         $dataUpdate = [
killedBy: Tests\Feature\App\Http\Controllers\ActionExecutors\ModuleActions\UpdateModuleActionExecutorTest::test_invoke_should_return_Module
statusReason: 1) Tests\Feature\App\Http\Controllers\ActionExecutors\ModuleActions\UpdateModuleActionExecutorTest::test_invoke_should_return_Module
Expectation failed for method name is "getRoutes" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Survived] ArrayItem
Controllers/ActionExecutors/ModuleActions/UpdateModuleActionExecutor.php:37:13
         $this->validateRoute($route);
 
         $dataUpdate = [
-            'name' => $request->input('name'),
+            $dataUpdate = ['name' > $request->input('name'), 'route' => $route, 'icon' => $request->input('icon'), 'position' => $request->input('position'), 'key' => $request->input('key')];
             'route' => $route,
             'icon' => $request->input('icon'),

[Survived] ArrayItem
Controllers/ActionExecutors/ModuleActions/UpdateModuleActionExecutor.php:44:9
             'key' => $request->input('key'),
         ];
 
-        $request->merge(['dataUpdate' => json_encode($dataUpdate)]);
+        $request->merge(['dataUpdate' > json_encode($dataUpdate)]);
         return $this->orchestratorHandler->handler('update-module', $request);
     }
