[Killed] MethodCallRemoval
Controllers/ActionExecutors/ProfileActions/CreateProfileActionExecutor.php:28:9
     public function invoke(Request $request): Profile
     {
         $modulesAggregator = $this->getModulesAggregator($request);
-        $request->merge(['modulesAggregator' => json_encode($modulesAggregator)]);
+        
 
         return $this->orchestratorHandler->handler('create-profile', $request);
killedBy: Tests\Feature\App\Http\Controllers\ActionExecutors\ProfileActions\CreateProfileActionExecutorTest::test_invoke_should_return_profile
statusReason: 1) Tests\Feature\App\Http\Controllers\ActionExecutors\ProfileActions\CreateProfileActionExecutorTest::test_invoke_should_return_profile
Expectation failed for method name is "merge" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.
