[NoCoverage] ProtectedVisibility
Controllers/ActionExecutors/ProfileActions/ProfileActionExecutor.php:28:5
         $this->orchestratorHandler = $orchestratorHandler;
     }
 
-    protected function getModulesAggregator(Request $request): array
+    private function getModulesAggregator(Request $request): array
     {
         $modulesAggregator = [];

[NoCoverage] Foreach_
Controllers/ActionExecutors/ProfileActions/ProfileActionExecutor.php:31:9
     protected function getModulesAggregator(Request $request): array
     {
         $modulesAggregator = [];
-        foreach ($request->input('modules') as $item) {
-            $modulesAggregator[] = $item['id'];
-        }
+        foreach ([] as $item) {
 
         return $modulesAggregator;
