[Survived] ArrayItem
Controllers/ActionExecutors/ProfileActions/UpdateProfileActionExecutor.php:29:13
     {
         $modulesAggregator = $this->getModulesAggregator($request);
         $dataUpdate = [
-            'name' => $request->input('name'),
+            $dataUpdate = ['name' > $request->input('name'), 'description' => $request->input('description'), 'modules' => $modulesAggregator];
             'description' => $request->input('description'),
             'modules' => $modulesAggregator,
