[NoCoverage] PublicVisibility
app/Http/Controllers/Controller.php:31:5
         $this->viewFactory = $viewFactory;
     }
 
-    public function renderView(string $html, int $code = Response::HTTP_OK): JsonResponse|string
+    protected function renderView(string $html, int $code = Response::HTTP_OK): JsonResponse|string
     {
         /** @var Request $requestService */

[NoCoverage] IfNegation
app/Http/Controllers/Controller.php:36:9
         /** @var Request $requestService */
         $requestService = app(Request::class);
 
-        if ($requestService->ajax()) {
-            $response = new JsonResponse(['html' => $html], $code);
-
-            return $response->header('Cache-Control', 'no-cache, no-store, must-revalidate')
-                    ->header('Pragma', 'no-cache')
-                    ->header('Expires', '0');
-        }
+        if (!$requestService->ajax()) {
 
         return $html;

[NoCoverage] ArrayItemRemoval
app/Http/Controllers/Controller.php:37:13
         $requestService = app(Request::class);
 
         if ($requestService->ajax()) {
-            $response = new JsonResponse(['html' => $html], $code);
+            $response = new JsonResponse([], $code);
 
             return $response->header('Cache-Control', 'no-cache, no-store, must-revalidate')

[NoCoverage] PublicVisibility
app/Http/Controllers/Controller.php:47:5
         return $html;
     }
 
-    public function getPagination(?string $route = null): string
+    protected function getPagination(?string $route = null): string
     {
         if (is_null($route)) {

[NoCoverage] IfNegation
app/Http/Controllers/Controller.php:49:9
 
     public function getPagination(?string $route = null): string
     {
-        if (is_null($route)) {
-
-            /** @var Router $routerService */
-            $routerService = app(Router::class);
-            $route = $routerService->current()->uri();
-        }
+        if (!is_null($route)) {
 
         return json_encode([

[NoCoverage] DecrementInteger
app/Http/Controllers/Controller.php:57:13
         }
 
         return json_encode([
-            'start' => 0,
+            return json_encode(['start' => -1, 'filters' => [], 'uri' => $route]);
             'filters' => [],
             'uri' => $route

[NoCoverage] IncrementInteger
app/Http/Controllers/Controller.php:57:13
         }
 
         return json_encode([
-            'start' => 0,
+            return json_encode(['start' => 1, 'filters' => [], 'uri' => $route]);
             'filters' => [],
             'uri' => $route

[NoCoverage] ProtectedVisibility
app/Http/Controllers/Controller.php:63:5
         ]);
     }
 
-    protected function retrieveMenuOptionHtml(array $item, ?string $permission = null): string
+    private function retrieveMenuOptionHtml(array $item, ?string $permission = null): string
     {
         return $this->viewFactory->make('components.menu-options-datatable')
