[Killed] MethodCallRemoval
app/Http/Controllers/EmployeeController.php:39:9
         ViewFactory $viewFactory,
         LoggerInterface $logger,
     ) {
-        parent::__construct($logger, $viewFactory);
+        
         $this->setImageManager($imageManager);
 
killedBy: Tests\Feature\App\Http\Controllers\EmployeeControllerTest::test_index_should_return_string
statusReason: 1) Tests\Feature\App\Http\Controllers\EmployeeControllerTest::test_index_should_return_string
Error: Typed property App\Http\Controllers\Controller::$viewFactory must not be accessed before initialization

/var/www/abacusSystem-new/app/Http/Controllers/EmployeeController.php:38
/var/www/abacusSystem-new/tests/Feature/App/Http/Controllers/EmployeeControllerTest.php:158

2) Tests\Feature\App\Http\Co

[Killed] MethodCallRemoval
app/Http/Controllers/EmployeeController.php:40:9
         LoggerInterface $logger,
     ) {
         parent::__construct($logger, $viewFactory);
-        $this->setImageManager($imageManager);
+        
 
         $this->orchestratorHandler = $orchestrators;
killedBy: Tests\Feature\App\Http\Controllers\EmployeeControllerTest::test_setImageEmployee_should_return_json_response
statusReason: 1) Tests\Feature\App\Http\Controllers\EmployeeControllerTest::test_setImageEmployee_should_return_json_response
Error: Typed property App\Http\Controllers\EmployeeController::$imageManager must not be accessed before initialization

/var/www/abacusSystem-new/app/Traits/MultimediaTrait.php:42
/var/www/abacusSystem-new/app/Http/Controllers/EmployeeController.php:86
/var/www/abacusSystem-new/tests/Fe

[Killed] PublicVisibility
app/Http/Controllers/EmployeeController.php:46:5
         $this->actionExecutorHandler = $actionExecutorHandler;
     }
 
-    public function index(): JsonResponse|string
+    protected function index(): JsonResponse|string
     {
         $view = $this->viewFactory->make('employee.index')
killedBy: Tests\Feature\App\Http\Controllers\EmployeeControllerTest::test_index_should_return_string
statusReason: 1) Tests\Feature\App\Http\Controllers\EmployeeControllerTest::test_index_should_return_string
Error: Call to protected method App\Http\Controllers\EmployeeController::index() from scope Tests\Feature\App\Http\Controllers\EmployeeControllerTest

/var/www/abacusSystem-new/tests/Feature/App/Http/Controllers/EmployeeControllerTest.php:158

2) Tests\Feature\App\Http\Controllers\EmployeeControllerTest::

[Killed] PublicVisibility
app/Http/Controllers/EmployeeController.php:55:5
         return $this->renderView($view);
     }
 
-    public function getEmployees(Request $request): JsonResponse
+    protected function getEmployees(Request $request): JsonResponse
     {
         return $this->orchestratorHandler->handler('retrieve-employees', $request);
killedBy: Tests\Feature\App\Http\Controllers\EmployeeControllerTest::test_getEmployees_should_return_json_response
statusReason: 1) Tests\Feature\App\Http\Controllers\EmployeeControllerTest::test_getEmployees_should_return_json_response
Error: Call to protected method App\Http\Controllers\EmployeeController::getEmployees() from scope Tests\Feature\App\Http\Controllers\EmployeeControllerTest

/var/www/abacusSystem-new/tests/Feature/App/Http/Controllers/EmployeeControllerTest.php:178

ERRORS!
Tests: 17, Assertions: 109, Error

[Killed] PublicVisibility
app/Http/Controllers/EmployeeController.php:60:5
         return $this->orchestratorHandler->handler('retrieve-employees', $request);
     }
 
-    public function changeStateEmployee(Request $request): JsonResponse
+    protected function changeStateEmployee(Request $request): JsonResponse
     {
         try {
killedBy: Tests\Feature\App\Http\Controllers\EmployeeControllerTest::test_changeStateEmployee_should_inactivate_and_return_json_response
statusReason: 1) Tests\Feature\App\Http\Controllers\EmployeeControllerTest::test_changeStateEmployee_should_inactivate_and_return_json_response
Error: Call to protected method App\Http\Controllers\EmployeeController::changeStateEmployee() from scope Tests\Feature\App\Http\Controllers\EmployeeControllerTest

/var/www/abacusSystem-new/tests/Feature/App/Http/Controllers/EmployeeControllerTest.php:269

2) Tests\Fea

[Killed] MethodCallRemoval
app/Http/Controllers/EmployeeController.php:66:13
             /** @var Employee $employee */
             $employee = $this->orchestratorHandler->handler('change-state-employee', $request);
         } catch (Exception $exception) {
-            $this->logger->error('Employee can not be updated with id: '.$request->input('id'), $exception->getTrace());
+            
 
             return new JsonResponse(status: Response::HTTP_INTERNAL_SERVER_ERROR);
killedBy: Tests\Feature\App\Http\Controllers\EmployeeControllerTest::test_changeStateEmployee_should_return_exception_when_not_found_employee
statusReason: 1) Tests\Feature\App\Http\Controllers\EmployeeControllerTest::test_changeStateEmployee_should_return_exception_when_not_found_employee
Expectation failed for method name is "error" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] Concat
app/Http/Controllers/EmployeeController.php:66:13
             /** @var Employee $employee */
             $employee = $this->orchestratorHandler->handler('change-state-employee', $request);
         } catch (Exception $exception) {
-            $this->logger->error('Employee can not be updated with id: '.$request->input('id'), $exception->getTrace());
+            $this->logger->error($request->input('id') . 'Employee can not be updated with id: ', $exception->getTrace());
 
             return new JsonResponse(status: Response::HTTP_INTERNAL_SERVER_ERROR);
killedBy: Tests\Feature\App\Http\Controllers\EmployeeControllerTest::test_changeStateEmployee_should_return_exception_when_not_found_employee
statusReason: 1) Tests\Feature\App\Http\Controllers\EmployeeControllerTest::test_changeStateEmployee_should_return_exception_when_not_found_employee
Expectation failed for method name is "error" when invoked 1 time
Parameter 0 for invocation Psr\Log\LoggerInterface::error('1Employee can not be updated with id: ', [...]): void does not match expected value.
Failed asserting that two strings are equal.
--- Expect

[Killed] MethodCallRemoval
app/Http/Controllers/EmployeeController.php:74:13
         $userId = $employee->userId()->value();
         if (isset($userId)) {
 
-            $request->merge([
-                'userId' => $userId,
-                'state' => $employee->state()->value()
-            ]);
+            
 
             $this->orchestratorHandler->handler('change-state-user', $request);
killedBy: Tests\Feature\App\Http\Controllers\EmployeeControllerTest::test_changeStateEmployee_should_activate_and_return_json_response
statusReason: 1) Tests\Feature\App\Http\Controllers\EmployeeControllerTest::test_changeStateEmployee_should_activate_and_return_json_response
Expectation failed for method name is "merge" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] MethodCallRemoval
app/Http/Controllers/EmployeeController.php:79:13
                 'state' => $employee->state()->value()
             ]);
 
-            $this->orchestratorHandler->handler('change-state-user', $request);
+            
             UserUpdateOrDeleteEvent::dispatch($userId);
         }
killedBy: Tests\Feature\App\Http\Controllers\EmployeeControllerTest::test_changeStateEmployee_should_activate_and_return_json_response
statusReason: 1) Tests\Feature\App\Http\Controllers\EmployeeControllerTest::test_changeStateEmployee_should_activate_and_return_json_response
Expectation failed for method name is "handler" when invoked 2 times.
Method was expected to be called 2 times, actually called 1 time.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Survived] MethodCallRemoval
app/Http/Controllers/EmployeeController.php:80:13
             ]);
 
             $this->orchestratorHandler->handler('change-state-user', $request);
-            UserUpdateOrDeleteEvent::dispatch($userId);
+            
         }
 

[Killed] PublicVisibility
app/Http/Controllers/EmployeeController.php:86:5
         return new JsonResponse(status:Response::HTTP_CREATED);
     }
 
-    public function getEmployee(Request $request, ?int $employeeId = null): JsonResponse|string
+    protected function getEmployee(Request $request, ?int $employeeId = null): JsonResponse|string
     {
         $request->merge(['employeeId' => $employeeId]);
killedBy: Tests\Feature\App\Http\Controllers\EmployeeControllerTest::test_getEmployee_with_data_should_return_json_response
statusReason: 1) Tests\Feature\App\Http\Controllers\EmployeeControllerTest::test_getEmployee_with_data_should_return_json_response
Error: Call to protected method App\Http\Controllers\EmployeeController::getEmployee() from scope Tests\Feature\App\Http\Controllers\EmployeeControllerTest

/var/www/abacusSystem-new/tests/Feature/App/Http/Controllers/EmployeeControllerTest.php:375

2) Tests\Feature\App\Http\Control

[Killed] MethodCallRemoval
app/Http/Controllers/EmployeeController.php:88:9
 
     public function getEmployee(Request $request, ?int $employeeId = null): JsonResponse|string
     {
-        $request->merge(['employeeId' => $employeeId]);
+        
         $dataEmployee = $this->orchestratorHandler->handler('detail-employee', $request);
 
killedBy: Tests\Feature\App\Http\Controllers\EmployeeControllerTest::test_getEmployee_with_null_should_return_json_response
statusReason: 1) Tests\Feature\App\Http\Controllers\EmployeeControllerTest::test_getEmployee_with_null_should_return_json_response
Expectation failed for method name is "merge" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 6, Failures: 1.

[Killed] PublicVisibility
app/Http/Controllers/EmployeeController.php:97:5
         return $this->renderView($view);
     }
 
-    public function storeEmployee(StoreEmployeeRequest $request): JsonResponse
+    protected function storeEmployee(StoreEmployeeRequest $request): JsonResponse
     {
         try {
killedBy: Tests\Feature\App\Http\Controllers\EmployeeControllerTest::test_storeEmployee_should_return_json_response_with_exception_when_create_new_object
statusReason: 1) Tests\Feature\App\Http\Controllers\EmployeeControllerTest::test_storeEmployee_should_return_json_response_with_exception_when_create_new_object
Error: Call to protected method App\Http\Controllers\EmployeeController::storeEmployee() from scope Tests\Feature\App\Http\Controllers\EmployeeControllerTest

/var/www/abacusSystem-new/tests/Feature/App/Http/Controllers/EmployeeControllerTest.php:485

2

[Killed] Ternary
app/Http/Controllers/EmployeeController.php:100:13
     public function storeEmployee(StoreEmployeeRequest $request): JsonResponse
     {
         try {
-            $method = (! $request->filled('employeeId')) ? 'create-employee-action' : 'update-employee-action';
+            $method = (!$request->filled('employeeId')) ? 'update-employee-action' : 'create-employee-action';
 
             /** @var Employee $employee */
killedBy: Tests\Feature\App\Http\Controllers\EmployeeControllerTest::test_storeEmployee_should_return_json_response_when_create_new_object
statusReason: 1) Tests\Feature\App\Http\Controllers\EmployeeControllerTest::test_storeEmployee_should_return_json_response_when_create_new_object
Failed asserting that an array has the key 'userId'.

/var/www/abacusSystem-new/tests/Feature/App/Http/Controllers/EmployeeControllerTest.php:460

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] LogicalNot
app/Http/Controllers/EmployeeController.php:100:13
     public function storeEmployee(StoreEmployeeRequest $request): JsonResponse
     {
         try {
-            $method = (! $request->filled('employeeId')) ? 'create-employee-action' : 'update-employee-action';
+            $method = $request->filled('employeeId') ? 'create-employee-action' : 'update-employee-action';
 
             /** @var Employee $employee */
killedBy: Tests\Feature\App\Http\Controllers\EmployeeControllerTest::test_storeEmployee_should_return_json_response_when_create_new_object
statusReason: 1) Tests\Feature\App\Http\Controllers\EmployeeControllerTest::test_storeEmployee_should_return_json_response_when_create_new_object
Failed asserting that an array has the key 'userId'.

/var/www/abacusSystem-new/tests/Feature/App/Http/Controllers/EmployeeControllerTest.php:460

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] MethodCallRemoval
app/Http/Controllers/EmployeeController.php:105:13
             /** @var Employee $employee */
             $employee = $this->actionExecutorHandler->invoke($method, $request);
 
-            EmployeeUpdateOrDeletedEvent::dispatch($employee->id()->value());
+            
             UserUpdateOrDeleteEvent::dispatch($employee->userId()->value());
         } catch (Exception $exception) {
killedBy: Tests\Feature\App\Http\Controllers\EmployeeControllerTest::test_storeEmployee_should_return_json_response_when_create_new_object
statusReason: 1) Tests\Feature\App\Http\Controllers\EmployeeControllerTest::test_storeEmployee_should_return_json_response_when_create_new_object
Expectation failed for method name is "id" when invoked 2 times.
Method was expected to be called 2 times, actually called 1 time.

FAILURES!
Tests: 1, Assertions: 7, Failures: 1.

[Killed] MethodCallRemoval
app/Http/Controllers/EmployeeController.php:106:13
             $employee = $this->actionExecutorHandler->invoke($method, $request);
 
             EmployeeUpdateOrDeletedEvent::dispatch($employee->id()->value());
-            UserUpdateOrDeleteEvent::dispatch($employee->userId()->value());
+            
         } catch (Exception $exception) {
             $this->logger->error($exception->getMessage(), $exception->getTrace());
killedBy: Tests\Feature\App\Http\Controllers\EmployeeControllerTest::test_storeEmployee_should_return_json_response_when_create_new_object
statusReason: 1) Tests\Feature\App\Http\Controllers\EmployeeControllerTest::test_storeEmployee_should_return_json_response_when_create_new_object
Expectation failed for method name is "userId" when invoked 2 times.
Method was expected to be called 2 times, actually called 1 time.

FAILURES!
Tests: 1, Assertions: 7, Failures: 1.

[Killed] MethodCallRemoval
app/Http/Controllers/EmployeeController.php:108:13
             EmployeeUpdateOrDeletedEvent::dispatch($employee->id()->value());
             UserUpdateOrDeleteEvent::dispatch($employee->userId()->value());
         } catch (Exception $exception) {
-            $this->logger->error($exception->getMessage(), $exception->getTrace());
+            
 
             return new JsonResponse(
killedBy: Tests\Feature\App\Http\Controllers\EmployeeControllerTest::test_storeEmployee_should_return_json_response_with_exception_when_create_new_object
statusReason: 1) Tests\Feature\App\Http\Controllers\EmployeeControllerTest::test_storeEmployee_should_return_json_response_with_exception_when_create_new_object
Expectation failed for method name is "error" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] ArrayItemRemoval
app/Http/Controllers/EmployeeController.php:111:17
             $this->logger->error($exception->getMessage(), $exception->getTrace());
 
             return new JsonResponse(
-                ['msg' => 'Ha ocurrido un error al guardar el registro, consulte con su administrador de sistemas'],
+                return new JsonResponse([], Response::HTTP_INTERNAL_SERVER_ERROR);
                 Response::HTTP_INTERNAL_SERVER_ERROR
             );
killedBy: Tests\Feature\App\Http\Controllers\EmployeeControllerTest::test_storeEmployee_should_return_json_response_with_exception_when_create_new_object
statusReason: 1) Tests\Feature\App\Http\Controllers\EmployeeControllerTest::test_storeEmployee_should_return_json_response_with_exception_when_create_new_object
Failed asserting that an array has the key 'msg'.

/var/www/abacusSystem-new/tests/Feature/App/Http/Controllers/EmployeeControllerTest.php:489

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] PublicVisibility
app/Http/Controllers/EmployeeController.php:125:5
         );
     }
 
-    public function setImageEmployee(Request $request): JsonResponse
+    protected function setImageEmployee(Request $request): JsonResponse
     {
         $random = Str::random(10);
killedBy: Tests\Feature\App\Http\Controllers\EmployeeControllerTest::test_setImageEmployee_should_return_json_response
statusReason: 1) Tests\Feature\App\Http\Controllers\EmployeeControllerTest::test_setImageEmployee_should_return_json_response
Error: Call to protected method App\Http\Controllers\EmployeeController::setImageEmployee() from scope Tests\Feature\App\Http\Controllers\EmployeeControllerTest

/var/www/abacusSystem-new/tests/Feature/App/Http/Controllers/EmployeeControllerTest.php:520

ERRORS!
Tests: 17, Assertions: 10

[Survived] IncrementInteger
app/Http/Controllers/EmployeeController.php:127:9
 
     public function setImageEmployee(Request $request): JsonResponse
     {
-        $random = Str::random(10);
+        $random = Str::random(11);
         $imageUrl = $this->saveImageTmp($request->file('file')->getRealPath(), $random);
 

[Survived] DecrementInteger
app/Http/Controllers/EmployeeController.php:127:9
 
     public function setImageEmployee(Request $request): JsonResponse
     {
-        $random = Str::random(10);
+        $random = Str::random(9);
         $imageUrl = $this->saveImageTmp($request->file('file')->getRealPath(), $random);
 

[Killed] ArrayItemRemoval
app/Http/Controllers/EmployeeController.php:130:9
         $random = Str::random(10);
         $imageUrl = $this->saveImageTmp($request->file('file')->getRealPath(), $random);
 
-        return new JsonResponse(['token' => $random, 'url' => $imageUrl], Response::HTTP_CREATED);
+        return new JsonResponse(['url' => $imageUrl], Response::HTTP_CREATED);
     }
 
killedBy: Tests\Feature\App\Http\Controllers\EmployeeControllerTest::test_setImageEmployee_should_return_json_response
statusReason: 1) Tests\Feature\App\Http\Controllers\EmployeeControllerTest::test_setImageEmployee_should_return_json_response
Failed asserting that an array has the key 'token'.

/var/www/abacusSystem-new/tests/Feature/App/Http/Controllers/EmployeeControllerTest.php:524

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] PublicVisibility
app/Http/Controllers/EmployeeController.php:133:5
         return new JsonResponse(['token' => $random, 'url' => $imageUrl], Response::HTTP_CREATED);
     }
 
-    public function deleteEmployee(Request $request, int $employeeId): JsonResponse
+    protected function deleteEmployee(Request $request, int $employeeId): JsonResponse
     {
         $request->merge(['employeeId' => $employeeId]);
killedBy: Tests\Feature\App\Http\Controllers\EmployeeControllerTest::test_deleteEmployee_should_return_json_response_with_exception
statusReason: 1) Tests\Feature\App\Http\Controllers\EmployeeControllerTest::test_deleteEmployee_should_return_json_response_with_exception
Error: Call to protected method App\Http\Controllers\EmployeeController::deleteEmployee() from scope Tests\Feature\App\Http\Controllers\EmployeeControllerTest

/var/www/abacusSystem-new/tests/Feature/App/Http/Controllers/EmployeeControllerTest.php:593

2) Tests\Feature\App\H

[Killed] MethodCallRemoval
app/Http/Controllers/EmployeeController.php:142:13
 
         try {
 
-            $this->orchestratorHandler->handler('delete-employee', $request);
+            
             $this->deleteImage($employee->image()->value());
         } catch (Exception $exception) {
killedBy: Tests\Feature\App\Http\Controllers\EmployeeControllerTest::test_deleteEmployee_should_return_json_response
statusReason: 1) Tests\Feature\App\Http\Controllers\EmployeeControllerTest::test_deleteEmployee_should_return_json_response
Expectation failed for method name is "handler" when invoked 3 times.
Method was expected to be called 3 times, actually called 2 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
app/Http/Controllers/EmployeeController.php:143:13
         try {
 
             $this->orchestratorHandler->handler('delete-employee', $request);
-            $this->deleteImage($employee->image()->value());
+            
         } catch (Exception $exception) {
             $this->logger->error($exception->getMessage(), $exception->getTrace());
killedBy: Tests\Feature\App\Http\Controllers\EmployeeControllerTest::test_deleteEmployee_should_return_json_response
statusReason: 1) Tests\Feature\App\Http\Controllers\EmployeeControllerTest::test_deleteEmployee_should_return_json_response
Expectation failed for method name is "image" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.

[Killed] MethodCallRemoval
app/Http/Controllers/EmployeeController.php:152:13
 
         $userId = $employee->userId()->value();
         if (isset($userId)) {
-            $request->merge(['userId' => $userId]);
+            
             $this->orchestratorHandler->handler('delete-user', $request);
         }
killedBy: Tests\Feature\App\Http\Controllers\EmployeeControllerTest::test_deleteEmployee_should_return_json_response
statusReason: 1) Tests\Feature\App\Http\Controllers\EmployeeControllerTest::test_deleteEmployee_should_return_json_response
Expectation failed for method name is "merge" when invoked 2 times.
Method was expected to be called 2 times, actually called 1 time.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] MethodCallRemoval
app/Http/Controllers/EmployeeController.php:153:13
         $userId = $employee->userId()->value();
         if (isset($userId)) {
             $request->merge(['userId' => $userId]);
-            $this->orchestratorHandler->handler('delete-user', $request);
+            
         }
 
killedBy: Tests\Feature\App\Http\Controllers\EmployeeControllerTest::test_deleteEmployee_should_return_json_response
statusReason: 1) Tests\Feature\App\Http\Controllers\EmployeeControllerTest::test_deleteEmployee_should_return_json_response
Expectation failed for method name is "handler" when invoked 3 times.
Method was expected to be called 3 times, actually called 2 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Survived] ArrayItemRemoval
app/Http/Controllers/EmployeeController.php:165:13
     public static function middleware(): Middleware|array
     {
         return [
-            new Middleware(['auth', 'verify-session']),
+            return [new Middleware(['verify-session']), new Middleware('only.ajax-request', only: ['getEmployees', 'setImageEmployee', 'deleteEmployee', 'changeStateEmployee', 'storeEmployee'])];
             new Middleware('only.ajax-request', only: [
                 'getEmployees', 'setImageEmployee', 'deleteEmployee', 'changeStateEmployee', 'storeEmployee',
