[Killed] MethodCallRemoval
app/Http/Controllers/InstitutionController.php:37:9
     ) {
         parent::__construct($logger, $viewFactory);
 
-        $this->setImageManager($imageManager);
+        
         $this->orchestratorHandler = $orchestratorHandler;
         $this->actionExecutorHandler = $actionExecutorHandler;
killedBy: Tests\Feature\App\Http\Controllers\InstitutionControllerTest::test_setLogoInstitution_should_return_json_response
statusReason: 1) Tests\Feature\App\Http\Controllers\InstitutionControllerTest::test_setLogoInstitution_should_return_json_response
Error: Typed property App\Http\Controllers\InstitutionController::$imageManager must not be accessed before initialization

/var/www/abacusSystem-new/app/Traits/MultimediaTrait.php:42
/var/www/abacusSystem-new/app/Http/Controllers/InstitutionController.php:64
/var/www/abacusSystem-n

[Killed] PublicVisibility
app/Http/Controllers/InstitutionController.php:41:5
         $this->orchestratorHandler = $orchestratorHandler;
         $this->actionExecutorHandler = $actionExecutorHandler;
     }
-    public function index(): JsonResponse|string
+    protected function index(): JsonResponse|string
     {
         $view = $this->viewFactory->make('institution.index')
killedBy: Tests\Feature\App\Http\Controllers\InstitutionControllerTest::test_index_should_return_string
statusReason: 1) Tests\Feature\App\Http\Controllers\InstitutionControllerTest::test_index_should_return_string
Error: Call to protected method App\Http\Controllers\InstitutionController::index() from scope Tests\Feature\App\Http\Controllers\InstitutionControllerTest

/var/www/abacusSystem-new/tests/Feature/App/Http/Controllers/InstitutionControllerTest.php:154

2) Tests\Feature\App\Http\Controllers\InstitutionC

[Killed] PublicVisibility
app/Http/Controllers/InstitutionController.php:53:5
     /**
      * @throws Exception
      */
-    public function changeStateInstitution(Request $request): JsonResponse
+    protected function changeStateInstitution(Request $request): JsonResponse
     {
         try {
killedBy: Tests\Feature\App\Http\Controllers\InstitutionControllerTest::test_changeStateInstitution_should_return_json_response_when_is_exception
statusReason: 1) Tests\Feature\App\Http\Controllers\InstitutionControllerTest::test_changeStateInstitution_should_return_json_response_when_is_exception
Error: Call to protected method App\Http\Controllers\InstitutionController::changeStateInstitution() from scope Tests\Feature\App\Http\Controllers\InstitutionControllerTest

/var/www/abacusSystem-new/tests/Feature/App/Http/Controllers/InstitutionControllerTest.

[Killed] MethodCallRemoval
app/Http/Controllers/InstitutionController.php:56:13
     public function changeStateInstitution(Request $request): JsonResponse
     {
         try {
-            $this->orchestratorHandler->handler('change-state-institution', $request);
+            
         } catch (Exception $exception) {
             $this->logger->error($exception->getMessage(), $exception->getTrace());
killedBy: Tests\Feature\App\Http\Controllers\InstitutionControllerTest::test_changeStateInstitution_should_return_json_response_when_is_activate
statusReason: 1) Tests\Feature\App\Http\Controllers\InstitutionControllerTest::test_changeStateInstitution_should_return_json_response_when_is_activate
Expectation failed for method name is "handler" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] PublicVisibility
app/Http/Controllers/InstitutionController.php:66:5
         return new JsonResponse(status: Response::HTTP_CREATED);
     }
 
-    public function getInstitutions(Request $request): JsonResponse
+    protected function getInstitutions(Request $request): JsonResponse
     {
         return $this->orchestratorHandler->handler('retrieve-institutions', $request);
killedBy: Tests\Feature\App\Http\Controllers\InstitutionControllerTest::test_getInstitutions_should_return_json_response
statusReason: 1) Tests\Feature\App\Http\Controllers\InstitutionControllerTest::test_getInstitutions_should_return_json_response
Error: Call to protected method App\Http\Controllers\InstitutionController::getInstitutions() from scope Tests\Feature\App\Http\Controllers\InstitutionControllerTest

/var/www/abacusSystem-new/tests/Feature/App/Http/Controllers/InstitutionControllerTest.php:216

ERRORS!
Tests: 14, Asse

[Killed] PublicVisibility
app/Http/Controllers/InstitutionController.php:71:5
         return $this->orchestratorHandler->handler('retrieve-institutions', $request);
     }
 
-    public function getInstitution(Request $request, ?int $id = null): JsonResponse|string
+    protected function getInstitution(Request $request, ?int $id = null): JsonResponse|string
     {
         $request->merge(['institutionId' => $id]);
killedBy: Tests\Feature\App\Http\Controllers\InstitutionControllerTest::test_getInstitution_should_return_string_with_id_null
statusReason: 1) Tests\Feature\App\Http\Controllers\InstitutionControllerTest::test_getInstitution_should_return_string_with_id_null
Error: Call to protected method App\Http\Controllers\InstitutionController::getInstitution() from scope Tests\Feature\App\Http\Controllers\InstitutionControllerTest

/var/www/abacusSystem-new/tests/Feature/App/Http/Controllers/InstitutionControllerTest.php:295

2) Tests\Feature\Ap

[Killed] MethodCallRemoval
app/Http/Controllers/InstitutionController.php:73:9
 
     public function getInstitution(Request $request, ?int $id = null): JsonResponse|string
     {
-        $request->merge(['institutionId' => $id]);
+        
         $dataInstitution = $this->orchestratorHandler->handler('detail-institution', $request);
 
killedBy: Tests\Feature\App\Http\Controllers\InstitutionControllerTest::test_getInstitution_should_return_json_response_with_id_int
statusReason: 1) Tests\Feature\App\Http\Controllers\InstitutionControllerTest::test_getInstitution_should_return_json_response_with_id_int
Expectation failed for method name is "merge" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 6, Failures: 1.

[Killed] PublicVisibility
app/Http/Controllers/InstitutionController.php:82:5
         return $this->renderView($view);
     }
 
-    public function setLogoInstitution(Request $request): JsonResponse
+    protected function setLogoInstitution(Request $request): JsonResponse
     {
         $random = Str::random(10);
killedBy: Tests\Feature\App\Http\Controllers\InstitutionControllerTest::test_setLogoInstitution_should_return_json_response
statusReason: 1) Tests\Feature\App\Http\Controllers\InstitutionControllerTest::test_setLogoInstitution_should_return_json_response
Error: Call to protected method App\Http\Controllers\InstitutionController::setLogoInstitution() from scope Tests\Feature\App\Http\Controllers\InstitutionControllerTest

/var/www/abacusSystem-new/tests/Feature/App/Http/Controllers/InstitutionControllerTest.php:329

ERRORS!
Tests: 14

[Killed] PublicVisibility
app/Http/Controllers/InstitutionController.php:90:5
         return new JsonResponse(['token' => $random, 'url' => $imageUrl], Response::HTTP_CREATED);
     }
 
-    public function storeInstitution(StoreInstitutionRequest $request): JsonResponse
+    protected function storeInstitution(StoreInstitutionRequest $request): JsonResponse
     {
         try {
killedBy: Tests\Feature\App\Http\Controllers\InstitutionControllerTest::test_storeInstitution_should_return_json_response_with_exception_when_create_institution
statusReason: 1) Tests\Feature\App\Http\Controllers\InstitutionControllerTest::test_storeInstitution_should_return_json_response_with_exception_when_create_institution
Error: Call to protected method App\Http\Controllers\InstitutionController::storeInstitution() from scope Tests\Feature\App\Http\Controllers\InstitutionControllerTest

/var/www/abacusSystem-new/tests/Feature/App/Http/Controllers/InstitutionContro

[Killed] Ternary
app/Http/Controllers/InstitutionController.php:93:13
     public function storeInstitution(StoreInstitutionRequest $request): JsonResponse
     {
         try {
-            $method = (is_null($request->input('institutionId'))) ? 'create-institution-action' : 'update-institution-action';
+            $method = is_null($request->input('institutionId')) ? 'update-institution-action' : 'create-institution-action';
 
             /** @var Institution $institution */
killedBy: Tests\Feature\App\Http\Controllers\InstitutionControllerTest::test_storeInstitution_should_return_json_response_when_create_institution
statusReason: 1) Tests\Feature\App\Http\Controllers\InstitutionControllerTest::test_storeInstitution_should_return_json_response_when_create_institution
Failed asserting that 500 is identical to 201.

/var/www/abacusSystem-new/tests/Feature/App/Http/Controllers/InstitutionControllerTest.php:366

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] ArrayItemRemoval
app/Http/Controllers/InstitutionController.php:102:17
             $this->logger->error($exception->getMessage(), $exception->getTrace());
 
             return new JsonResponse(
-                ['msg' => 'ha ocurrido un error al guardar el registro, consulta con su administrador de sistema'],
+                return new JsonResponse([], Response::HTTP_INTERNAL_SERVER_ERROR);
                 Response::HTTP_INTERNAL_SERVER_ERROR
             );
killedBy: Tests\Feature\App\Http\Controllers\InstitutionControllerTest::test_storeInstitution_should_return_json_response_with_exception_when_create_institution
statusReason: 1) Tests\Feature\App\Http\Controllers\InstitutionControllerTest::test_storeInstitution_should_return_json_response_with_exception_when_create_institution
Failed asserting that an array has the key 'msg'.

/var/www/abacusSystem-new/tests/Feature/App/Http/Controllers/InstitutionControllerTest.php:394

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] ArrayItemRemoval
app/Http/Controllers/InstitutionController.php:107:9
             );
         }
 
-        return new JsonResponse([
-            'institutionId' => $institution->id()->value()
-        ], Response::HTTP_CREATED);
+        return new JsonResponse([], Response::HTTP_CREATED););
     }
 
killedBy: Tests\Feature\App\Http\Controllers\InstitutionControllerTest::test_storeInstitution_should_return_json_response_when_create_institution
statusReason: 1) Tests\Feature\App\Http\Controllers\InstitutionControllerTest::test_storeInstitution_should_return_json_response_when_create_institution
Failed asserting that an array has the key 'institutionId'.

/var/www/abacusSystem-new/tests/Feature/App/Http/Controllers/InstitutionControllerTest.php:367

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] PublicVisibility
app/Http/Controllers/InstitutionController.php:112:5
         ], Response::HTTP_CREATED);
     }
 
-    public function deleteInstitution(Request $request, int $id): JsonResponse
+    protected function deleteInstitution(Request $request, int $id): JsonResponse
     {
         $request->merge(['institutionId' => $id]);
killedBy: Tests\Feature\App\Http\Controllers\InstitutionControllerTest::test_deleteInstitution_should_return_json_response_with_exception
statusReason: 1) Tests\Feature\App\Http\Controllers\InstitutionControllerTest::test_deleteInstitution_should_return_json_response_with_exception
Error: Call to protected method App\Http\Controllers\InstitutionController::deleteInstitution() from scope Tests\Feature\App\Http\Controllers\InstitutionControllerTest

/var/www/abacusSystem-new/tests/Feature/App/Http/Controllers/InstitutionControllerTest.php:472

2) T

[Killed] MethodCallRemoval
app/Http/Controllers/InstitutionController.php:117:13
         $request->merge(['institutionId' => $id]);
 
         try {
-            $this->orchestratorHandler->handler('delete-institution', $request);
+            
         } catch (Exception $exception) {
             $this->logger->error($exception->getMessage(), $exception->getTrace());
killedBy: Tests\Feature\App\Http\Controllers\InstitutionControllerTest::test_deleteInstitution_should_return_json_response
statusReason: 1) Tests\Feature\App\Http\Controllers\InstitutionControllerTest::test_deleteInstitution_should_return_json_response
Expectation failed for method name is "handler" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.
