[Killed] PublicVisibility
app/Http/Controllers/ModuleController.php:45:5
         return $this->renderView($view);
     }
 
-    public function getModules(Request $request): JsonResponse
+    protected function getModules(Request $request): JsonResponse
     {
         return $this->orchestratorHandler->handler('retrieve-modules', $request);
killedBy: Tests\Feature\App\Http\Controllers\ModuleControllerTest::test_getModules_should_return_json_response
statusReason: 1) Tests\Feature\App\Http\Controllers\ModuleControllerTest::test_getModules_should_return_json_response
Error: Call to protected method App\Http\Controllers\ModuleController::getModules() from scope Tests\Feature\App\Http\Controllers\ModuleControllerTest

/var/www/abacusSystem-new/tests/Feature/App/Http/Controllers/ModuleControllerTest.php:166

ERRORS!
Tests: 13, Assertions: 69, Errors: 1.

[Killed] PublicVisibility
app/Http/Controllers/ModuleController.php:50:5
         return $this->orchestratorHandler->handler('retrieve-modules', $request);
     }
 
-    public function changeStateModule(Request $request): JsonResponse
+    protected function changeStateModule(Request $request): JsonResponse
     {
         try {
killedBy: Tests\Feature\App\Http\Controllers\ModuleControllerTest::test_changeStateModule_should_return_json_response_when_is_exception
statusReason: 1) Tests\Feature\App\Http\Controllers\ModuleControllerTest::test_changeStateModule_should_return_json_response_when_is_exception
Error: Call to protected method App\Http\Controllers\ModuleController::changeStateModule() from scope Tests\Feature\App\Http\Controllers\ModuleControllerTest

/var/www/abacusSystem-new/tests/Feature/App/Http/Controllers/ModuleControllerTest.php:219

2) Tests\Feature\App\

[Killed] MethodCallRemoval
app/Http/Controllers/ModuleController.php:56:13
             /** @var Module $module */
             $module = $this->orchestratorHandler->handler('change-state-module', $request);
 
-            ModuleUpdatedOrDeletedEvent::dispatch($module->id()->value());
+            
         } catch (Exception $exception) {
             $this->logger->error('Module can not be updated with id: '.$request->input('moduleId'), $exception->getTrace());
killedBy: Tests\Feature\App\Http\Controllers\ModuleControllerTest::test_changeStateModule_should_return_json_response
statusReason: 1) Tests\Feature\App\Http\Controllers\ModuleControllerTest::test_changeStateModule_should_return_json_response
Expectation failed for method name is "id" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] ConcatOperandRemoval
app/Http/Controllers/ModuleController.php:58:13
 
             ModuleUpdatedOrDeletedEvent::dispatch($module->id()->value());
         } catch (Exception $exception) {
-            $this->logger->error('Module can not be updated with id: '.$request->input('moduleId'), $exception->getTrace());
+            $this->logger->error('Module can not be updated with id: ', $exception->getTrace());
 
             return new JsonResponse(status: Response::HTTP_INTERNAL_SERVER_ERROR);
killedBy: Tests\Feature\App\Http\Controllers\ModuleControllerTest::test_changeStateModule_should_return_json_response_when_is_exception
statusReason: 1) Tests\Feature\App\Http\Controllers\ModuleControllerTest::test_changeStateModule_should_return_json_response_when_is_exception
Expectation failed for method name is "error" when invoked 1 time
Parameter 0 for invocation Psr\Log\LoggerInterface::error('Module can not be updated with id: ', [...]): void does not match expected value.
Failed asserting that two strings are equal.
--- Expected
+++ Ac

[Killed] MethodCallRemoval
app/Http/Controllers/ModuleController.php:58:13
 
             ModuleUpdatedOrDeletedEvent::dispatch($module->id()->value());
         } catch (Exception $exception) {
-            $this->logger->error('Module can not be updated with id: '.$request->input('moduleId'), $exception->getTrace());
+            
 
             return new JsonResponse(status: Response::HTTP_INTERNAL_SERVER_ERROR);
killedBy: Tests\Feature\App\Http\Controllers\ModuleControllerTest::test_changeStateModule_should_return_json_response_when_is_exception
statusReason: 1) Tests\Feature\App\Http\Controllers\ModuleControllerTest::test_changeStateModule_should_return_json_response_when_is_exception
Expectation failed for method name is "error" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] PublicVisibility
app/Http/Controllers/ModuleController.php:66:5
         return new JsonResponse(status: Response::HTTP_OK);
     }
 
-    public function getModule(Request $request, ?int $id = null): JsonResponse
+    protected function getModule(Request $request, ?int $id = null): JsonResponse
     {
         $request->merge(['moduleId' => $id]);
killedBy: Tests\Feature\App\Http\Controllers\ModuleControllerTest::test_getModule_should_return_json_response_when_id_is_null
statusReason: 1) Tests\Feature\App\Http\Controllers\ModuleControllerTest::test_getModule_should_return_json_response_when_id_is_null
Error: Call to protected method App\Http\Controllers\ModuleController::getModule() from scope Tests\Feature\App\Http\Controllers\ModuleControllerTest

/var/www/abacusSystem-new/tests/Feature/App/Http/Controllers/ModuleControllerTest.php:258

ERRORS!
Tests: 13, Assertions: 65, Erro

[Killed] MethodCallRemoval
app/Http/Controllers/ModuleController.php:68:9
 
     public function getModule(Request $request, ?int $id = null): JsonResponse
     {
-        $request->merge(['moduleId' => $id]);
+        
         $dataModule = $this->orchestratorHandler->handler('detail-module', $request);
 
killedBy: Tests\Feature\App\Http\Controllers\ModuleControllerTest::test_getModule_should_return_json_response_when_id_is_null
statusReason: 1) Tests\Feature\App\Http\Controllers\ModuleControllerTest::test_getModule_should_return_json_response_when_id_is_null
Expectation failed for method name is "merge" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 6, Failures: 1.

[Killed] PublicVisibility
app/Http/Controllers/ModuleController.php:77:5
         return $this->renderView($view);
     }
 
-    public function storeModule(StoreModuleRequest $request): JsonResponse
+    protected function storeModule(StoreModuleRequest $request): JsonResponse
     {
         try {
killedBy: Tests\Feature\App\Http\Controllers\ModuleControllerTest::test_storeModule_should_return_json_response_when_exception_routing
statusReason: 1) Tests\Feature\App\Http\Controllers\ModuleControllerTest::test_storeModule_should_return_json_response_when_exception_routing
Error: Call to protected method App\Http\Controllers\ModuleController::storeModule() from scope Tests\Feature\App\Http\Controllers\ModuleControllerTest

/var/www/abacusSystem-new/tests/Feature/App/Http/Controllers/ModuleControllerTest.php:317

2) Tests\Feature\App\Http\Co

[Killed] Ternary
app/Http/Controllers/ModuleController.php:80:13
     public function storeModule(StoreModuleRequest $request): JsonResponse
     {
         try {
-            $method = (is_null($request->input('moduleId'))) ? 'create-module-action' : 'update-module-action';
+            $method = is_null($request->input('moduleId')) ? 'update-module-action' : 'create-module-action';
 
             /** @var Module $module */
killedBy: Tests\Feature\App\Http\Controllers\ModuleControllerTest::test_storeModule_should_create_new_module_and_return_json_response
statusReason: 1) Tests\Feature\App\Http\Controllers\ModuleControllerTest::test_storeModule_should_create_new_module_and_return_json_response
Failed asserting that 500 is identical to 201.

/var/www/abacusSystem-new/tests/Feature/App/Http/Controllers/ModuleControllerTest.php:294

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] PublicVisibility
app/Http/Controllers/ModuleController.php:98:5
         return new JsonResponse(status: Response::HTTP_CREATED);
     }
 
-    public function deleteModule(Request $request, int $id): JsonResponse
+    protected function deleteModule(Request $request, int $id): JsonResponse
     {
         try {
killedBy: Tests\Feature\App\Http\Controllers\ModuleControllerTest::test_deleteModule_should_return_json_response_when_is_exception
statusReason: 1) Tests\Feature\App\Http\Controllers\ModuleControllerTest::test_deleteModule_should_return_json_response_when_is_exception
Error: Call to protected method App\Http\Controllers\ModuleController::deleteModule() from scope Tests\Feature\App\Http\Controllers\ModuleControllerTest

/var/www/abacusSystem-new/tests/Feature/App/Http/Controllers/ModuleControllerTest.php:425

2) Tests\Feature\App\Http\Contr

[Killed] MethodCallRemoval
app/Http/Controllers/ModuleController.php:101:13
     public function deleteModule(Request $request, int $id): JsonResponse
     {
         try {
-            $request->merge(['moduleId' => $id]);
+            
             $this->orchestratorHandler->handler('delete-module', $request);
 
killedBy: Tests\Feature\App\Http\Controllers\ModuleControllerTest::test_deleteModule_should_return_json_response
statusReason: 1) Tests\Feature\App\Http\Controllers\ModuleControllerTest::test_deleteModule_should_return_json_response
Expectation failed for method name is "merge" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] MethodCallRemoval
app/Http/Controllers/ModuleController.php:102:13
     {
         try {
             $request->merge(['moduleId' => $id]);
-            $this->orchestratorHandler->handler('delete-module', $request);
+            
 
             ModuleUpdatedOrDeletedEvent::dispatch($id);
killedBy: Tests\Feature\App\Http\Controllers\ModuleControllerTest::test_deleteModule_should_return_json_response
statusReason: 1) Tests\Feature\App\Http\Controllers\ModuleControllerTest::test_deleteModule_should_return_json_response
Expectation failed for method name is "handler" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Survived] MethodCallRemoval
app/Http/Controllers/ModuleController.php:104:13
             $request->merge(['moduleId' => $id]);
             $this->orchestratorHandler->handler('delete-module', $request);
 
-            ModuleUpdatedOrDeletedEvent::dispatch($id);
+            
         } catch (Exception $exception) {
             $this->logger->error($exception->getMessage(), $exception->getTrace());

[Survived] ArrayItemRemoval
app/Http/Controllers/ModuleController.php:120:13
     public static function middleware(): array
     {
         return [
-            new Middleware(['auth', 'verify-session']),
+            return [new Middleware(['verify-session']), new Middleware('only.ajax-request', only: ['getModules', 'changeStateModule', 'deleteModule', 'getModule', 'storeModule'])];
             new Middleware('only.ajax-request', only: [
                 'getModules',
