[Killed] PublicVisibility
app/Http/Controllers/ProfileController.php:48:5
     /**
      * @throws Exception
      */
-    public function getProfiles(Request $request): JsonResponse
+    protected function getProfiles(Request $request): JsonResponse
     {
         return $this->orchestratorHandler->handler('retrieve-profiles', $request);
killedBy: Tests\Feature\App\Http\Controllers\ProfileControllerTest::test_getProfiles_should_return_json_response
statusReason: 1) Tests\Feature\App\Http\Controllers\ProfileControllerTest::test_getProfiles_should_return_json_response
Error: Call to protected method App\Http\Controllers\ProfileController::getProfiles() from scope Tests\Feature\App\Http\Controllers\ProfileControllerTest

/var/www/abacusSystem-new/tests/Feature/App/Http/Controllers/ProfileControllerTest.php:166

ERRORS!
Tests: 12, Assertions: 63, Errors: 1.

[Killed] PublicVisibility
app/Http/Controllers/ProfileController.php:53:5
         return $this->orchestratorHandler->handler('retrieve-profiles', $request);
     }
 
-    public function changeStateProfile(Request $request): JsonResponse
+    protected function changeStateProfile(Request $request): JsonResponse
     {
         try {
killedBy: Tests\Feature\App\Http\Controllers\ProfileControllerTest::test_changeStateProfile_should_return_json_response_when_is_exception
statusReason: 1) Tests\Feature\App\Http\Controllers\ProfileControllerTest::test_changeStateProfile_should_return_json_response_when_is_exception
Error: Call to protected method App\Http\Controllers\ProfileController::changeStateProfile() from scope Tests\Feature\App\Http\Controllers\ProfileControllerTest

/var/www/abacusSystem-new/tests/Feature/App/Http/Controllers/ProfileControllerTest.php:219

2) Tests\Featur

[Killed] MethodCallRemoval
app/Http/Controllers/ProfileController.php:59:13
             /** @var Profile $profile */
             $profile = $this->orchestratorHandler->handler('change-state-profile', $request);
 
-            ProfileUpdatedOrDeletedEvent::dispatch($profile->id()->value());
+            
         } catch (Exception $exception) {
             $this->logger->error($exception->getMessage(), $exception->getTrace());
killedBy: Tests\Feature\App\Http\Controllers\ProfileControllerTest::test_changeStateProfile_should_return_json_response
statusReason: 1) Tests\Feature\App\Http\Controllers\ProfileControllerTest::test_changeStateProfile_should_return_json_response
Expectation failed for method name is "id" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] PublicVisibility
app/Http/Controllers/ProfileController.php:69:5
         return new JsonResponse(status: Response::HTTP_OK);
     }
 
-    public function deleteProfile(Request $request, int $id): JsonResponse
+    protected function deleteProfile(Request $request, int $id): JsonResponse
     {
         try {
killedBy: Tests\Feature\App\Http\Controllers\ProfileControllerTest::test_deleteProfile_should_return_json_response_when_is_exception
statusReason: 1) Tests\Feature\App\Http\Controllers\ProfileControllerTest::test_deleteProfile_should_return_json_response_when_is_exception
Error: Call to protected method App\Http\Controllers\ProfileController::deleteProfile() from scope Tests\Feature\App\Http\Controllers\ProfileControllerTest

/var/www/abacusSystem-new/tests/Feature/App/Http/Controllers/ProfileControllerTest.php:267

2) Tests\Feature\App\Http

[Killed] MethodCallRemoval
app/Http/Controllers/ProfileController.php:72:13
     public function deleteProfile(Request $request, int $id): JsonResponse
     {
         try {
-            $request->merge(['profileId' => $id]);
+            
 
             $this->orchestratorHandler->handler('delete-profile', $request);
killedBy: Tests\Feature\App\Http\Controllers\ProfileControllerTest::test_deleteProfile_should_return_json_response
statusReason: 1) Tests\Feature\App\Http\Controllers\ProfileControllerTest::test_deleteProfile_should_return_json_response
Expectation failed for method name is "merge" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] MethodCallRemoval
app/Http/Controllers/ProfileController.php:74:13
         try {
             $request->merge(['profileId' => $id]);
 
-            $this->orchestratorHandler->handler('delete-profile', $request);
+            
             ProfileUpdatedOrDeletedEvent::dispatch($id);
 
killedBy: Tests\Feature\App\Http\Controllers\ProfileControllerTest::test_deleteProfile_should_return_json_response
statusReason: 1) Tests\Feature\App\Http\Controllers\ProfileControllerTest::test_deleteProfile_should_return_json_response
Expectation failed for method name is "handler" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Survived] MethodCallRemoval
app/Http/Controllers/ProfileController.php:75:13
             $request->merge(['profileId' => $id]);
 
             $this->orchestratorHandler->handler('delete-profile', $request);
-            ProfileUpdatedOrDeletedEvent::dispatch($id);
+            
 
         } catch (Exception $exception) {

[Killed] PublicVisibility
app/Http/Controllers/ProfileController.php:86:5
         return new JsonResponse(status: Response::HTTP_OK);
     }
 
-    public function getProfile(Request $request, ?int $id = null): JsonResponse
+    protected function getProfile(Request $request, ?int $id = null): JsonResponse
     {
         $request->merge(['profileId' => $id]);
killedBy: Tests\Feature\App\Http\Controllers\ProfileControllerTest::test_getProfile_should_return_json_response_when_id_is_null
statusReason: 1) Tests\Feature\App\Http\Controllers\ProfileControllerTest::test_getProfile_should_return_json_response_when_id_is_null
Error: Call to protected method App\Http\Controllers\ProfileController::getProfile() from scope Tests\Feature\App\Http\Controllers\ProfileControllerTest

/var/www/abacusSystem-new/tests/Feature/App/Http/Controllers/ProfileControllerTest.php:306

ERRORS!
Tests: 12, Assertions: 59

[Killed] MethodCallRemoval
app/Http/Controllers/ProfileController.php:88:9
 
     public function getProfile(Request $request, ?int $id = null): JsonResponse
     {
-        $request->merge(['profileId' => $id]);
+        
         $dataProfile = $this->orchestratorHandler->handler('detail-profile', $request);
 
killedBy: Tests\Feature\App\Http\Controllers\ProfileControllerTest::test_getProfile_should_return_json_response_when_id_is_null
statusReason: 1) Tests\Feature\App\Http\Controllers\ProfileControllerTest::test_getProfile_should_return_json_response_when_id_is_null
Expectation failed for method name is "merge" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 6, Failures: 1.

[Killed] PublicVisibility
app/Http/Controllers/ProfileController.php:97:5
         return $this->renderView($view);
     }
 
-    public function storeProfile(StoreProfileRequest $request): JsonResponse
+    protected function storeProfile(StoreProfileRequest $request): JsonResponse
     {
         try {
killedBy: Tests\Feature\App\Http\Controllers\ProfileControllerTest::test_storeProfile_should_update_profile_when_id_is_not_null
statusReason: 1) Tests\Feature\App\Http\Controllers\ProfileControllerTest::test_storeProfile_should_update_profile_when_id_is_not_null
Error: Call to protected method App\Http\Controllers\ProfileController::storeProfile() from scope Tests\Feature\App\Http\Controllers\ProfileControllerTest

/var/www/abacusSystem-new/tests/Feature/App/Http/Controllers/ProfileControllerTest.php:371

2) Tests\Feature\App\Http\Contr

[Killed] Ternary
app/Http/Controllers/ProfileController.php:100:13
     public function storeProfile(StoreProfileRequest $request): JsonResponse
     {
         try {
-            $method = (is_null($request->input('profileId'))) ? 'create-profile-action' : 'update-profile-action';
+            $method = is_null($request->input('profileId')) ? 'update-profile-action' : 'create-profile-action';
 
             /** @var Profile $profile */
killedBy: Tests\Feature\App\Http\Controllers\ProfileControllerTest::test_storeProfile_should_create_profile_when_id_is_null
statusReason: 1) Tests\Feature\App\Http\Controllers\ProfileControllerTest::test_storeProfile_should_create_profile_when_id_is_null
Failed asserting that 500 is identical to 201.

/var/www/abacusSystem-new/tests/Feature/App/Http/Controllers/ProfileControllerTest.php:342

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.
