[Killed] MethodCallRemoval
app/Http/Controllers/UserController.php:36:9
         UrlGenerator $urlGenerator
     ) {
         parent::__construct($logger, $viewFactory);
-        $this->setHasher($hasher);
+        
 
         $this->orchestratorHandler = $orchestratorHandler;
killedBy: Tests\Feature\App\Http\Controllers\UserControllerTest::test_resetPassword_should_return_json_response
statusReason: 1) Tests\Feature\App\Http\Controllers\UserControllerTest::test_resetPassword_should_return_json_response
Error: Typed property App\Http\Controllers\UserController::$hasher must not be accessed before initialization

/var/www/abacusSystem-new/app/Traits/UserTrait.php:18
/var/www/abacusSystem-new/app/Http/Controllers/UserController.php:56
/var/www/abacusSystem-new/tests/Feature/App/Http/Controllers/

[Killed] PublicVisibility
app/Http/Controllers/UserController.php:51:5
         return $this->renderView($view);
     }
 
-    public function recoveryAccount(): JsonResponse|string
+    protected function recoveryAccount(): JsonResponse|string
     {
         $view = $this->viewFactory->make('user.recovery-account')->render();
killedBy: Tests\Feature\App\Http\Controllers\UserControllerTest::test_recoveryAccount_should_return_string
statusReason: 1) Tests\Feature\App\Http\Controllers\UserControllerTest::test_recoveryAccount_should_return_string
Error: Call to protected method App\Http\Controllers\UserController::recoveryAccount() from scope Tests\Feature\App\Http\Controllers\UserControllerTest

/var/www/abacusSystem-new/tests/Feature/App/Http/Controllers/UserControllerTest.php:211

2) Tests\Feature\App\Http\Controllers\UserControllerTest::

[Killed] PublicVisibility
app/Http/Controllers/UserController.php:58:5
         return $this->renderView($view);
     }
 
-    public function validateAccount(RecoveryAccountRequest $request): JsonResponse
+    protected function validateAccount(RecoveryAccountRequest $request): JsonResponse
     {
         /** @var Employee $employee */
killedBy: Tests\Feature\App\Http\Controllers\UserControllerTest::test_validateAccount_should_return_json_response
statusReason: 1) Tests\Feature\App\Http\Controllers\UserControllerTest::test_validateAccount_should_return_json_response
Error: Call to protected method App\Http\Controllers\UserController::validateAccount() from scope Tests\Feature\App\Http\Controllers\UserControllerTest

/var/www/abacusSystem-new/tests/Feature/App/Http/Controllers/UserControllerTest.php:245

ERRORS!
Tests: 8, Assertions: 39, Errors: 1.

[Killed] PublicVisibility
app/Http/Controllers/UserController.php:68:5
         return new JsonResponse(['link' => $link]);
     }
 
-    public function resetAccount(int $id): Response
+    protected function resetAccount(int $id): Response
     {
         $view = $this->viewFactory->make('user.restart-password', [
killedBy: Tests\Feature\App\Http\Controllers\UserControllerTest::test_resetAccount_should_return_response
statusReason: 1) Tests\Feature\App\Http\Controllers\UserControllerTest::test_resetAccount_should_return_response
Error: Call to protected method App\Http\Controllers\UserController::resetAccount() from scope Tests\Feature\App\Http\Controllers\UserControllerTest

/var/www/abacusSystem-new/tests/Feature/App/Http/Controllers/UserControllerTest.php:273

ERRORS!
Tests: 8, Assertions: 42, Errors: 1.

[Killed] TrueValue
app/Http/Controllers/UserController.php:72:13
     {
         $view = $this->viewFactory->make('user.restart-password', [
             'userId' => $id,
-            'activeLink' => true,
+            $view = $this->viewFactory->make('user.restart-password', ['userId' => $id, 'activeLink' => false])->render();
         ])
         ->render();
killedBy: Tests\Feature\App\Http\Controllers\UserControllerTest::test_resetAccount_should_return_response
statusReason: 1) Tests\Feature\App\Http\Controllers\UserControllerTest::test_resetAccount_should_return_response
Expectation failed for method name is "make" when invoked 1 time
Parameter 1 for invocation Illuminate\View\Factory::make('user.restart-password', [...], []) does not match expected value.
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (

[Killed] PublicVisibility
app/Http/Controllers/UserController.php:79:5
         return new Response($view);
     }
 
-    public function resetPassword(ResetPasswordRequest $request): JsonResponse
+    protected function resetPassword(ResetPasswordRequest $request): JsonResponse
     {
         $dataUpdate = [
killedBy: Tests\Feature\App\Http\Controllers\UserControllerTest::test_resetPassword_should_return_json_response
statusReason: 1) Tests\Feature\App\Http\Controllers\UserControllerTest::test_resetPassword_should_return_json_response
Error: Call to protected method App\Http\Controllers\UserController::resetPassword() from scope Tests\Feature\App\Http\Controllers\UserControllerTest

/var/www/abacusSystem-new/tests/Feature/App/Http/Controllers/UserControllerTest.php:306

ERRORS!
Tests: 8, Assertions: 41, Errors: 1.

[Killed] MethodCallRemoval
app/Http/Controllers/UserController.php:86:9
             'password' => $this->makeHashPassword($request->input('password')),
         ];
 
-        $request->merge(['dataUpdate' => $dataUpdate]);
+        
         $this->orchestratorHandler->handler('update-user', $request);
         return new JsonResponse(status: ResponseFoundation::HTTP_CREATED);
killedBy: Tests\Feature\App\Http\Controllers\UserControllerTest::test_resetPassword_should_return_json_response
statusReason: 1) Tests\Feature\App\Http\Controllers\UserControllerTest::test_resetPassword_should_return_json_response
Expectation failed for method name is "merge" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.

[Killed] MethodCallRemoval
app/Http/Controllers/UserController.php:87:9
         ];
 
         $request->merge(['dataUpdate' => $dataUpdate]);
-        $this->orchestratorHandler->handler('update-user', $request);
+        
         return new JsonResponse(status: ResponseFoundation::HTTP_CREATED);
     }
killedBy: Tests\Feature\App\Http\Controllers\UserControllerTest::test_resetPassword_should_return_json_response
statusReason: 1) Tests\Feature\App\Http\Controllers\UserControllerTest::test_resetPassword_should_return_json_response
Expectation failed for method name is "handler" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Survived] ArrayItemRemoval
app/Http/Controllers/UserController.php:98:13
     {
         return [
             new Middleware(['auth', 'verify-session']),
-            new Middleware('only.ajax-request', only: ['recoveryAccout', 'resetPassword']),
+            return [new Middleware(['auth', 'verify-session']), new Middleware('only.ajax-request', only: ['resetPassword'])];
         ];
     }
