[NoCoverage] PublicVisibility
app/Http/Middleware/OnlyAjaxRequest.php:28:5
      *
      * @param  Closure(Request): (Response)  $next
      */
-    public function handle(Request $request, Closure $next): Closure|Response
+    protected function handle(Request $request, Closure $next): Closure|Response
     {
         if (! $request->ajax()) {

[NoCoverage] LogicalNot
app/Http/Middleware/OnlyAjaxRequest.php:30:9
      */
     public function handle(Request $request, Closure $next): Closure|Response
     {
-        if (! $request->ajax()) {
+        if ($request->ajax()) {
             return $this->redirector->route('index');
         }

[NoCoverage] FunctionCall
app/Http/Middleware/OnlyAjaxRequest.php:34:9
             return $this->redirector->route('index');
         }
 
-        return $next($request);
+        $next($request);
+        return null;
     }
 }
