[NoCoverage] PublicVisibility
app/Http/Middleware/VerifySession.php:33:5
      *
      * @param Closure(Request): (Response) $next
      */
-    public function handle(Request $request, Closure $next): Response
+    protected function handle(Request $request, Closure $next): Response
     {
         if (! $this->session->exists(['user', 'profile', 'employee'])) {

[NoCoverage] LogicalNot
app/Http/Middleware/VerifySession.php:35:9
      */
     public function handle(Request $request, Closure $next): Response
     {
-        if (! $this->session->exists(['user', 'profile', 'employee'])) {
+        if ($this->session->exists(['user', 'profile', 'employee'])) {
 
             if ($request->ajax()) {

[NoCoverage] IfNegation
app/Http/Middleware/VerifySession.php:37:13
     {
         if (! $this->session->exists(['user', 'profile', 'employee'])) {
 
-            if ($request->ajax()) {
-                return new JsonResponse(
-                    [
-                        'error' => 'unauthorized',
-                        'error_description' => 'Failed authentication',
-                        'reason' => 401,
-                    ],
-                    Response::HTTP_UNAUTHORIZED
-                );
-            }
+            if (!$request->ajax()) {
 
             return $this->redirector->to('/');

[NoCoverage] DecrementInteger
app/Http/Middleware/VerifySession.php:42:25
                     [
                         'error' => 'unauthorized',
                         'error_description' => 'Failed authentication',
-                        'reason' => 401,
+                        return new JsonResponse(['error' => 'unauthorized', 'error_description' => 'Failed authentication', 'reason' => 400], Response::HTTP_UNAUTHORIZED);
                     ],
                     Response::HTTP_UNAUTHORIZED

[NoCoverage] IncrementInteger
app/Http/Middleware/VerifySession.php:42:25
                     [
                         'error' => 'unauthorized',
                         'error_description' => 'Failed authentication',
-                        'reason' => 401,
+                        return new JsonResponse(['error' => 'unauthorized', 'error_description' => 'Failed authentication', 'reason' => 402], Response::HTTP_UNAUTHORIZED);
                     ],
                     Response::HTTP_UNAUTHORIZED
