[Killed] MethodCallRemoval
Orchestrators/Orchestrator/Employee/ChangeStateEmployeeOrchestrator.php:20:9
 
     public function __construct(EmployeeManagementContract $employeeManagement)
     {
-        parent::__construct($employeeManagement);
+        
     }
 
killedBy: Tests\Feature\App\Http\Orchestrators\Orchestrator\Employee\ChangeStateEmployeeOrchestratorTest::test_make_should_active_when_is_isActivated_and_return_employee
statusReason: 1) Tests\Feature\App\Http\Orchestrators\Orchestrator\Employee\ChangeStateEmployeeOrchestratorTest::test_make_should_active_when_is_isActivated_and_return_employee
Error: Typed property App\Http\Orchestrators\Orchestrator\Employee\EmployeeOrchestrator::$employeeManagement must not be accessed before initialization

/var/www/abacusSystem-new/app/Http/Orchestrators/Orchestrator/Employee/ChangeStateEm

[Killed] LogicalOrNegation
Orchestrators/Orchestrator/Employee/ChangeStateEmployeeOrchestrator.php:33:9
         $employee = $this->employeeManagement->searchEmployeeById($employeeId);
 
         $employeeState = $employee->state();
-        if ($employeeState->isNew() || $employeeState->isInactivated()) {
+        if (!($employeeState->isNew() || $employeeState->isInactivated())) {
             $employeeState->activate();
         } elseif ($employeeState->isActivated()) {
killedBy: Tests\Feature\App\Http\Orchestrators\Orchestrator\Employee\ChangeStateEmployeeOrchestratorTest::test_make_should_active_when_is_new_and_return_employee
statusReason: 1) Tests\Feature\App\Http\Orchestrators\Orchestrator\Employee\ChangeStateEmployeeOrchestratorTest::test_make_should_active_when_is_new_and_return_employee
Expectation failed for method name is "activate" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 6, Failures: 1.

[Killed] LogicalOrAllSubExprNegation
Orchestrators/Orchestrator/Employee/ChangeStateEmployeeOrchestrator.php:33:9
         $employee = $this->employeeManagement->searchEmployeeById($employeeId);
 
         $employeeState = $employee->state();
-        if ($employeeState->isNew() || $employeeState->isInactivated()) {
+        if (!$employeeState->isNew() || !$employeeState->isInactivated()) {
             $employeeState->activate();
         } elseif ($employeeState->isActivated()) {
killedBy: Tests\Feature\App\Http\Orchestrators\Orchestrator\Employee\ChangeStateEmployeeOrchestratorTest::test_make_should_active_when_is_new_and_return_employee
statusReason: 1) Tests\Feature\App\Http\Orchestrators\Orchestrator\Employee\ChangeStateEmployeeOrchestratorTest::test_make_should_active_when_is_new_and_return_employee
Core\SharedContext\Model\ValueObjectStatus::isInactivated(): bool was not expected to be called.

/var/www/abacusSystem-new/app/Http/Orchestrators/Orchestrator/Employee/ChangeStateEmployeeOrchestrator.php:29
/var/www/abacusSystem-new/tests/Featu

[Killed] MethodCallRemoval
Orchestrators/Orchestrator/Employee/ChangeStateEmployeeOrchestrator.php:34:13
 
         $employeeState = $employee->state();
         if ($employeeState->isNew() || $employeeState->isInactivated()) {
-            $employeeState->activate();
+            
         } elseif ($employeeState->isActivated()) {
             $employeeState->inactive();
killedBy: Tests\Feature\App\Http\Orchestrators\Orchestrator\Employee\ChangeStateEmployeeOrchestratorTest::test_make_should_active_when_is_new_and_return_employee
statusReason: 1) Tests\Feature\App\Http\Orchestrators\Orchestrator\Employee\ChangeStateEmployeeOrchestratorTest::test_make_should_active_when_is_new_and_return_employee
Expectation failed for method name is "activate" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 6, Failures: 1.

[Killed] ElseIfNegation
Orchestrators/Orchestrator/Employee/ChangeStateEmployeeOrchestrator.php:35:9
         $employeeState = $employee->state();
         if ($employeeState->isNew() || $employeeState->isInactivated()) {
             $employeeState->activate();
-        } elseif ($employeeState->isActivated()) {
-            $employeeState->inactive();
-        }
+        } elseif (!$employeeState->isActivated()) {
 
         $dataUpdate['state'] = $employeeState->value();
killedBy: Tests\Feature\App\Http\Orchestrators\Orchestrator\Employee\ChangeStateEmployeeOrchestratorTest::test_make_should_active_when_is_isActivated_and_return_employee
statusReason: 1) Tests\Feature\App\Http\Orchestrators\Orchestrator\Employee\ChangeStateEmployeeOrchestratorTest::test_make_should_active_when_is_isActivated_and_return_employee
Expectation failed for method name is "inactive" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 6, Failures: 1.

[Killed] MethodCallRemoval
Orchestrators/Orchestrator/Employee/ChangeStateEmployeeOrchestrator.php:36:13
         if ($employeeState->isNew() || $employeeState->isInactivated()) {
             $employeeState->activate();
         } elseif ($employeeState->isActivated()) {
-            $employeeState->inactive();
+            
         }
 
killedBy: Tests\Feature\App\Http\Orchestrators\Orchestrator\Employee\ChangeStateEmployeeOrchestratorTest::test_make_should_active_when_is_isActivated_and_return_employee
statusReason: 1) Tests\Feature\App\Http\Orchestrators\Orchestrator\Employee\ChangeStateEmployeeOrchestratorTest::test_make_should_active_when_is_isActivated_and_return_employee
Expectation failed for method name is "inactive" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 6, Failures: 1.
