[Killed] MethodCallRemoval
Orchestrators/Orchestrator/Employee/CreateEmployeeOrchestrator.php:26:9
         EmployeeManagementContract $employeeManagement,
         ImageManagerInterface $imageManager,
     ) {
-        parent::__construct($employeeManagement);
+        
         $this->setImageManager($imageManager);
     }
killedBy: Tests\Feature\App\Http\Orchestrators\Orchestrator\Employee\CreateEmployeeOrchestratorTest::test_make_should_create_and_return_employee
statusReason: 1) Tests\Feature\App\Http\Orchestrators\Orchestrator\Employee\CreateEmployeeOrchestratorTest::test_make_should_create_and_return_employee
Error: Typed property App\Http\Orchestrators\Orchestrator\Employee\EmployeeOrchestrator::$employeeManagement must not be accessed before initialization

/var/www/abacusSystem-new/app/Http/Orchestrators/Orchestrator/Employee/CreateEmployeeOrchestrator.php:37
/var

[Killed] MethodCallRemoval
Orchestrators/Orchestrator/Employee/CreateEmployeeOrchestrator.php:27:9
         ImageManagerInterface $imageManager,
     ) {
         parent::__construct($employeeManagement);
-        $this->setImageManager($imageManager);
+        
     }
 
killedBy: Tests\Feature\App\Http\Orchestrators\Orchestrator\Employee\CreateEmployeeOrchestratorTest::test_make_should_create_and_return_employee
statusReason: 1) Tests\Feature\App\Http\Orchestrators\Orchestrator\Employee\CreateEmployeeOrchestratorTest::test_make_should_create_and_return_employee
Error: Typed property App\Http\Orchestrators\Orchestrator\Employee\CreateEmployeeOrchestrator::$imageManager must not be accessed before initialization

/var/www/abacusSystem-new/app/Traits/MultimediaTrait.php:29
/var/www/abacusSystem-new/app/Http/Orchestrators/

[Killed] IfNegation
Orchestrators/Orchestrator/Employee/CreateEmployeeOrchestrator.php:54:9
             'image' => null
         ];
 
-        if ($request->filled('token')) {
-            $filename = $this->saveImage($request->input('token'));
-            $dataEmployee['image'] = $filename;
-        }
+        if (!$request->filled('token')) {
 
         return $this->employeeManagement->createEmployee([Employee::TYPE => $dataEmployee]);
killedBy: Tests\Feature\App\Http\Orchestrators\Orchestrator\Employee\CreateEmployeeOrchestratorTest::test_make_should_create_and_return_employee
statusReason: 1) Tests\Feature\App\Http\Orchestrators\Orchestrator\Employee\CreateEmployeeOrchestratorTest::test_make_should_create_and_return_employee
Expectation failed for method name is "read" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.
