[Killed] MethodCallRemoval
Orchestrators/Orchestrator/Employee/DeleteEmployeeOrchestrator.php:23:9
      */
     public function make(Request $request): bool
     {
-        $this->employeeManagement->deleteEmployee($request->input('employeeId'));
+        
         return true;
     }
killedBy: Tests\Feature\App\Http\Orchestrators\Orchestrator\Employee\DeleteEmployeeOrchestratorTest::test_make_should_create_and_return_true
statusReason: 1) Tests\Feature\App\Http\Orchestrators\Orchestrator\Employee\DeleteEmployeeOrchestratorTest::test_make_should_create_and_return_true
Expectation failed for method name is "deleteEmployee" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] TrueValue
Orchestrators/Orchestrator/Employee/DeleteEmployeeOrchestrator.php:24:9
     public function make(Request $request): bool
     {
         $this->employeeManagement->deleteEmployee($request->input('employeeId'));
-        return true;
+        return false;
     }
 
killedBy: Tests\Feature\App\Http\Orchestrators\Orchestrator\Employee\DeleteEmployeeOrchestratorTest::test_make_should_create_and_return_true
statusReason: 1) Tests\Feature\App\Http\Orchestrators\Orchestrator\Employee\DeleteEmployeeOrchestratorTest::test_make_should_create_and_return_true
Failed asserting that false is true.

/var/www/abacusSystem-new/tests/Feature/App/Http/Orchestrators/Orchestrator/Employee/DeleteEmployeeOrchestratorTest.php:50

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
