[Killed] LogicalNot
Orchestrators/Orchestrator/Employee/DetailEmployeeOrchestrator.php:41:9
         $employee = null;
         $employeeId = $request->input('employeeId');
 
-        if (! is_null($employeeId)) {
+        if (is_null($employeeId)) {
             $employee = $this->employeeManagement->searchEmployeeById($employeeId);
             $user = $this->userManagement->searchUserById($employee->userId()->value());
killedBy: Tests\Feature\App\Http\Orchestrators\Orchestrator\Employee\DetailEmployeeOrchestratorTest::test_make_should_return_array_with_employee
statusReason: 1) Tests\Feature\App\Http\Orchestrators\Orchestrator\Employee\DetailEmployeeOrchestratorTest::test_make_should_return_array_with_employee
Failed asserting that null is identical to 1.

/var/www/abacusSystem-new/tests/Feature/App/Http/Orchestrators/Orchestrator/Employee/DetailEmployeeOrchestratorTest.php:93

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] ConcatOperandRemoval
Orchestrators/Orchestrator/Employee/DetailEmployeeOrchestrator.php:45:13
             $employee = $this->employeeManagement->searchEmployeeById($employeeId);
             $user = $this->userManagement->searchUserById($employee->userId()->value());
 
-            $urlFile = url(self::IMAGE_PATH_FULL.$employee->image()->value()).'?v='.Str::random(10);
+            $urlFile = url($employee->image()->value()) . '?v=' . Str::random(10);
         }
 
killedBy: Tests\Feature\App\Http\Orchestrators\Orchestrator\Employee\DetailEmployeeOrchestratorTest::test_make_should_return_array_with_employee
statusReason: 1) Tests\Feature\App\Http\Orchestrators\Orchestrator\Employee\DetailEmployeeOrchestratorTest::test_make_should_return_array_with_employee
Error: Object of class Illuminate\Routing\UrlGenerator could not be converted to string

/var/www/abacusSystem-new/app/Http/Orchestrators/Orchestrator/Employee/DetailEmployeeOrchestrator.php:36
/var/www/abacusSystem-new/tests/Feature/App/Http/Orchestrators/Orche

[Survived] IncrementInteger
Orchestrators/Orchestrator/Employee/DetailEmployeeOrchestrator.php:45:13
             $employee = $this->employeeManagement->searchEmployeeById($employeeId);
             $user = $this->userManagement->searchUserById($employee->userId()->value());
 
-            $urlFile = url(self::IMAGE_PATH_FULL.$employee->image()->value()).'?v='.Str::random(10);
+            $urlFile = url(self::IMAGE_PATH_FULL . $employee->image()->value()) . '?v=' . Str::random(11);
         }
 

[Killed] Ternary
Orchestrators/Orchestrator/Employee/DetailEmployeeOrchestrator.php:49:9
         }
 
         $profiles = $this->profileManagement->searchProfiles();
-        $userId = (! is_null($employee)) ? $employee->userId()->value() : null;
+        $userId = (!is_null($employee)) ? null : $employee->userId()->value();
 
         return [
killedBy: Tests\Feature\App\Http\Orchestrators\Orchestrator\Employee\DetailEmployeeOrchestratorTest::test_make_should_return_array_with_employee
statusReason: 1) Tests\Feature\App\Http\Orchestrators\Orchestrator\Employee\DetailEmployeeOrchestratorTest::test_make_should_return_array_with_employee
Failed asserting that null is identical to 1.

/var/www/abacusSystem-new/tests/Feature/App/Http/Orchestrators/Orchestrator/Employee/DetailEmployeeOrchestratorTest.php:93

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] LogicalNot
Orchestrators/Orchestrator/Employee/DetailEmployeeOrchestrator.php:49:9
         }
 
         $profiles = $this->profileManagement->searchProfiles();
-        $userId = (! is_null($employee)) ? $employee->userId()->value() : null;
+        $userId = is_null($employee) ? $employee->userId()->value() : null;
 
         return [
killedBy: Tests\Feature\App\Http\Orchestrators\Orchestrator\Employee\DetailEmployeeOrchestratorTest::test_make_should_return_array_with_employee
statusReason: 1) Tests\Feature\App\Http\Orchestrators\Orchestrator\Employee\DetailEmployeeOrchestratorTest::test_make_should_return_array_with_employee
Failed asserting that null is identical to 1.

/var/www/abacusSystem-new/tests/Feature/App/Http/Orchestrators/Orchestrator/Employee/DetailEmployeeOrchestratorTest.php:93

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] ArrayItemRemoval
Orchestrators/Orchestrator/Employee/DetailEmployeeOrchestrator.php:51:9
         $profiles = $this->profileManagement->searchProfiles();
         $userId = (! is_null($employee)) ? $employee->userId()->value() : null;
 
-        return [
-            'userId' => $userId,
-            'employeeId' => $employeeId,
-            'employee' => $employee,
-            'user' => $user ?? null,
-            'profiles' => $profiles,
-            'image' => $urlFile ?? null,
-        ];
+        return ['employeeId' => $employeeId, 'employee' => $employee, 'user' => $user ?? null, 'profiles' => $profiles, 'image' => $urlFile ?? null];
     }
 
killedBy: Tests\Feature\App\Http\Orchestrators\Orchestrator\Employee\DetailEmployeeOrchestratorTest::test_make_should_return_array_with_null
statusReason: 1) Tests\Feature\App\Http\Orchestrators\Orchestrator\Employee\DetailEmployeeOrchestratorTest::test_make_should_return_array_with_null
ErrorException: Undefined array key "userId"

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Foundation/Bootstrap/HandleExceptions.php:256
/var/www/abacusSystem-new/tests/Feature/App/Http/Orchestrators/Orchestrator/Employee/DetailEmployeeOrchestra
