[Killed] IfNegation
Orchestrators/Orchestrator/Employee/GetEmployeeOrchestrator.php:26:9
      */
     public function make(Request $request): ?Employee
     {
-        if ($request->filled('identification')) {
-            return $this->employeeManagement->searchEmployeeByIdentification($request->input('identification'));
-        }
+        if (!$request->filled('identification')) {
 
         $employeeId = $request->input('employeeId');
killedBy: Tests\Feature\App\Http\Orchestrators\Orchestrator\Employee\GetEmployeeOrchestratorTest::test_make_should_return_employee_with_identification
statusReason: 1) Tests\Feature\App\Http\Orchestrators\Orchestrator\Employee\GetEmployeeOrchestratorTest::test_make_should_return_employee_with_identification
Expectation failed for method name is "input" when invoked 1 time
Parameter 0 for invocation Illuminate\Http\Request::input('employeeId', null) does not match expected value.
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'iden
