[Killed] MethodCallRemoval
Orchestrators/Orchestrator/Employee/GetEmployeesOrchestrator.php:35:9
         ViewFactory $viewFactory,
     ) {
         parent::__construct($employeeManagement);
-        $this->setViewFactory($viewFactory);
+        
 
         $this->employeeDataTransformer = $employeeDataTransformer;
killedBy: Tests\Feature\App\Http\Orchestrators\Orchestrator\Employee\GetEmployeesOrchestratorTest::test_make_should_return_json_response
statusReason: 1) Tests\Feature\App\Http\Orchestrators\Orchestrator\Employee\GetEmployeesOrchestratorTest::test_make_should_return_json_response
Error: Typed property App\Http\Orchestrators\Orchestrator\Employee\GetEmployeesOrchestrator::$viewFactory must not be accessed before initialization

/var/www/abacusSystem-new/app/Traits/DataTablesTrait.php:22
/var/www/abacusSystem-new/app/Http/Orchestrators/Orchestrato

[Killed] IfNegation
Orchestrators/Orchestrator/Employee/GetEmployeesOrchestrator.php:53:9
         );
 
         $dataEmployees = [];
-        if ($employees->count()) {
-            /** @var Employee $item */
-            foreach ($employees as $item) {
-                $dataEmployees[] = $this->employeeDataTransformer->write($item)->readToShare();
-            }
-        }
+        if (!$employees->count()) {
 
         $collection = new Collection($dataEmployees);
killedBy: Tests\Feature\App\Http\Orchestrators\Orchestrator\Employee\GetEmployeesOrchestratorTest::test_make_should_return_json_response
statusReason: 1) Tests\Feature\App\Http\Orchestrators\Orchestrator\Employee\GetEmployeesOrchestratorTest::test_make_should_return_json_response
Expectation failed for method name is "collection" when invoked 1 time
Parameter 0 for invocation Yajra\DataTables\DataTables::collection(Illuminate\Support\Collection Object (...)): Yajra\DataTables\CollectionDataTable does not match expected value.
Failed asserting th

[Killed] Foreach_
Orchestrators/Orchestrator/Employee/GetEmployeesOrchestrator.php:55:13
         $dataEmployees = [];
         if ($employees->count()) {
             /** @var Employee $item */
-            foreach ($employees as $item) {
-                $dataEmployees[] = $this->employeeDataTransformer->write($item)->readToShare();
-            }
+            foreach ([] as $item) {
         }
 
killedBy: Tests\Feature\App\Http\Orchestrators\Orchestrator\Employee\GetEmployeesOrchestratorTest::test_make_should_return_json_response
statusReason: 1) Tests\Feature\App\Http\Orchestrators\Orchestrator\Employee\GetEmployeesOrchestratorTest::test_make_should_return_json_response
Expectation failed for method name is "collection" when invoked 1 time
Parameter 0 for invocation Yajra\DataTables\DataTables::collection(Illuminate\Support\Collection Object (...)): Yajra\DataTables\CollectionDataTable does not match expected value.
Failed asserting th

[Killed] MethodCallRemoval
Orchestrators/Orchestrator/Employee/GetEmployeesOrchestrator.php:62:9
 
         $collection = new Collection($dataEmployees);
         $datatable = $this->dataTables->collection($collection);
-        $datatable->addColumn('tools', function (array $element): string {
-            return $this->retrieveMenuOptionHtml($element);
-        });
+        
 
         return $datatable->escapeColumns([])->toJson();
killedBy: Tests\Feature\App\Http\Orchestrators\Orchestrator\Employee\GetEmployeesOrchestratorTest::test_make_should_return_json_response
statusReason: 1) Tests\Feature\App\Http\Orchestrators\Orchestrator\Employee\GetEmployeesOrchestratorTest::test_make_should_return_json_response
Expectation failed for method name is "addColumn" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 7, Failures: 1.
