[Killed] MethodCallRemoval
Orchestrators/Orchestrator/Institution/ChangeStateInstitutionOrchestrator.php:21:9
     public function __construct(
         InstitutionManagementContract $institutionManagement
     ) {
-        parent::__construct($institutionManagement);
+        
     }
 
killedBy: Tests\Feature\App\Http\Orchestrators\Orchestrator\Institution\ChangeStateInstitutionOrchestratorTest::test_make_should_return_institution_when_is_inactivate
statusReason: 1) Tests\Feature\App\Http\Orchestrators\Orchestrator\Institution\ChangeStateInstitutionOrchestratorTest::test_make_should_return_institution_when_is_inactivate
Error: Typed property App\Http\Orchestrators\Orchestrator\Institution\InstitutionOrchestrator::$institutionManagement must not be accessed before initialization

/var/www/abacusSystem-new/app/Http/Orchestrators/Orchestrator/Institution/Chan

[Killed] LogicalOrNegation
Orchestrators/Orchestrator/Institution/ChangeStateInstitutionOrchestrator.php:36:9
         $institution = $this->institutionManagement->searchInstitutionById($institutionId);
 
         $institutionState = $institution->state();
-        if ($institutionState->isNew() || $institutionState->isInactivated()) {
+        if (!($institutionState->isNew() || $institutionState->isInactivated())) {
             $institutionState->activate();
         } elseif ($institutionState->isActivated()) {
killedBy: Tests\Feature\App\Http\Orchestrators\Orchestrator\Institution\ChangeStateInstitutionOrchestratorTest::test_make_should_return_institution_when_is_activate
statusReason: 1) Tests\Feature\App\Http\Orchestrators\Orchestrator\Institution\ChangeStateInstitutionOrchestratorTest::test_make_should_return_institution_when_is_activate
Expectation failed for method name is "activate" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 6, Failures: 1.

[Killed] LogicalOrSingleSubExprNegation
Orchestrators/Orchestrator/Institution/ChangeStateInstitutionOrchestrator.php:36:9
         $institution = $this->institutionManagement->searchInstitutionById($institutionId);
 
         $institutionState = $institution->state();
-        if ($institutionState->isNew() || $institutionState->isInactivated()) {
+        if ($institutionState->isNew() || !$institutionState->isInactivated()) {
             $institutionState->activate();
         } elseif ($institutionState->isActivated()) {
killedBy: Tests\Feature\App\Http\Orchestrators\Orchestrator\Institution\ChangeStateInstitutionOrchestratorTest::test_make_should_return_institution_when_is_inactivate
statusReason: 1) Tests\Feature\App\Http\Orchestrators\Orchestrator\Institution\ChangeStateInstitutionOrchestratorTest::test_make_should_return_institution_when_is_inactivate
Core\SharedContext\Model\ValueObjectStatus::activate(): Core\SharedContext\Model\ValueObjectStatus was not expected to be called.

/var/www/abacusSystem-new/app/Http/Orchestrators/Orchestrator/Institution/ChangeStateInstitutionOrchestrator.

[Killed] MethodCallRemoval
Orchestrators/Orchestrator/Institution/ChangeStateInstitutionOrchestrator.php:37:13
 
         $institutionState = $institution->state();
         if ($institutionState->isNew() || $institutionState->isInactivated()) {
-            $institutionState->activate();
+            
         } elseif ($institutionState->isActivated()) {
             $institutionState->inactive();
killedBy: Tests\Feature\App\Http\Orchestrators\Orchestrator\Institution\ChangeStateInstitutionOrchestratorTest::test_make_should_return_institution_when_is_activate
statusReason: 1) Tests\Feature\App\Http\Orchestrators\Orchestrator\Institution\ChangeStateInstitutionOrchestratorTest::test_make_should_return_institution_when_is_activate
Expectation failed for method name is "activate" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 6, Failures: 1.

[Killed] ElseIfNegation
Orchestrators/Orchestrator/Institution/ChangeStateInstitutionOrchestrator.php:38:9
         $institutionState = $institution->state();
         if ($institutionState->isNew() || $institutionState->isInactivated()) {
             $institutionState->activate();
-        } elseif ($institutionState->isActivated()) {
-            $institutionState->inactive();
-        }
+        } elseif (!$institutionState->isActivated()) {
 
         $dataUpdate['state'] = $institutionState->value();
killedBy: Tests\Feature\App\Http\Orchestrators\Orchestrator\Institution\ChangeStateInstitutionOrchestratorTest::test_make_should_return_institution_when_is_inactivate
statusReason: 1) Tests\Feature\App\Http\Orchestrators\Orchestrator\Institution\ChangeStateInstitutionOrchestratorTest::test_make_should_return_institution_when_is_inactivate
Expectation failed for method name is "inactive" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 6, Failures: 1.

[Killed] MethodCallRemoval
Orchestrators/Orchestrator/Institution/ChangeStateInstitutionOrchestrator.php:39:13
         if ($institutionState->isNew() || $institutionState->isInactivated()) {
             $institutionState->activate();
         } elseif ($institutionState->isActivated()) {
-            $institutionState->inactive();
+            
         }
 
killedBy: Tests\Feature\App\Http\Orchestrators\Orchestrator\Institution\ChangeStateInstitutionOrchestratorTest::test_make_should_return_institution_when_is_inactivate
statusReason: 1) Tests\Feature\App\Http\Orchestrators\Orchestrator\Institution\ChangeStateInstitutionOrchestratorTest::test_make_should_return_institution_when_is_inactivate
Expectation failed for method name is "inactive" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 6, Failures: 1.
