[Killed] MethodCallRemoval
Orchestrators/Orchestrator/Institution/CreateInstitutionOrchestrator.php:27:9
         ImageManagerInterface $imageManager
     ) {
         parent::__construct($institutionManagement);
-        $this->setImageManager($imageManager);
+        
     }
 
killedBy: Tests\Feature\App\Http\Orchestrators\Orchestrator\Institution\CreateInstitutionOrchestratorTest::test_make_should_return_institution
statusReason: 1) Tests\Feature\App\Http\Orchestrators\Orchestrator\Institution\CreateInstitutionOrchestratorTest::test_make_should_return_institution
Error: Typed property App\Http\Orchestrators\Orchestrator\Institution\CreateInstitutionOrchestrator::$imageManager must not be accessed before initialization

/var/www/abacusSystem-new/app/Traits/MultimediaTrait.php:29
/var/www/abacusSystem-new/app/Http/Orchestrat

[Killed] IfNegation
Orchestrators/Orchestrator/Institution/CreateInstitutionOrchestrator.php:46:9
             'state' => ValueObjectStatus::STATE_NEW
         ];
 
-        if ($request->filled('token')) {
-            $filename = $this->saveImage($request->input('token'));
-            $dataInstitution['logo'] = $filename;
-        }
+        if (!$request->filled('token')) {
 
         return $this->institutionManagement->createInstitution([Institution::TYPE => $dataInstitution]);
killedBy: Tests\Feature\App\Http\Orchestrators\Orchestrator\Institution\CreateInstitutionOrchestratorTest::test_make_should_return_institution
statusReason: 1) Tests\Feature\App\Http\Orchestrators\Orchestrator\Institution\CreateInstitutionOrchestratorTest::test_make_should_return_institution
Expectation failed for method name is "read" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Survived] ArrayItemRemoval
Orchestrators/Orchestrator/Institution/CreateInstitutionOrchestrator.php:51:9
             $dataInstitution['logo'] = $filename;
         }
 
-        return $this->institutionManagement->createInstitution([Institution::TYPE => $dataInstitution]);
+        return $this->institutionManagement->createInstitution([]);
     }
 
