[Killed] LogicalNot
Orchestrators/Orchestrator/Institution/DetailInstitutionOrchestrator.php:31:9
     public function make(Request $request): array
     {
         $institutionId = $request->input('institutionId');
-        if (! is_null($institutionId)) {
+        if (is_null($institutionId)) {
 
             /** @var Institution $institution */
killedBy: Tests\Feature\App\Http\Orchestrators\Orchestrator\Institution\DetailInstitutionOrchestratorTest::test_make_should_return_array_with_institution
statusReason: 1) Tests\Feature\App\Http\Orchestrators\Orchestrator\Institution\DetailInstitutionOrchestratorTest::test_make_should_return_array_with_institution
Failed asserting that null is identical to an object of class "MockObject_Institution_819e073e".

/var/www/abacusSystem-new/tests/Feature/App/Http/Orchestrators/Orchestrator/Institution/DetailInstitutionOrchestratorTest.php:70

FAILURES!
Tests: 1, Asser

[Killed] ConcatOperandRemoval
Orchestrators/Orchestrator/Institution/DetailInstitutionOrchestrator.php:36:13
             /** @var Institution $institution */
             $institution = $this->institutionManagement->searchInstitutionById($institutionId);
 
-            $urlFile = url(self::IMAGE_PATH_FULL.$institution->logo()->value().'?v='.Str::random(10));
+            $urlFile = url(self::IMAGE_PATH_FULL . '?v=' . Str::random(10));
         }
 
killedBy: Tests\Feature\App\Http\Orchestrators\Orchestrator\Institution\DetailInstitutionOrchestratorTest::test_make_should_return_array_with_institution
statusReason: 1) Tests\Feature\App\Http\Orchestrators\Orchestrator\Institution\DetailInstitutionOrchestratorTest::test_make_should_return_array_with_institution
Expectation failed for method name is "logo" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 7, Failures: 1.

[Survived] Concat
Orchestrators/Orchestrator/Institution/DetailInstitutionOrchestrator.php:36:13
             /** @var Institution $institution */
             $institution = $this->institutionManagement->searchInstitutionById($institutionId);
 
-            $urlFile = url(self::IMAGE_PATH_FULL.$institution->logo()->value().'?v='.Str::random(10));
+            $urlFile = url($institution->logo()->value() . self::IMAGE_PATH_FULL . '?v=' . Str::random(10));
         }
 

[Killed] ArrayItemRemoval
Orchestrators/Orchestrator/Institution/DetailInstitutionOrchestrator.php:39:9
             $urlFile = url(self::IMAGE_PATH_FULL.$institution->logo()->value().'?v='.Str::random(10));
         }
 
-        return [
-            'institutionId' => $institutionId,
-            'institution' => $institution ?? null,
-            'image' => $urlFile ?? null
-        ];
+        return ['institution' => $institution ?? null, 'image' => $urlFile ?? null];
     }
 
killedBy: Tests\Feature\App\Http\Orchestrators\Orchestrator\Institution\DetailInstitutionOrchestratorTest::test_make_should_return_array_without_institution
statusReason: 1) Tests\Feature\App\Http\Orchestrators\Orchestrator\Institution\DetailInstitutionOrchestratorTest::test_make_should_return_array_without_institution
ErrorException: Undefined array key "institutionId"

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Foundation/Bootstrap/HandleExceptions.php:256
/var/www/abacusSystem-new/tests/Feature/App/Http/Orchestrators/Orchestrator/Instituti
