[Killed] MethodCallRemoval
Orchestrators/Orchestrator/Institution/GetInstitutionsOrchestrator.php:35:9
         ViewFactory $viewFactory
     ) {
         parent::__construct($institutionManagement);
-        $this->setViewFactory($viewFactory);
+        
 
         $this->institutionDataTransformer = $institutionDataTransformer;
killedBy: Tests\Feature\App\Http\Orchestrators\Orchestrator\Institution\GetInstitutionsOrchestratorTest::test_make_should_return_json_response
statusReason: 1) Tests\Feature\App\Http\Orchestrators\Orchestrator\Institution\GetInstitutionsOrchestratorTest::test_make_should_return_json_response
Error: Typed property App\Http\Orchestrators\Orchestrator\Institution\GetInstitutionsOrchestrator::$viewFactory must not be accessed before initialization

/var/www/abacusSystem-new/app/Traits/DataTablesTrait.php:22
/var/www/abacusSystem-new/app/Http/Orchestrators

[Killed] IfNegation
Orchestrators/Orchestrator/Institution/GetInstitutionsOrchestrator.php:53:9
         );
 
         $dataInstitutions = [];
-        if ($institutions->count()) {
-            /** @var Institution $item */
-            foreach ($institutions as $item) {
-                $dataInstitutions[] = $this->institutionDataTransformer->write($item)->readToShare();
-            }
-        }
+        if (!$institutions->count()) {
 
         $collection = new Collection($dataInstitutions);
killedBy: Tests\Feature\App\Http\Orchestrators\Orchestrator\Institution\GetInstitutionsOrchestratorTest::test_make_should_return_json_response
statusReason: 1) Tests\Feature\App\Http\Orchestrators\Orchestrator\Institution\GetInstitutionsOrchestratorTest::test_make_should_return_json_response
Expectation failed for method name is "collection" when invoked 1 time
Parameter 0 for invocation Yajra\DataTables\DataTables::collection(Illuminate\Support\Collection Object (...)): Yajra\DataTables\CollectionDataTable does not match expected value.
Failed assert

[Killed] Foreach_
Orchestrators/Orchestrator/Institution/GetInstitutionsOrchestrator.php:55:13
         $dataInstitutions = [];
         if ($institutions->count()) {
             /** @var Institution $item */
-            foreach ($institutions as $item) {
-                $dataInstitutions[] = $this->institutionDataTransformer->write($item)->readToShare();
-            }
+            foreach ([] as $item) {
         }
 
killedBy: Tests\Feature\App\Http\Orchestrators\Orchestrator\Institution\GetInstitutionsOrchestratorTest::test_make_should_return_json_response
statusReason: 1) Tests\Feature\App\Http\Orchestrators\Orchestrator\Institution\GetInstitutionsOrchestratorTest::test_make_should_return_json_response
Expectation failed for method name is "collection" when invoked 1 time
Parameter 0 for invocation Yajra\DataTables\DataTables::collection(Illuminate\Support\Collection Object (...)): Yajra\DataTables\CollectionDataTable does not match expected value.
Failed assert

[Killed] MethodCallRemoval
Orchestrators/Orchestrator/Institution/GetInstitutionsOrchestrator.php:62:9
 
         $collection = new Collection($dataInstitutions);
         $datatable = $this->dataTables->collection($collection);
-        $datatable->addColumn('tools', function (array $element) {
-            return $this->retrieveMenuOptionHtml($element);
-        });
+        
 
         return $datatable->escapeColumns([])->toJson();
killedBy: Tests\Feature\App\Http\Orchestrators\Orchestrator\Institution\GetInstitutionsOrchestratorTest::test_make_should_return_json_response
statusReason: 1) Tests\Feature\App\Http\Orchestrators\Orchestrator\Institution\GetInstitutionsOrchestratorTest::test_make_should_return_json_response
Expectation failed for method name is "addColumn" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 7, Failures: 1.
