[NoCoverage] MethodCallRemoval
Orchestrators/Orchestrator/Module/ChangeStateModuleOrchestrator.php:21:9
     public function __construct(
         ModuleManagementContract $moduleManagement
     ) {
-        parent::__construct($moduleManagement);
+        
     }
 

[NoCoverage] LogicalOrNegation
Orchestrators/Orchestrator/Module/ChangeStateModuleOrchestrator.php:36:9
         $module = $this->moduleManagement->searchModuleById($moduleId);
 
         $state = $module->state();
-        if ($state->isNew() || $state->isInactivated()) {
+        if (!($state->isNew() || $state->isInactivated())) {
             $state->activate();
         } elseif ($state->isActivated()) {

[NoCoverage] LogicalOr
Orchestrators/Orchestrator/Module/ChangeStateModuleOrchestrator.php:36:9
         $module = $this->moduleManagement->searchModuleById($moduleId);
 
         $state = $module->state();
-        if ($state->isNew() || $state->isInactivated()) {
+        if ($state->isNew() && $state->isInactivated()) {
             $state->activate();
         } elseif ($state->isActivated()) {

[NoCoverage] MethodCallRemoval
Orchestrators/Orchestrator/Module/ChangeStateModuleOrchestrator.php:37:13
 
         $state = $module->state();
         if ($state->isNew() || $state->isInactivated()) {
-            $state->activate();
+            
         } elseif ($state->isActivated()) {
             $state->inactive();

[NoCoverage] ElseIfNegation
Orchestrators/Orchestrator/Module/ChangeStateModuleOrchestrator.php:38:9
         $state = $module->state();
         if ($state->isNew() || $state->isInactivated()) {
             $state->activate();
-        } elseif ($state->isActivated()) {
-            $state->inactive();
-        }
+        } elseif (!$state->isActivated()) {
 
         $dataUpdate['state'] = $state->value();

[NoCoverage] MethodCallRemoval
Orchestrators/Orchestrator/Module/ChangeStateModuleOrchestrator.php:39:13
         if ($state->isNew() || $state->isInactivated()) {
             $state->activate();
         } elseif ($state->isActivated()) {
-            $state->inactive();
+            
         }
 
