[NoCoverage] MethodCallRemoval
Orchestrators/Orchestrator/Module/DeleteModuleOrchestrator.php:26:9
      */
     public function make(Request $request): bool
     {
-        $this->moduleManagement->deleteModule($request->input('moduleId'));
+        
 
         return true;
