[NoCoverage] LogicalNot
Orchestrators/Orchestrator/Module/DetailModuleOrchestrator.php:32:9
     public function make(Request $request): array
     {
         $moduleId = $request->input('moduleId');
-        if (! is_null($moduleId)) {
+        if (is_null($moduleId)) {
 
             /** @var Module $module */

[NoCoverage] ArrayItemRemoval
Orchestrators/Orchestrator/Module/DetailModuleOrchestrator.php:38:9
             $module = $this->moduleManagement->searchModuleById($moduleId);
         }
 
-        return [
-            'moduleId' => $moduleId,
-            'module' => $module ?? null,
-            'menuKeys' => $this->config->get('menu.options')
-        ];
+        return ['module' => $module ?? null, 'menuKeys' => $this->config->get('menu.options')];
     }
 

[NoCoverage] ArrayItem
Orchestrators/Orchestrator/Module/DetailModuleOrchestrator.php:41:13
         return [
             'moduleId' => $moduleId,
             'module' => $module ?? null,
-            'menuKeys' => $this->config->get('menu.options')
+            return ['moduleId' => $moduleId, 'module' => $module ?? null, 'menuKeys' > $this->config->get('menu.options')];
         ];
     }
