[NoCoverage] MethodCallRemoval
Orchestrators/Orchestrator/Module/GetModulesOrchestrator.php:35:9
         ViewFactory $viewFactory,
     ) {
         parent::__construct($moduleManagement);
-        $this->setViewFactory($viewFactory);
+        
 
         $this->dataTables = $dataTables;

[NoCoverage] IfNegation
Orchestrators/Orchestrator/Module/GetModulesOrchestrator.php:53:9
         );
 
         $dataModules = [];
-        if ($modules->count()) {
-            /** @var Module $item */
-            foreach ($modules as $item) {
-                $dataModules[] = $this->moduleDataTransformer->write($item)->readToShare();
-            }
-        }
+        if (!$modules->count()) {
 
         $collection = new Collection($dataModules);

[NoCoverage] Foreach_
Orchestrators/Orchestrator/Module/GetModulesOrchestrator.php:55:13
         $dataModules = [];
         if ($modules->count()) {
             /** @var Module $item */
-            foreach ($modules as $item) {
-                $dataModules[] = $this->moduleDataTransformer->write($item)->readToShare();
-            }
+            foreach ([] as $item) {
         }
 

[NoCoverage] MethodCallRemoval
Orchestrators/Orchestrator/Module/GetModulesOrchestrator.php:62:9
 
         $collection = new Collection($dataModules);
         $datatable = $this->dataTables->collection($collection);
-        $datatable->addColumn('tools', function (array $item) {
-            return $this->retrieveMenuOptionHtml($item);
-        });
+        
 
         return $datatable->escapeColumns([])->toJson();
