[NoCoverage] MethodCallRemoval
Orchestrators/Orchestrator/Profile/ChangeStateProfileOrchestrator.php:21:9
     public function __construct(
         ProfileManagementContract $profileManagement
     ) {
-        parent::__construct($profileManagement);
+        
     }
 

[NoCoverage] LogicalOrNegation
Orchestrators/Orchestrator/Profile/ChangeStateProfileOrchestrator.php:34:9
         $profile = $this->profileManagement->searchProfileById($profileId);
 
         $state = $profile->state();
-        if ($state->isNew() || $state->isInactivated()) {
+        if (!($state->isNew() || $state->isInactivated())) {
             $state->activate();
         } elseif ($state->isActivated()) {

[NoCoverage] LogicalOrSingleSubExprNegation
Orchestrators/Orchestrator/Profile/ChangeStateProfileOrchestrator.php:34:9
         $profile = $this->profileManagement->searchProfileById($profileId);
 
         $state = $profile->state();
-        if ($state->isNew() || $state->isInactivated()) {
+        if (!$state->isNew() || $state->isInactivated()) {
             $state->activate();
         } elseif ($state->isActivated()) {
