[NoCoverage] MethodCallRemoval
Orchestrators/Orchestrator/Profile/DeleteProfileOrchestrator.php:26:9
      */
     public function make(Request $request): bool
     {
-        $this->profileManagement->deleteProfile($request->input('profileId'));
+        
 
         return true;
