[NoCoverage] MethodCallRemoval
Orchestrators/Orchestrator/Profile/GetProfileOrchestrator.php:17:9
 {
     public function __construct(ProfileManagementContract $profileManagement)
     {
-        parent::__construct($profileManagement);
+        
     }
 
