[NoCoverage] MethodCallRemoval
Orchestrators/Orchestrator/Profile/GetProfilesOrchestrator.php:35:9
         ProfileDataTransformerContract $dataTransformer
     ) {
         parent::__construct($profileManagement);
-        $this->setViewFactory($viewFactory);
+        
 
         $this->dataTables = $dataTables;

[NoCoverage] IfNegation
Orchestrators/Orchestrator/Profile/GetProfilesOrchestrator.php:52:9
         $profiles = $this->profileManagement->searchProfiles($filters);
 
         $dataProfiles = [];
-        if ($profiles->count()) {
-            /** @var Profile $item */
-            foreach ($profiles as $item) {
-                $dataProfiles[] = $this->profileDataTransformer->write($item)->readToShare();
-            }
-        }
+        if (!$profiles->count()) {
 
         $collection = new Collection($dataProfiles);

[NoCoverage] Foreach_
Orchestrators/Orchestrator/Profile/GetProfilesOrchestrator.php:54:13
         $dataProfiles = [];
         if ($profiles->count()) {
             /** @var Profile $item */
-            foreach ($profiles as $item) {
-                $dataProfiles[] = $this->profileDataTransformer->write($item)->readToShare();
-            }
+            foreach ([] as $item) {
         }
 
