[NoCoverage] MethodCallRemoval
Orchestrators/Orchestrator/User/ChangeStateUserOrchestrator.php:18:9
 {
     public function __construct(UserManagementContract $userManagement)
     {
-        parent::__construct($userManagement);
+        
     }
 

[NoCoverage] MethodCallRemoval
Orchestrators/Orchestrator/User/ChangeStateUserOrchestrator.php:31:9
 
         $user = $this->userManagement->searchUserById($userId);
 
-        $user->state()->setValue($state);
+        
         $dataUpdate['state'] = $state;
 

[NoCoverage] MethodCallRemoval
Orchestrators/Orchestrator/User/ChangeStateUserOrchestrator.php:34:9
         $user->state()->setValue($state);
         $dataUpdate['state'] = $state;
 
-        $this->userManagement->updateUser($user->id()->value(), $dataUpdate);
+        
 
         return $user;
