[NoCoverage] MethodCallRemoval
Orchestrators/Orchestrator/User/CreateUserOrchestrator.php:26:9
         UserManagementContract $userManagement,
         Hasher $hasher
     ) {
-        parent::__construct($userManagement);
+        
         $this->setHasher($hasher);
     }

[NoCoverage] MethodCallRemoval
Orchestrators/Orchestrator/User/CreateUserOrchestrator.php:27:9
         Hasher $hasher
     ) {
         parent::__construct($userManagement);
-        $this->setHasher($hasher);
+        
     }
 
