[NoCoverage] MethodCallRemoval
Orchestrators/Orchestrator/User/DeleteUserOrchestrator.php:25:9
      */
     public function make(Request $request): bool
     {
-        $this->userManagement->deleteUser($request->input('userId'));
+        
         return true;
     }

[NoCoverage] TrueValue
Orchestrators/Orchestrator/User/DeleteUserOrchestrator.php:26:9
     public function make(Request $request): bool
     {
         $this->userManagement->deleteUser($request->input('userId'));
-        return true;
+        return false;
     }
 
