[Killed] ConcatOperandRemoval
app/Http/Orchestrators/OrchestratorHandler.php:34:13
     public function addOrchestrator(Orchestrator $orchestrator): OrchestratorHandlerContract
     {
         if (isset($this->orchestrators[$orchestrator->canOrchestrate()])) {
-            throw new DuplicateOrchestratorException($orchestrator->canOrchestrate().' orchestrate duplicate');
+            throw new DuplicateOrchestratorException(' orchestrate duplicate');
         }
 
killedBy: Tests\Feature\App\Http\Orchestrators\OrchestratorHandlerTest::test_addOrchestrator_should_return_exception
statusReason: 1) Tests\Feature\App\Http\Orchestrators\OrchestratorHandlerTest::test_addOrchestrator_should_return_exception
Failed asserting that exception message ' orchestrate duplicate' contains 'testing orchestrate duplicate'.

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] Concat
app/Http/Orchestrators/OrchestratorHandler.php:34:13
     public function addOrchestrator(Orchestrator $orchestrator): OrchestratorHandlerContract
     {
         if (isset($this->orchestrators[$orchestrator->canOrchestrate()])) {
-            throw new DuplicateOrchestratorException($orchestrator->canOrchestrate().' orchestrate duplicate');
+            throw new DuplicateOrchestratorException(' orchestrate duplicate' . $orchestrator->canOrchestrate());
         }
 
killedBy: Tests\Feature\App\Http\Orchestrators\OrchestratorHandlerTest::test_addOrchestrator_should_return_exception
statusReason: 1) Tests\Feature\App\Http\Orchestrators\OrchestratorHandlerTest::test_addOrchestrator_should_return_exception
Failed asserting that exception message ' orchestrate duplicatetesting' contains 'testing orchestrate duplicate'.

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.
