[NoCoverage] PublicVisibility
Http/Requests/Employee/StoreEmployeeRequest.php:20:5
     /**
      * Determine if the user is authorized to make this request.
      */
-    public function authorize(): bool
+    protected function authorize(): bool
     {
         return true;

[NoCoverage] GreaterThanNegotiation
Http/Requests/Employee/StoreEmployeeRequest.php:47:9
         $userId = $this->request->get('userId');
         $password = $this->request->get('password');
 
-        if (is_null($userId) || ($userId > 0 && isset($password))) {
+        if (is_null($userId) || $userId <= 0 && isset($password)) {
             $rules['password'] = ['required', 'confirmed', 'min:7'];
         }

[NoCoverage] LogicalOrSingleSubExprNegation
Http/Requests/Employee/StoreEmployeeRequest.php:47:9
         $userId = $this->request->get('userId');
         $password = $this->request->get('password');
 
-        if (is_null($userId) || ($userId > 0 && isset($password))) {
+        if (!is_null($userId) || $userId > 0 && isset($password)) {
             $rules['password'] = ['required', 'confirmed', 'min:7'];
         }
