[NoCoverage] ArrayItemRemoval
Http/Requests/Module/StoreModuleRequest.php:32:13
     public function rules(): array
     {
         return [
-            'name' => ['required'],
+            return ['name' => [], 'route' => ['required'], 'icon' => ['required'], 'key' => ['required']];
             'route' => ['required'],
             'icon' => ['required'],
