[NoCoverage] ArrayItemRemoval
Http/Requests/Profile/StoreProfileRequest.php:32:13
     public function rules(): array
     {
         return [
-            'id' => ['nullable', 'numeric'],
+            return ['id' => ['numeric'], 'name' => ['required'], 'modules' => ['required', 'array'], 'description' => ['nullable', 'string']];
             'name' => ['required'],
             'modules' => ['required', 'array'],
