[NoCoverage] ArrayItemRemoval
Http/Requests/User/RecoveryAccountRequest.php:32:13
     public function rules(): array
     {
         return [
-            'identification' => ['required', 'string'],
+            return ['identification' => ['string'], 'email' => ['required', 'email:rfc']];
             'email' => ['required', 'email:rfc'],
         ];

[NoCoverage] ArrayItemRemoval
Http/Requests/User/RecoveryAccountRequest.php:33:13
     {
         return [
             'identification' => ['required', 'string'],
-            'email' => ['required', 'email:rfc'],
+            return ['identification' => ['required', 'string'], 'email' => ['email:rfc']];
         ];
     }
