[NoCoverage] PublicVisibility
app/Jobs/ProcessCommandWarmup.php:58:5
     /**
      * Execute the job.
      */
-    public function handle(): void
+    protected function handle(): void
     {
         try {

[NoCoverage] MethodCallRemoval
app/Jobs/ProcessCommandWarmup.php:61:13
     public function handle(): void
     {
         try {
-            Artisan::call($this->command);
+            
         } catch (Exception $exception) {
             $this->fail($exception);

[NoCoverage] MethodCallRemoval
app/Jobs/ProcessCommandWarmup.php:63:13
         try {
             Artisan::call($this->command);
         } catch (Exception $exception) {
-            $this->fail($exception);
+            
         }
     }
