[NoCoverage] PublicVisibility
app/Listeners/ProfilesWarmup.php:25:5
     /**
      * Handle the event.
      */
-    public function handle(ProfileUpdatedOrDeletedEvent|ModuleUpdatedOrDeletedEvent $event): void
+    protected function handle(ProfileUpdatedOrDeletedEvent|ModuleUpdatedOrDeletedEvent $event): void
     {
         ProcessCommandWarmup::dispatch('profile:warmup');

[NoCoverage] MethodCallRemoval
app/Listeners/ProfilesWarmup.php:27:9
      */
     public function handle(ProfileUpdatedOrDeletedEvent|ModuleUpdatedOrDeletedEvent $event): void
     {
-        ProcessCommandWarmup::dispatch('profile:warmup');
+        
         ProcessCommandWarmup::dispatch('module:warmup');
     }

[NoCoverage] MethodCallRemoval
app/Listeners/ProfilesWarmup.php:28:9
     public function handle(ProfileUpdatedOrDeletedEvent|ModuleUpdatedOrDeletedEvent $event): void
     {
         ProcessCommandWarmup::dispatch('profile:warmup');
-        ProcessCommandWarmup::dispatch('module:warmup');
+        
     }
 }
