[NoCoverage] PublicVisibility
app/Listeners/UserRefreshSession.php:29:5
     /**
      * Handle the event.
      */
-    public function handle(RefreshModulesSessionEvent $event): void
+    protected function handle(RefreshModulesSessionEvent $event): void
     {
         /** @var Profile $profileSession */

[NoCoverage] MethodCallRemoval
app/Listeners/UserRefreshSession.php:35:9
         $profileSession = $this->session->get('profile');
         $profile = $this->profileService->searchProfileById($profileSession->id()->value());
 
-        $this->session->forget('profile');
+        
         $this->session->put('profile', $profile);
     }

[NoCoverage] MethodCallRemoval
app/Listeners/UserRefreshSession.php:36:9
         $profile = $this->profileService->searchProfileById($profileSession->id()->value());
 
         $this->session->forget('profile');
-        $this->session->put('profile', $profile);
+        
     }
 }
