[NoCoverage] PublicVisibility
app/Listeners/UserWarmup.php:24:5
     /**
      * Handle the event.
      */
-    public function handle(UserUpdateOrDeleteEvent $event): void
+    protected function handle(UserUpdateOrDeleteEvent $event): void
     {
         ProcessCommandWarmup::dispatch('user:warmup '.$event->userId());

[NoCoverage] MethodCallRemoval
app/Listeners/UserWarmup.php:26:9
      */
     public function handle(UserUpdateOrDeleteEvent $event): void
     {
-        ProcessCommandWarmup::dispatch('user:warmup '.$event->userId());
+        
     }
 }

[NoCoverage] Concat
app/Listeners/UserWarmup.php:26:9
      */
     public function handle(UserUpdateOrDeleteEvent $event): void
     {
-        ProcessCommandWarmup::dispatch('user:warmup '.$event->userId());
+        ProcessCommandWarmup::dispatch($event->userId() . 'user:warmup ');
     }
 }
