[Survived] MethodCallRemoval
app/Providers/AppServiceProvider.php:30:9
      */
     public function register(): void
     {
-        $this->app->singletonIf(ImageManagerInterface::class, function (Application $app) {
-            return new ImageManager($app->make(Driver::class));
-        });
+        
 
         $this->app->singletonIf(StatefulGuard::class, function (Application $app) {

[Survived] MethodCallRemoval
app/Providers/AppServiceProvider.php:34:9
             return new ImageManager($app->make(Driver::class));
         });
 
-        $this->app->singletonIf(StatefulGuard::class, function (Application $app) {
-            $authManager = $app->make(AuthManager::class);
-
-            return $authManager->guard();
-        });
+        
     }
 

[Killed] PublicVisibility
app/Providers/AppServiceProvider.php:44:5
     /**
      * Bootstrap any application services.
      */
-    public function boot(): void
+    protected function boot(): void
     {
         Event::listen(
killedBy: Tests\Feature\Core\Profile\Domain\ValueObjects\ModuleRouteTest::test_value_should_return_string
statusReason: 1) Tests\Feature\Core\Profile\Domain\ValueObjects\ModuleRouteTest::test_value_should_return_string
Error: Call to protected method App\Providers\AppServiceProvider::boot() from scope Illuminate\Container\BoundMethod

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Container/BoundMethod.php:36
/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Container/Util.php:41

[Survived] MethodCallRemoval
app/Providers/AppServiceProvider.php:46:9
      */
     public function boot(): void
     {
-        Event::listen(
-            ModuleUpdatedOrDeletedEvent::class,
-            ProfilesWarmup::class
-        );
+        
 
         Event::listen(

[Survived] MethodCallRemoval
app/Providers/AppServiceProvider.php:51:9
             ProfilesWarmup::class
         );
 
-        Event::listen(
-            ProfileUpdatedOrDeletedEvent::class,
-            ProfilesWarmup::class
-        );
+        
 
         Event::listen(

[Survived] MethodCallRemoval
app/Providers/AppServiceProvider.php:56:9
             ProfilesWarmup::class
         );
 
-        Event::listen(
-            RefreshModulesSessionEvent::class,
-            UserRefreshSession::class
-        );
+        
 
         Event::listen(

[Survived] MethodCallRemoval
app/Providers/AppServiceProvider.php:61:9
             UserRefreshSession::class
         );
 
-        Event::listen(
-            EmployeeUpdateOrDeletedEvent::class,
-            EmployeeWarmup::class
-        );
+        
 
         Event::listen(

[Survived] MethodCallRemoval
app/Providers/AppServiceProvider.php:66:9
             EmployeeWarmup::class
         );
 
-        Event::listen(
-            UserUpdateOrDeleteEvent::class,
-            UserWarmup::class
-        );
+        
     }
 }
