[NoCoverage] MethodCallRemoval
app/Providers/Service/ControllerServiceProvider.php:27:13
         $this->app->singletonIf(ActionExecutorHandler::class, function (Application $app) {
             $actionExecutorHandler = new ActionExecutorHandler;
 
-            $actionExecutorHandler->addActionExecutor(
-                $app->make(CreateProfileActionExecutor::class)
-            );
+            
 
             $actionExecutorHandler->addActionExecutor(

[NoCoverage] MethodCallRemoval
app/Providers/Service/ControllerServiceProvider.php:31:13
                 $app->make(CreateProfileActionExecutor::class)
             );
 
-            $actionExecutorHandler->addActionExecutor(
-                $app->make(UpdateProfileActionExecutor::class)
-            );
+            
 
             $actionExecutorHandler->addActionExecutor(

[NoCoverage] MethodCallRemoval
app/Providers/Service/ControllerServiceProvider.php:35:13
                 $app->make(UpdateProfileActionExecutor::class)
             );
 
-            $actionExecutorHandler->addActionExecutor(
-                $app->make(CreateModuleActionExecutor::class)
-            );
+            
 
             $actionExecutorHandler->addActionExecutor(

[NoCoverage] MethodCallRemoval
app/Providers/Service/ControllerServiceProvider.php:39:13
                 $app->make(CreateModuleActionExecutor::class)
             );
 
-            $actionExecutorHandler->addActionExecutor(
-                $app->make(UpdateModuleActionExecutor::class)
-            );
+            
 
             $actionExecutorHandler->addActionExecutor(

[NoCoverage] MethodCallRemoval
app/Providers/Service/ControllerServiceProvider.php:43:13
                 $app->make(UpdateModuleActionExecutor::class)
             );
 
-            $actionExecutorHandler->addActionExecutor(
-                $app->make(CreateInstitutionActionExecutor::class)
-            );
+            
 
             $actionExecutorHandler->addActionExecutor(

[NoCoverage] MethodCallRemoval
app/Providers/Service/ControllerServiceProvider.php:47:13
                 $app->make(CreateInstitutionActionExecutor::class)
             );
 
-            $actionExecutorHandler->addActionExecutor(
-                $app->make(UpdateInstitutionActionExecutor::class)
-            );
+            
 
             $actionExecutorHandler->addActionExecutor(

[NoCoverage] MethodCallRemoval
app/Providers/Service/ControllerServiceProvider.php:51:13
                 $app->make(UpdateInstitutionActionExecutor::class)
             );
 
-            $actionExecutorHandler->addActionExecutor(
-                $app->make(CreateEmployeeActionExecutor::class)
-            );
+            
 
             $actionExecutorHandler->addActionExecutor(

[NoCoverage] MethodCallRemoval
app/Providers/Service/ControllerServiceProvider.php:55:13
                 $app->make(CreateEmployeeActionExecutor::class)
             );
 
-            $actionExecutorHandler->addActionExecutor(
-                $app->make(UpdateEmployeeActionExecutor::class)
-            );
+            
 
             return $actionExecutorHandler;
