[Survived] MethodCallRemoval
app/Providers/Service/EmployeeServiceProvider.php:37:9
      */
     public function register(): void
     {
-        $this->app->singletonIf(EmployeeRepositoryContract::class, function (Application $app) {
-            $chainRepository = new ChainEmployeeRepository;
-
-            $chainRepository->addRepository(
-                $app->make(RedisEmployeeRepository::class)
-            )
-                ->addRepository(
-                    $app->make(EloquentEmployeeRepository::class)
-                );
-
-            return $chainRepository;
-        });
+        
 
         //Commands

[NoCoverage] MethodCallRemoval
app/Providers/Service/EmployeeServiceProvider.php:40:13
         $this->app->singletonIf(EmployeeRepositoryContract::class, function (Application $app) {
             $chainRepository = new ChainEmployeeRepository;
 
-            $chainRepository->addRepository(
-                $app->make(RedisEmployeeRepository::class)
-            )
-                ->addRepository(
-                    $app->make(EloquentEmployeeRepository::class)
-                );
+            
 
             return $chainRepository;

[Survived] MethodCallRemoval
app/Providers/Service/EmployeeServiceProvider.php:51:9
         });
 
         //Commands
-        $this->app->singletonIf(EmployeeWarmup::class, function (Application $app) {
-            return new EmployeeWarmup(
-                $app->make(LoggerInterface::class),
-                $app->make(EmployeeFactoryContract::class),
-                $app->make(EloquentEmployeeRepository::class),
-                $app->make(RedisEmployeeRepository::class),
-            );
-        });
+        
     }
 

[NoCoverage] ArrayItemRemoval
app/Providers/Service/EmployeeServiceProvider.php:68:9
      */
     public function provides(): array
     {
-        return [
-            EmployeeFactoryContract::class,
-            EmployeeManagementContract::class,
-            EmployeeDataTransformerContract::class,
-        ];
+        return [EmployeeManagementContract::class, EmployeeDataTransformerContract::class];
     }
 
