[Survived] MethodCallRemoval
app/Providers/Service/InstitutionServiceProvider.php:36:9
      */
     public function register(): void
     {
-        $this->app->singletonIf(InstitutionRepositoryContract::class, function (Application $app) {
-            $chainRepository = new ChainInstitutionRepository;
-
-            $chainRepository->addRepository(
-                $app->make(RedisInstitutionRepository::class)
-            );
-
-            $chainRepository->addRepository(
-                $app->make(EloquentInstitutionRepository::class)
-            );
-
-            return $chainRepository;
-        });
+        
 
         //Commands

[NoCoverage] MethodCallRemoval
app/Providers/Service/InstitutionServiceProvider.php:39:13
         $this->app->singletonIf(InstitutionRepositoryContract::class, function (Application $app) {
             $chainRepository = new ChainInstitutionRepository;
 
-            $chainRepository->addRepository(
-                $app->make(RedisInstitutionRepository::class)
-            );
+            
 
             $chainRepository->addRepository(

[NoCoverage] MethodCallRemoval
app/Providers/Service/InstitutionServiceProvider.php:43:13
                 $app->make(RedisInstitutionRepository::class)
             );
 
-            $chainRepository->addRepository(
-                $app->make(EloquentInstitutionRepository::class)
-            );
+            
 
             return $chainRepository;

[Survived] MethodCallRemoval
app/Providers/Service/InstitutionServiceProvider.php:51:9
         });
 
         //Commands
-        $this->app->singletonIf(InstitutionWarmup::class, function (Application $app) {
-            return new InstitutionWarmup(
-                $app->make(LoggerInterface::class),
-                $app->make(InstitutionFactoryContract::class),
-                $app->make(EloquentInstitutionRepository::class),
-                $app->make(RedisInstitutionRepository::class)
-            );
-        });
+        
     }
 
