[NoCoverage] MethodCallRemoval
app/Providers/Service/OrchestratorServiceProvider.php:52:13
             $orchestratorHandler = new OrchestratorHandler;
 
             //Employee Orchestrators
-            $orchestratorHandler->addOrchestrator(
-                $app->make(CreateEmployeeOrchestrator::class)
-            );
+            
 
             $orchestratorHandler->addOrchestrator(

[NoCoverage] MethodCallRemoval
app/Providers/Service/OrchestratorServiceProvider.php:56:13
                 $app->make(CreateEmployeeOrchestrator::class)
             );
 
-            $orchestratorHandler->addOrchestrator(
-                $app->make(ChangeStateEmployeeOrchestrator::class)
-            );
+            
 
             $orchestratorHandler->addOrchestrator(

[NoCoverage] MethodCallRemoval
app/Providers/Service/OrchestratorServiceProvider.php:60:13
                 $app->make(ChangeStateEmployeeOrchestrator::class)
             );
 
-            $orchestratorHandler->addOrchestrator(
-                $app->make(GetEmployeesOrchestrator::class)
-            );
+            
 
             $orchestratorHandler->addOrchestrator(

[NoCoverage] MethodCallRemoval
app/Providers/Service/OrchestratorServiceProvider.php:64:13
                 $app->make(GetEmployeesOrchestrator::class)
             );
 
-            $orchestratorHandler->addOrchestrator(
-                $app->make(GetEmployeeOrchestrator::class)
-            );
+            
 
             $orchestratorHandler->addOrchestrator(

[NoCoverage] MethodCallRemoval
app/Providers/Service/OrchestratorServiceProvider.php:68:13
                 $app->make(GetEmployeeOrchestrator::class)
             );
 
-            $orchestratorHandler->addOrchestrator(
-                $app->make(DetailEmployeeOrchestrator::class)
-            );
+            
 
             $orchestratorHandler->addOrchestrator(

[NoCoverage] MethodCallRemoval
app/Providers/Service/OrchestratorServiceProvider.php:72:13
                 $app->make(DetailEmployeeOrchestrator::class)
             );
 
-            $orchestratorHandler->addOrchestrator(
-                $app->make(UpdateEmployeeOrchestrator::class)
-            );
+            
 
             $orchestratorHandler->addOrchestrator(

[NoCoverage] MethodCallRemoval
app/Providers/Service/OrchestratorServiceProvider.php:76:13
                 $app->make(UpdateEmployeeOrchestrator::class)
             );
 
-            $orchestratorHandler->addOrchestrator(
-                $app->make(DeleteEmployeeOrchestrator::class)
-            );
+            
 
             //User Orchestrators

[NoCoverage] MethodCallRemoval
app/Providers/Service/OrchestratorServiceProvider.php:81:13
             );
 
             //User Orchestrators
-            $orchestratorHandler->addOrchestrator(
-                $app->make(ChangeStateUserOrchestrator::class)
-            );
+            
 
             $orchestratorHandler->addOrchestrator(

[NoCoverage] MethodCallRemoval
app/Providers/Service/OrchestratorServiceProvider.php:85:13
                 $app->make(ChangeStateUserOrchestrator::class)
             );
 
-            $orchestratorHandler->addOrchestrator(
-                $app->make(GetUserOrchestrator::class)
-            );
+            
 
             $orchestratorHandler->addOrchestrator(

[NoCoverage] MethodCallRemoval
app/Providers/Service/OrchestratorServiceProvider.php:89:13
                 $app->make(GetUserOrchestrator::class)
             );
 
-            $orchestratorHandler->addOrchestrator(
-                $app->make(CreateUserOrchestrator::class)
-            );
+            
 
             $orchestratorHandler->addOrchestrator(

[NoCoverage] MethodCallRemoval
app/Providers/Service/OrchestratorServiceProvider.php:93:13
                 $app->make(CreateUserOrchestrator::class)
             );
 
-            $orchestratorHandler->addOrchestrator(
-                $app->make(UpdateUserOrchestrator::class)
-            );
+            
 
             $orchestratorHandler->addOrchestrator(

[NoCoverage] MethodCallRemoval
app/Providers/Service/OrchestratorServiceProvider.php:97:13
                 $app->make(UpdateUserOrchestrator::class)
             );
 
-            $orchestratorHandler->addOrchestrator(
-                $app->make(DeleteUserOrchestrator::class)
-            );
+            
 
             //Profile Orchestrators

[NoCoverage] MethodCallRemoval
app/Providers/Service/OrchestratorServiceProvider.php:102:13
             );
 
             //Profile Orchestrators
-            $orchestratorHandler->addOrchestrator(
-                $app->make(GetProfilesOrchestrator::class)
-            );
+            
 
             $orchestratorHandler->addOrchestrator(

[NoCoverage] MethodCallRemoval
app/Providers/Service/OrchestratorServiceProvider.php:106:13
                 $app->make(GetProfilesOrchestrator::class)
             );
 
-            $orchestratorHandler->addOrchestrator(
-                $app->make(GetProfileOrchestrator::class)
-            );
+            
 
             $orchestratorHandler->addOrchestrator(

[NoCoverage] MethodCallRemoval
app/Providers/Service/OrchestratorServiceProvider.php:110:13
                 $app->make(GetProfileOrchestrator::class)
             );
 
-            $orchestratorHandler->addOrchestrator(
-                $app->make(ChangeStateProfileOrchestrator::class)
-            );
+            
 
             $orchestratorHandler->addOrchestrator(

[NoCoverage] MethodCallRemoval
app/Providers/Service/OrchestratorServiceProvider.php:114:13
                 $app->make(ChangeStateProfileOrchestrator::class)
             );
 
-            $orchestratorHandler->addOrchestrator(
-                $app->make(DeleteProfileOrchestrator::class)
-            );
+            
 
             $orchestratorHandler->addOrchestrator(

[NoCoverage] MethodCallRemoval
app/Providers/Service/OrchestratorServiceProvider.php:118:13
                 $app->make(DeleteProfileOrchestrator::class)
             );
 
-            $orchestratorHandler->addOrchestrator(
-                $app->make(DetailProfileOrchestrator::class)
-            );
+            
 
             $orchestratorHandler->addOrchestrator(

[NoCoverage] MethodCallRemoval
app/Providers/Service/OrchestratorServiceProvider.php:122:13
                 $app->make(DetailProfileOrchestrator::class)
             );
 
-            $orchestratorHandler->addOrchestrator(
-                $app->make(CreateProfileOrchestrator::class)
-            );
+            
 
             $orchestratorHandler->addOrchestrator(

[NoCoverage] MethodCallRemoval
app/Providers/Service/OrchestratorServiceProvider.php:126:13
                 $app->make(CreateProfileOrchestrator::class)
             );
 
-            $orchestratorHandler->addOrchestrator(
-                $app->make(UpdateProfileOrchestrator::class)
-            );
+            
 
             //Institution Orchestrators

[NoCoverage] MethodCallRemoval
app/Providers/Service/OrchestratorServiceProvider.php:131:13
             );
 
             //Institution Orchestrators
-            $orchestratorHandler->addOrchestrator(
-                $app->make(ChangeStateInstitutionOrchestrator::class)
-            );
+            
 
             $orchestratorHandler->addOrchestrator(

[NoCoverage] MethodCallRemoval
app/Providers/Service/OrchestratorServiceProvider.php:135:13
                 $app->make(ChangeStateInstitutionOrchestrator::class)
             );
 
-            $orchestratorHandler->addOrchestrator(
-                $app->make(GetInstitutionsOrchestrator::class)
-            );
+            
 
             $orchestratorHandler->addOrchestrator(

[NoCoverage] MethodCallRemoval
app/Providers/Service/OrchestratorServiceProvider.php:139:13
                 $app->make(GetInstitutionsOrchestrator::class)
             );
 
-            $orchestratorHandler->addOrchestrator(
-                $app->make(DetailInstitutionOrchestrator::class)
-            );
+            
 
             $orchestratorHandler->addOrchestrator(

[NoCoverage] MethodCallRemoval
app/Providers/Service/OrchestratorServiceProvider.php:143:13
                 $app->make(DetailInstitutionOrchestrator::class)
             );
 
-            $orchestratorHandler->addOrchestrator(
-                $app->make(CreateInstitutionOrchestrator::class)
-            );
+            
 
             $orchestratorHandler->addOrchestrator(

[NoCoverage] MethodCallRemoval
app/Providers/Service/OrchestratorServiceProvider.php:147:13
                 $app->make(CreateInstitutionOrchestrator::class)
             );
 
-            $orchestratorHandler->addOrchestrator(
-                $app->make(UpdateInstitutionOrchestrator::class)
-            );
+            
 
             $orchestratorHandler->addOrchestrator(

[NoCoverage] MethodCallRemoval
app/Providers/Service/OrchestratorServiceProvider.php:151:13
                 $app->make(UpdateInstitutionOrchestrator::class)
             );
 
-            $orchestratorHandler->addOrchestrator(
-                $app->make(DeleteInstitutionOrchestrator::class)
-            );
+            
 
             //Module Orchestrators

[NoCoverage] MethodCallRemoval
app/Providers/Service/OrchestratorServiceProvider.php:156:13
             );
 
             //Module Orchestrators
-            $orchestratorHandler->addOrchestrator(
-                $app->make(ChangeStateModuleOrchestrator::class)
-            );
+            
 
             $orchestratorHandler->addOrchestrator(

[NoCoverage] MethodCallRemoval
app/Providers/Service/OrchestratorServiceProvider.php:160:13
                 $app->make(ChangeStateModuleOrchestrator::class)
             );
 
-            $orchestratorHandler->addOrchestrator(
-                $app->make(DetailModuleOrchestrator::class)
-            );
+            
 
             $orchestratorHandler->addOrchestrator(

[NoCoverage] MethodCallRemoval
app/Providers/Service/OrchestratorServiceProvider.php:164:13
                 $app->make(DetailModuleOrchestrator::class)
             );
 
-            $orchestratorHandler->addOrchestrator(
-                $app->make(CreateModuleOrchestrator::class)
-            );
+            
 
             $orchestratorHandler->addOrchestrator(

[NoCoverage] MethodCallRemoval
app/Providers/Service/OrchestratorServiceProvider.php:168:13
                 $app->make(CreateModuleOrchestrator::class)
             );
 
-            $orchestratorHandler->addOrchestrator(
-                $app->make(UpdateModuleOrchestrator::class)
-            );
+            
 
             $orchestratorHandler->addOrchestrator(

[NoCoverage] MethodCallRemoval
app/Providers/Service/OrchestratorServiceProvider.php:172:13
                 $app->make(UpdateModuleOrchestrator::class)
             );
 
-            $orchestratorHandler->addOrchestrator(
-                $app->make(DeleteModuleOrchestrator::class)
-            );
+            
 
             $orchestratorHandler->addOrchestrator(

[NoCoverage] MethodCallRemoval
app/Providers/Service/OrchestratorServiceProvider.php:176:13
                 $app->make(DeleteModuleOrchestrator::class)
             );
 
-            $orchestratorHandler->addOrchestrator(
-                $app->make(GetModulesOrchestrator::class)
-            );
+            
 
             return $orchestratorHandler;
