[Survived] MethodCallRemoval
app/Providers/Service/ProfileServiceProvider.php:53:9
      */
     public function register(): void
     {
-        $this->app->singletonIf(ProfileRepositoryContract::class, function (Application $app) {
-            $chainRepository = new ChainProfileRepository;
-
-            $chainRepository->addRepository(
-                $app->make(RedisProfileRepository::class)
-            )
-                ->addRepository(
-                    $app->make(EloquentProfileRepository::class)
-                );
-
-            return $chainRepository;
-        });
+        
 
         $this->app->singletonIf(ModuleRepositoryContract::class, function (Application $app) {

[NoCoverage] MethodCallRemoval
app/Providers/Service/ProfileServiceProvider.php:56:13
         $this->app->singletonIf(ProfileRepositoryContract::class, function (Application $app) {
             $chainRepository = new ChainProfileRepository;
 
-            $chainRepository->addRepository(
-                $app->make(RedisProfileRepository::class)
-            )
-                ->addRepository(
-                    $app->make(EloquentProfileRepository::class)
-                );
+            
 
             return $chainRepository;

[Survived] MethodCallRemoval
app/Providers/Service/ProfileServiceProvider.php:66:9
             return $chainRepository;
         });
 
-        $this->app->singletonIf(ModuleRepositoryContract::class, function (Application $app) {
-            $chainRepository = new ChainModuleRepository;
-
-            $chainRepository->addRepository(
-                $app->make(RedisModuleRepository::class)
-            )
-                ->addRepository(
-                    $app->make(EloquentModuleRepository::class)
-                );
-
-            return $chainRepository;
-        });
+        
 
         //Commands

[NoCoverage] MethodCallRemoval
app/Providers/Service/ProfileServiceProvider.php:69:13
         $this->app->singletonIf(ModuleRepositoryContract::class, function (Application $app) {
             $chainRepository = new ChainModuleRepository;
 
-            $chainRepository->addRepository(
-                $app->make(RedisModuleRepository::class)
-            )
-                ->addRepository(
-                    $app->make(EloquentModuleRepository::class)
-                );
+            
 
             return $chainRepository;

[Survived] MethodCallRemoval
app/Providers/Service/ProfileServiceProvider.php:80:9
         });
 
         //Commands
-        $this->app->singletonIf(ProfileWarmup::class, function (Application $app) {
-            return new ProfileWarmup(
-                $app->make(LoggerInterface::class),
-                $app->make(ProfileFactoryContract::class),
-                $app->make(EloquentProfileRepository::class),
-                $app->make(RedisProfileRepository::class),
-            );
-        });
+        
 
         $this->app->singletonIf(ModuleWarmup::class, function (Application $app) {

[NoCoverage] NewObject
app/Providers/Service/ProfileServiceProvider.php:81:13
 
         //Commands
         $this->app->singletonIf(ProfileWarmup::class, function (Application $app) {
-            return new ProfileWarmup(
-                $app->make(LoggerInterface::class),
-                $app->make(ProfileFactoryContract::class),
-                $app->make(EloquentProfileRepository::class),
-                $app->make(RedisProfileRepository::class),
-            );
+            new ProfileWarmup($app->make(LoggerInterface::class), $app->make(ProfileFactoryContract::class), $app->make(EloquentProfileRepository::class), $app->make(RedisProfileRepository::class));
+            return null;
         });
 

[Survived] MethodCallRemoval
app/Providers/Service/ProfileServiceProvider.php:89:9
             );
         });
 
-        $this->app->singletonIf(ModuleWarmup::class, function (Application $app) {
-            return new ModuleWarmup(
-                $app->make(LoggerInterface::class),
-                $app->make(ModuleFactoryContract::class),
-                $app->make(EloquentModuleRepository::class),
-                $app->make(RedisModuleRepository::class),
-            );
-        });
+        
     }
 

[NoCoverage] NewObject
app/Providers/Service/ProfileServiceProvider.php:90:13
         });
 
         $this->app->singletonIf(ModuleWarmup::class, function (Application $app) {
-            return new ModuleWarmup(
-                $app->make(LoggerInterface::class),
-                $app->make(ModuleFactoryContract::class),
-                $app->make(EloquentModuleRepository::class),
-                $app->make(RedisModuleRepository::class),
-            );
+            new ModuleWarmup($app->make(LoggerInterface::class), $app->make(ModuleFactoryContract::class), $app->make(EloquentModuleRepository::class), $app->make(RedisModuleRepository::class));
+            return null;
         });
     }

[NoCoverage] ArrayItemRemoval
app/Providers/Service/ProfileServiceProvider.php:106:9
      */
     public function provides(): array
     {
-        return [
-            ProfileFactoryContract::class,
-            ProfileDataTransformerContract::class,
-            ProfileManagementContract::class,
-
-            ModuleFactoryContract::class,
-            ModuleDataTransformerContract::class,
-            ModuleManagementContract::class,
-        ];
+        return [ProfileDataTransformerContract::class, ProfileManagementContract::class, ModuleFactoryContract::class, ModuleDataTransformerContract::class, ModuleManagementContract::class];
     }
 
