[Survived] MethodCallRemoval
app/Providers/Service/UserServiceProvider.php:37:9
      */
     public function register(): void
     {
-        $this->app->singletonIf(UserRepositoryContract::class, function (Application $app) {
-            $chainRepository = new ChainUserRepository;
-
-            $chainRepository->addRepository(
-                $app->make(RedisUserRepository::class)
-            )
-                ->addRepository(
-                    $app->make(EloquentUserRepository::class)
-                );
-
-            return $chainRepository;
-        });
+        
 
         //Commands

[NoCoverage] MethodCallRemoval
app/Providers/Service/UserServiceProvider.php:40:13
         $this->app->singletonIf(UserRepositoryContract::class, function (Application $app) {
             $chainRepository = new ChainUserRepository;
 
-            $chainRepository->addRepository(
-                $app->make(RedisUserRepository::class)
-            )
-                ->addRepository(
-                    $app->make(EloquentUserRepository::class)
-                );
+            
 
             return $chainRepository;

[Survived] MethodCallRemoval
app/Providers/Service/UserServiceProvider.php:51:9
         });
 
         //Commands
-        $this->app->singletonIf(UserWarmup::class, function (Application $app) {
-            return new UserWarmup(
-                $app->make(LoggerInterface::class),
-                $app->make(UserFactoryContract::class),
-                $app->make(EloquentUserRepository::class),
-                $app->make(RedisUserRepository::class),
-            );
-        });
+        
     }
 

[NoCoverage] NewObject
app/Providers/Service/UserServiceProvider.php:52:13
 
         //Commands
         $this->app->singletonIf(UserWarmup::class, function (Application $app) {
-            return new UserWarmup(
-                $app->make(LoggerInterface::class),
-                $app->make(UserFactoryContract::class),
-                $app->make(EloquentUserRepository::class),
-                $app->make(RedisUserRepository::class),
-            );
+            new UserWarmup($app->make(LoggerInterface::class), $app->make(UserFactoryContract::class), $app->make(EloquentUserRepository::class), $app->make(RedisUserRepository::class));
+            return null;
         });
     }
