[Survived] PublicVisibility
app/Traits/DataTablesTrait.php:15:5
 {
     private ViewFactory $viewFactory;
 
-    public function setViewFactory(ViewFactory $viewFactory): void
+    protected function setViewFactory(ViewFactory $viewFactory): void
     {
         $this->viewFactory = $viewFactory;
