[Survived] PublicVisibility
app/Traits/UserTrait.php:11:5
 {
     private Hasher $hasher;
 
-    public function setHasher(Hasher $hasher): void
+    protected function setHasher(Hasher $hasher): void
     {
         $this->hasher = $hasher;

[Survived] PublicVisibility
app/Traits/UserTrait.php:16:5
         $this->hasher = $hasher;
     }
 
-    public function makeHashPassword(string $password): string
+    protected function makeHashPassword(string $password): string
     {
         return $this->hasher->make($password);
