[Survived] PublicVisibility
app/Traits/UtilsDateTimeTrait.php:17:5
     /**
      * @return DateTime
      */
-    public function getCurrentTime(): DateTime
+    protected function getCurrentTime(): DateTime
     {
         return new DateTime;

[Survived] PublicVisibility
app/Traits/UtilsDateTimeTrait.php:25:5
     /**
      * @throws Exception
      */
-    public function getDateTime(string $datetime): DateTime
+    protected function getDateTime(string $datetime): DateTime
     {
         return new DateTime($datetime);
