[NoCoverage] PublicVisibility
app/View/Composers/HomeComposer.php:10:5
 
 class HomeComposer
 {
-    public function compose(View $view): void
+    protected function compose(View $view): void
     {
         $random = Str::random(10);

[NoCoverage] MethodCallRemoval
app/View/Composers/HomeComposer.php:13:9
     public function compose(View $view): void
     {
         $random = Str::random(10);
-        $view->with('versionRandom', $random);
+        
     }
 }
