[NoCoverage] PublicVisibility
app/View/Composers/MenuComposer.php:38:5
         $this->imagePathFull = '/images/full/';
     }
 
-    public function compose(View $view): void
+    protected function compose(View $view): void
     {
         /** @var User $user */

[NoCoverage] DecrementInteger
app/View/Composers/MenuComposer.php:49:9
         $employee = $this->session->get('employee');
 
         $menu = $this->prepareMenu($profile->modules());
-        $image = url($this->imagePathFull.$user->photo()->value().'?v='.Str::random(10));
+        $image = url($this->imagePathFull . $user->photo()->value() . '?v=' . Str::random(9));
 
         $view->with('menu', $menu);

[NoCoverage] IncrementInteger
app/View/Composers/MenuComposer.php:49:9
         $employee = $this->session->get('employee');
 
         $menu = $this->prepareMenu($profile->modules());
-        $image = url($this->imagePathFull.$user->photo()->value().'?v='.Str::random(10));
+        $image = url($this->imagePathFull . $user->photo()->value() . '?v=' . Str::random(11));
 
         $view->with('menu', $menu);

[NoCoverage] MethodCallRemoval
app/View/Composers/MenuComposer.php:51:9
         $menu = $this->prepareMenu($profile->modules());
         $image = url($this->imagePathFull.$user->photo()->value().'?v='.Str::random(10));
 
-        $view->with('menu', $menu);
+        
         $view->with('user', $user);
         $view->with('employee', $employee);

[NoCoverage] MethodCallRemoval
app/View/Composers/MenuComposer.php:52:9
         $image = url($this->imagePathFull.$user->photo()->value().'?v='.Str::random(10));
 
         $view->with('menu', $menu);
-        $view->with('user', $user);
+        
         $view->with('employee', $employee);
         $view->with('profile', $profile);

[NoCoverage] MethodCallRemoval
app/View/Composers/MenuComposer.php:53:9
 
         $view->with('menu', $menu);
         $view->with('user', $user);
-        $view->with('employee', $employee);
+        
         $view->with('profile', $profile);
         $view->with('image', $image);

[NoCoverage] MethodCallRemoval
app/View/Composers/MenuComposer.php:54:9
         $view->with('menu', $menu);
         $view->with('user', $user);
         $view->with('employee', $employee);
-        $view->with('profile', $profile);
+        
         $view->with('image', $image);
     }

[NoCoverage] MethodCallRemoval
app/View/Composers/MenuComposer.php:55:9
         $view->with('user', $user);
         $view->with('employee', $employee);
         $view->with('profile', $profile);
-        $view->with('image', $image);
+        
     }
 

[NoCoverage] Foreach_
app/View/Composers/MenuComposer.php:62:9
     {
         $menuWithChildren = [];
         $menuUnique = [];
-        foreach ($this->config->get('menu.options') as $index => $item) {
-            $item['id'] = 0;
-
-            if (is_null($item['route'])) {
-                $options = $modules->moduleElementsOfKey($index);
-
-                if (count($options)) {
-                    $item['key'] = $index;
-                    $item['route'] = '';
-
-                    $mainModule = $this->changeExpandedToModule($options, $this->getModuleMenu($item));
-
-                    $menuWithChildren[] = $mainModule;
-                }
-            } else {
-                $item['key'] = '';
-                $menuUnique[] = $this->getModuleMenu($item);
-            }
-        }
+        foreach ([] as $index => $item) {
 
         return array_merge($menuWithChildren, $menuUnique);

[NoCoverage] DecrementInteger
app/View/Composers/MenuComposer.php:63:13
         $menuWithChildren = [];
         $menuUnique = [];
         foreach ($this->config->get('menu.options') as $index => $item) {
-            $item['id'] = 0;
+            $item['id'] = -1;
 
             if (is_null($item['route'])) {

[NoCoverage] IfNegation
app/View/Composers/MenuComposer.php:65:13
         foreach ($this->config->get('menu.options') as $index => $item) {
             $item['id'] = 0;
 
-            if (is_null($item['route'])) {
-                $options = $modules->moduleElementsOfKey($index);
-
-                if (count($options)) {
-                    $item['key'] = $index;
-                    $item['route'] = '';
-
-                    $mainModule = $this->changeExpandedToModule($options, $this->getModuleMenu($item));
-
-                    $menuWithChildren[] = $mainModule;
-                }
-            } else {
-                $item['key'] = '';
-                $menuUnique[] = $this->getModuleMenu($item);
-            }
+            if (!is_null($item['route'])) {
         }
 

[NoCoverage] IfNegation
app/View/Composers/MenuComposer.php:68:17
             if (is_null($item['route'])) {
                 $options = $modules->moduleElementsOfKey($index);
 
-                if (count($options)) {
-                    $item['key'] = $index;
-                    $item['route'] = '';
-
-                    $mainModule = $this->changeExpandedToModule($options, $this->getModuleMenu($item));
-
-                    $menuWithChildren[] = $mainModule;
-                }
+                if (!count($options)) {
             } else {
                 $item['key'] = '';

[NoCoverage] Foreach_
app/View/Composers/MenuComposer.php:103:9
     {
         $routeCurrent = $this->router->current()->uri();
 
-        foreach ($modules as $item) {
-            if ($item->route()->value() === $routeCurrent) {
-                $item->setExpanded(true);
-                $mainModule->setExpanded(true);
-            }
-        }
+        foreach ([] as $item) {
         $mainModule->setOptions($modules);
 

[NoCoverage] Identical
app/View/Composers/MenuComposer.php:104:13
         $routeCurrent = $this->router->current()->uri();
 
         foreach ($modules as $item) {
-            if ($item->route()->value() === $routeCurrent) {
+            if ($item->route()->value() !== $routeCurrent) {
                 $item->setExpanded(true);
                 $mainModule->setExpanded(true);

[NoCoverage] TrueValue
app/View/Composers/MenuComposer.php:105:17
 
         foreach ($modules as $item) {
             if ($item->route()->value() === $routeCurrent) {
-                $item->setExpanded(true);
+                $item->setExpanded(false);
                 $mainModule->setExpanded(true);
             }

[NoCoverage] MethodCallRemoval
app/View/Composers/MenuComposer.php:105:17
 
         foreach ($modules as $item) {
             if ($item->route()->value() === $routeCurrent) {
-                $item->setExpanded(true);
+                
                 $mainModule->setExpanded(true);
             }

[NoCoverage] TrueValue
app/View/Composers/MenuComposer.php:106:17
         foreach ($modules as $item) {
             if ($item->route()->value() === $routeCurrent) {
                 $item->setExpanded(true);
-                $mainModule->setExpanded(true);
+                $mainModule->setExpanded(false);
             }
         }

[NoCoverage] MethodCallRemoval
app/View/Composers/MenuComposer.php:106:17
         foreach ($modules as $item) {
             if ($item->route()->value() === $routeCurrent) {
                 $item->setExpanded(true);
-                $mainModule->setExpanded(true);
+                
             }
         }

[NoCoverage] MethodCallRemoval
app/View/Composers/MenuComposer.php:109:9
                 $mainModule->setExpanded(true);
             }
         }
-        $mainModule->setOptions($modules);
+        
 
         return $mainModule;
