[Killed] MethodCallRemoval
Employee/Application/Factory/EmployeeFactory.php:44:9
             $this->buildEmployeeCreatedAt($data['createdAt']),
         );
 
-        $employee->setIdentificationType($this->buildEmployeeIdentificationType($data['identification_type']));
+        
         $employee->setUserId($this->buildEmployeeUserId($data['userId']));
         $employee->setAddress($this->buildEmployeeAddress($data['address']));
statusReason: Failed asserting that null is identical to 'type'.

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Application/Factory/EmployeeFactoryTest.php:77

FAILURES!
Tests: 1, Assertions: 12, Failures: 1.

[Killed] MethodCallRemoval
Employee/Application/Factory/EmployeeFactory.php:45:9
         );
 
         $employee->setIdentificationType($this->buildEmployeeIdentificationType($data['identification_type']));
-        $employee->setUserId($this->buildEmployeeUserId($data['userId']));
+        
         $employee->setAddress($this->buildEmployeeAddress($data['address']));
         $employee->setPhone($this->buildEmployeePhone($data['phone']));
statusReason: Failed asserting that null is identical to 1.

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Application/Factory/EmployeeFactoryTest.php:80

FAILURES!
Tests: 1, Assertions: 14, Failures: 1.

[Killed] MethodCallRemoval
Employee/Application/Factory/EmployeeFactory.php:46:9
 
         $employee->setIdentificationType($this->buildEmployeeIdentificationType($data['identification_type']));
         $employee->setUserId($this->buildEmployeeUserId($data['userId']));
-        $employee->setAddress($this->buildEmployeeAddress($data['address']));
+        
         $employee->setPhone($this->buildEmployeePhone($data['phone']));
         $employee->setEmail($this->buildEmployeeEmail($data['email']));
statusReason: Failed asserting that null is identical to 'address'.

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Application/Factory/EmployeeFactoryTest.php:83

FAILURES!
Tests: 1, Assertions: 16, Failures: 1.

[Killed] MethodCallRemoval
Employee/Application/Factory/EmployeeFactory.php:47:9
         $employee->setIdentificationType($this->buildEmployeeIdentificationType($data['identification_type']));
         $employee->setUserId($this->buildEmployeeUserId($data['userId']));
         $employee->setAddress($this->buildEmployeeAddress($data['address']));
-        $employee->setPhone($this->buildEmployeePhone($data['phone']));
+        
         $employee->setEmail($this->buildEmployeeEmail($data['email']));
 
statusReason: Failed asserting that null is identical to '12345'.

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Application/Factory/EmployeeFactoryTest.php:86

FAILURES!
Tests: 1, Assertions: 18, Failures: 1.

[Killed] MethodCallRemoval
Employee/Application/Factory/EmployeeFactory.php:48:9
         $employee->setUserId($this->buildEmployeeUserId($data['userId']));
         $employee->setAddress($this->buildEmployeeAddress($data['address']));
         $employee->setPhone($this->buildEmployeePhone($data['phone']));
-        $employee->setEmail($this->buildEmployeeEmail($data['email']));
+        
 
         if (isset($data['updatedAt'])) {
statusReason: Failed asserting that null is identical to 'some@some.com'.

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Application/Factory/EmployeeFactoryTest.php:89

FAILURES!
Tests: 1, Assertions: 20, Failures: 1.

[Killed] MethodCallRemoval
Employee/Application/Factory/EmployeeFactory.php:51:13
         $employee->setEmail($this->buildEmployeeEmail($data['email']));
 
         if (isset($data['updatedAt'])) {
-            $employee->setUpdatedAt(
-                $this->buildEmployeeUpdatedAt($data['updatedAt'])
-            );
+            
         }
 
statusReason: Failed asserting that null is identical to an object of class "DateTime".

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Application/Factory/EmployeeFactoryTest.php:107

FAILURES!
Tests: 1, Assertions: 32, Failures: 1.

[Killed] MethodCallRemoval
Employee/Application/Factory/EmployeeFactory.php:57:13
         }
 
         if (isset($data['birthdate'])) {
-            $employee->setBirthdate($this->buildEmployeeBirthdate($data['birthdate']));
+            
         }
 
statusReason: Failed asserting that null is identical to an object of class "DateTime".

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Application/Factory/EmployeeFactoryTest.php:101

FAILURES!
Tests: 1, Assertions: 28, Failures: 1.

[Killed] MethodCallRemoval
Employee/Application/Factory/EmployeeFactory.php:60:9
             $employee->setBirthdate($this->buildEmployeeBirthdate($data['birthdate']));
         }
 
-        $employee->setObservations($this->buildEmployeeObservations($data['observations']));
+        
         $employee->setImage($this->buildEmployeeImage($data['image']));
 
statusReason: Failed asserting that null is identical to 'testing'.

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Application/Factory/EmployeeFactoryTest.php:92

FAILURES!
Tests: 1, Assertions: 22, Failures: 1.

[Killed] MethodCallRemoval
Employee/Application/Factory/EmployeeFactory.php:61:9
         }
 
         $employee->setObservations($this->buildEmployeeObservations($data['observations']));
-        $employee->setImage($this->buildEmployeeImage($data['image']));
+        
 
         if (isset($data['search'])) {
statusReason: Failed asserting that null is identical to 'photo.jpg'.

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Application/Factory/EmployeeFactoryTest.php:95

FAILURES!
Tests: 1, Assertions: 24, Failures: 1.

[Killed] MethodCallRemoval
Employee/Application/Factory/EmployeeFactory.php:64:13
         $employee->setImage($this->buildEmployeeImage($data['image']));
 
         if (isset($data['search'])) {
-            $employee->setSearch($this->buildEmployeeSearch($data['search']));
+            
         }
 
statusReason: Failed asserting that null is identical to 'testing object employee'.

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Application/Factory/EmployeeFactoryTest.php:98

FAILURES!
Tests: 1, Assertions: 26, Failures: 1.

[Killed] LogicalNot
Employee/Application/Factory/EmployeeFactory.php:85:9
             $name
         );
 
-        if (! is_null($lastname)) {
+        if (is_null($lastname)) {
             $employee->setLastname($lastname);
         }
statusReason: Failed asserting that null is identical to 'smith'.

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Application/Factory/EmployeeFactoryTest.php:71

FAILURES!
Tests: 1, Assertions: 8, Failures: 1.

[Killed] MethodCallRemoval
Employee/Application/Factory/EmployeeFactory.php:86:13
         );
 
         if (! is_null($lastname)) {
-            $employee->setLastname($lastname);
+            
         }
         if (! is_null($createdAt)) {
statusReason: Failed asserting that null is identical to 'smith'.

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Application/Factory/EmployeeFactoryTest.php:71

FAILURES!
Tests: 1, Assertions: 8, Failures: 1.

[Killed] LogicalNot
Employee/Application/Factory/EmployeeFactory.php:88:9
         if (! is_null($lastname)) {
             $employee->setLastname($lastname);
         }
-        if (! is_null($createdAt)) {
+        if (is_null($createdAt)) {
             $employee->setCreatedAt($createdAt);
         }
statusReason: Failed asserting that two variables reference the same object.

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Application/Factory/EmployeeFactoryTest.php:104

FAILURES!
Tests: 1, Assertions: 30, Failures: 1.

[Killed] MethodCallRemoval
Employee/Application/Factory/EmployeeFactory.php:89:13
             $employee->setLastname($lastname);
         }
         if (! is_null($createdAt)) {
-            $employee->setCreatedAt($createdAt);
+            
         }
         if (! is_null($state)) {
statusReason: Failed asserting that two variables reference the same object.

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Application/Factory/EmployeeFactoryTest.php:104

FAILURES!
Tests: 1, Assertions: 30, Failures: 1.

[Survived] LogicalNot
Employee/Application/Factory/EmployeeFactory.php:91:9
         if (! is_null($createdAt)) {
             $employee->setCreatedAt($createdAt);
         }
-        if (! is_null($state)) {
+        if (is_null($state)) {
             $employee->setState($state);
         }

[Survived] MethodCallRemoval
Employee/Application/Factory/EmployeeFactory.php:92:13
             $employee->setCreatedAt($createdAt);
         }
         if (! is_null($state)) {
-            $employee->setState($state);
+            
         }
 
