[Killed] MethodCallRemoval
Application/UseCases/CreateEmployee/CreateEmployee.php:15:9
 {
     public function __construct(EmployeeRepositoryContract $employeeRepository)
     {
-        parent::__construct($employeeRepository);
+        
     }
 
killedBy: Tests\Feature\Core\Employee\Application\UseCases\CreateEmployee\CreateEmployeeTest::test_execute_should_persist_and_return_object_employee
statusReason: 1) Tests\Feature\Core\Employee\Application\UseCases\CreateEmployee\CreateEmployeeTest::test_execute_should_persist_and_return_object_employee
Error: Typed property Core\Employee\Application\UseCases\UseCasesService::$employeeRepository must not be accessed before initialization

/var/www/abacusSystem-new/src/core/Employee/Application/UseCases/CreateEmployee/CreateEmployee.php:25
/var/www/abacusSys

[Killed] MethodCallRemoval
Application/UseCases/CreateEmployee/CreateEmployee.php:23:9
      */
     public function execute(RequestService $request): Employee
     {
-        $this->validateRequest($request, CreateEmployeeRequest::class);
+        
 
         /** @var CreateEmployeeRequest $request */
killedBy: Tests\Feature\Core\Employee\Application\UseCases\CreateEmployee\CreateEmployeeTest::test_execute_should_return_exception
statusReason: 1) Tests\Feature\Core\Employee\Application\UseCases\CreateEmployee\CreateEmployeeTest::test_execute_should_return_exception
Failed asserting that exception of type "Error" matches expected exception "Exception". Message was: "Call to undefined method MockObject_DeleteEmployeeRequest_4189dc7b::employee()" at
/var/www/abacusSystem-new/src/core/Employee/Application/UseCases/CreateEmployee/CreateEmplo

[Killed] MethodCallRemoval
Application/UseCases/CreateEmployee/CreateEmployee.php:27:9
 
         /** @var CreateEmployeeRequest $request */
         $employee = $request->employee();
-        $employee->refreshSearch();
+        
 
         return $this->employeeRepository->persistEmployee($employee);
killedBy: Tests\Feature\Core\Employee\Application\UseCases\CreateEmployee\CreateEmployeeTest::test_execute_should_persist_and_return_object_employee
statusReason: 1) Tests\Feature\Core\Employee\Application\UseCases\CreateEmployee\CreateEmployeeTest::test_execute_should_persist_and_return_object_employee
Expectation failed for method name is "refreshSearch" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.
