[Killed] PublicVisibility
Application/UseCases/CreateEmployee/CreateEmployeeRequest.php:17:5
         $this->employee = $employee;
     }
 
-    public function employee(): Employee
+    protected function employee(): Employee
     {
         return $this->employee;
killedBy: Tests\Feature\Core\Employee\Application\UseCases\CreateEmployee\CreateEmployeeRequestTest::test_employee_should_return_object
statusReason: 1) Tests\Feature\Core\Employee\Application\UseCases\CreateEmployee\CreateEmployeeRequestTest::test_employee_should_return_object
Error: Call to protected method Core\Employee\Application\UseCases\CreateEmployee\CreateEmployeeRequest::employee() from scope Tests\Feature\Core\Employee\Application\UseCases\CreateEmployee\CreateEmployeeRequestTest

/var/www/abacusSystem-new/tests/Feature/Core/Employee
