[Killed] MethodCallRemoval
Application/UseCases/DeleteEmployee/DeleteEmployee.php:22:9
      */
     public function execute(RequestService $request): null
     {
-        $this->validateRequest($request, DeleteEmployeeRequest::class);
+        
 
         /** @var DeleteEmployeeRequest $request */
killedBy: Tests\Feature\Core\Employee\Application\UseCases\DeleteEmployee\DeleteEmployeeTest::test_execute_should_return_exception
statusReason: 1) Tests\Feature\Core\Employee\Application\UseCases\DeleteEmployee\DeleteEmployeeTest::test_execute_should_return_exception
Failed asserting that exception of type "Error" matches expected exception "Exception". Message was: "Call to undefined method MockObject_CreateEmployeeRequest_36b2ae5e::employeeId()" at
/var/www/abacusSystem-new/src/core/Employee/Application/UseCases/DeleteEmployee/DeleteEmp

[Killed] MethodCallRemoval
Application/UseCases/DeleteEmployee/DeleteEmployee.php:25:9
         $this->validateRequest($request, DeleteEmployeeRequest::class);
 
         /** @var DeleteEmployeeRequest $request */
-        $this->employeeRepository->delete($request->employeeId());
+        
 
         return null;
killedBy: Tests\Feature\Core\Employee\Application\UseCases\DeleteEmployee\DeleteEmployeeTest::test_execute_should_delete_and_return_null
statusReason: 1) Tests\Feature\Core\Employee\Application\UseCases\DeleteEmployee\DeleteEmployeeTest::test_execute_should_delete_and_return_null
Expectation failed for method name is "delete" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.
