[Killed] PublicVisibility
Application/UseCases/DeleteEmployee/DeleteEmployeeRequest.php:17:5
         $this->id = $id;
     }
 
-    public function employeeId(): EmployeeId
+    protected function employeeId(): EmployeeId
     {
         return $this->id;
killedBy: Tests\Feature\Core\Employee\Application\UseCases\DeleteEmployee\DeleteEmployeeRequestTest::test_employeeId_should_return_value_object
statusReason: 1) Tests\Feature\Core\Employee\Application\UseCases\DeleteEmployee\DeleteEmployeeRequestTest::test_employeeId_should_return_value_object
Error: Call to protected method Core\Employee\Application\UseCases\DeleteEmployee\DeleteEmployeeRequest::employeeId() from scope Tests\Feature\Core\Employee\Application\UseCases\DeleteEmployee\DeleteEmployeeRequestTest

/var/www/abacusSystem-new/tests/Feature/Cor
