[Killed] MethodCallRemoval
Application/UseCases/SearchEmployee/SearchEmployeeById.php:23:9
      */
     public function execute(RequestService $request): ?Employee
     {
-        $this->validateRequest($request, SearchEmployeeByIdRequest::class);
+        
 
         /** @var SearchEmployeeByIdRequest $request */
killedBy: Tests\Feature\Core\Employee\Application\UseCases\SearchEmployee\SearchEmployeeByIdTest::test_execute_should_return_exception
statusReason: 1) Tests\Feature\Core\Employee\Application\UseCases\SearchEmployee\SearchEmployeeByIdTest::test_execute_should_return_exception
Failed asserting that exception of type "Exception" is thrown.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
