[Killed] MethodCallRemoval
Application/UseCases/SearchEmployee/SearchEmployeeByIdentification.php:23:9
      */
     public function execute(RequestService $request): ?Employee
     {
-        $this->validateRequest($request, SearchEmployeeByIdentificationRequest::class);
+        
 
         /** @var SearchEmployeeByIdentificationRequest $request */
killedBy: Tests\Feature\Core\Employee\Application\UseCases\SearchEmployee\SearchEmployeeByIdentificationTest::test_execute_should_return_exception
statusReason: 1) Tests\Feature\Core\Employee\Application\UseCases\SearchEmployee\SearchEmployeeByIdentificationTest::test_execute_should_return_exception
Failed asserting that exception of type "Error" matches expected exception "Exception". Message was: "Call to undefined method MockObject_DeleteEmployeeRequest_7920d4e6::employeeIdentification()" at
/var/www/abacusSystem-new/src/core/Employee/Application/UseCa
