[Killed] PublicVisibility
Application/UseCases/SearchEmployee/SearchEmployeeByIdentificationRequest.php:17:5
         $this->identification = $identification;
     }
 
-    public function employeeIdentification(): EmployeeIdentification
+    protected function employeeIdentification(): EmployeeIdentification
     {
         return $this->identification;
killedBy: Tests\Feature\Core\Employee\Application\UseCases\SearchEmployee\SearchEmployeeByIdentificationRequestTest::test_employeeId_should_return_value_object
statusReason: 1) Tests\Feature\Core\Employee\Application\UseCases\SearchEmployee\SearchEmployeeByIdentificationRequestTest::test_employeeId_should_return_value_object
Error: Call to protected method Core\Employee\Application\UseCases\SearchEmployee\SearchEmployeeByIdentificationRequest::employeeIdentification() from scope Tests\Feature\Core\Employee\Application\UseCases\SearchEmployee\SearchEmployeeByIdentifica
