[Killed] MethodCallRemoval
Application/UseCases/SearchEmployee/SearchEmployees.php:23:9
      */
     public function execute(RequestService $request): ?Employees
     {
-        $this->validateRequest($request, SearchEmployeesRequest::class);
+        
 
         /** @var SearchEmployeesRequest $request */
killedBy: Tests\Feature\Core\Employee\Application\UseCases\SearchEmployee\SearchEmployeesTest::test_execute_should_return_exception
statusReason: 1) Tests\Feature\Core\Employee\Application\UseCases\SearchEmployee\SearchEmployeesTest::test_execute_should_return_exception
Failed asserting that exception of type "Error" matches expected exception "Exception". Message was: "Call to undefined method MockObject_DeleteEmployeeRequest_125ab55f::filters()" at
/var/www/abacusSystem-new/src/core/Employee/Application/UseCases/SearchEmployee/SearchEmplo
