[Killed] PublicVisibility
Application/UseCases/SearchEmployee/SearchEmployeesRequest.php:16:5
         $this->filters = $filters;
     }
 
-    public function filters(): array
+    protected function filters(): array
     {
         return $this->filters;
killedBy: Tests\Feature\Core\Employee\Application\UseCases\SearchEmployee\SearchEmployeesRequestTest::test_filters_should_return_array
statusReason: 1) Tests\Feature\Core\Employee\Application\UseCases\SearchEmployee\SearchEmployeesRequestTest::test_filters_should_return_array
Error: Call to protected method Core\Employee\Application\UseCases\SearchEmployee\SearchEmployeesRequest::filters() from scope Tests\Feature\Core\Employee\Application\UseCases\SearchEmployee\SearchEmployeesRequestTest

/var/www/abacusSystem-new/tests/Feature/Core/Employee
