[Killed] PublicVisibility
Application/UseCases/UpdateEmployee/UpdateEmployeeRequest.php:27:5
         return $this->id;
     }
 
-    public function data(): array
+    protected function data(): array
     {
         return $this->data;
killedBy: Tests\Feature\Core\Employee\Application\UseCases\UpdateEmployee\UpdateEmployeeRequestTest::test_data_should_return_array
statusReason: 1) Tests\Feature\Core\Employee\Application\UseCases\UpdateEmployee\UpdateEmployeeRequestTest::test_data_should_return_array
Error: Call to protected method Core\Employee\Application\UseCases\UpdateEmployee\UpdateEmployeeRequest::data() from scope Tests\Feature\Core\Employee\Application\UseCases\UpdateEmployee\UpdateEmployeeRequestTest

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Applicat
