[NoCoverage] ProtectedVisibility
Employee/Application/UseCases/UseCasesService.php:24:5
     /**
      * @throws Exception
      */
-    protected function validateRequest(RequestService $request, string $requestClass): RequestService
+    private function validateRequest(RequestService $request, string $requestClass): RequestService
     {
         if (! $request instanceof $requestClass) {

[NoCoverage] InstanceOf_
Employee/Application/UseCases/UseCasesService.php:26:9
      */
     protected function validateRequest(RequestService $request, string $requestClass): RequestService
     {
-        if (! $request instanceof $requestClass) {
+        if (!false) {
             throw new Exception('Request not valid');
         }

[NoCoverage] LogicalNot
Employee/Application/UseCases/UseCasesService.php:26:9
      */
     protected function validateRequest(RequestService $request, string $requestClass): RequestService
     {
-        if (! $request instanceof $requestClass) {
+        if ($request instanceof $requestClass) {
             throw new Exception('Request not valid');
         }

[NoCoverage] Throw_
Employee/Application/UseCases/UseCasesService.php:27:13
     protected function validateRequest(RequestService $request, string $requestClass): RequestService
     {
         if (! $request instanceof $requestClass) {
-            throw new Exception('Request not valid');
+            new Exception('Request not valid');
         }
 
