[Killed] PublicVisibility
core/Employee/Domain/Employee.php:88:5
         $this->image = new EmployeeImage;
     }
 
-    public function id(): EmployeeId
+    protected function id(): EmployeeId
     {
         return $this->id;
killedBy: Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setId_should_change_value_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setId_should_change_value_and_return_self
Error: Call to protected method Core\Employee\Domain\Employee::id() from scope Tests\Feature\Core\Employee\Domain\EmployeeTest

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Domain/EmployeeTest.php:82

2) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_id_should_return_value_object
Erro

[Killed] PublicVisibility
core/Employee/Domain/Employee.php:93:5
         return $this->id;
     }
 
-    public function setId(EmployeeId $id): self
+    protected function setId(EmployeeId $id): self
     {
         $this->id = $id;
killedBy: Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setId_should_change_value_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setId_should_change_value_and_return_self
Error: Call to protected method Core\Employee\Domain\Employee::setId() from scope Tests\Feature\Core\Employee\Domain\EmployeeTest

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Domain/EmployeeTest.php:78

ERRORS!
Tests: 33, Assertions: 70, Errors: 1.

[Killed] PublicVisibility
core/Employee/Domain/Employee.php:100:5
         return $this;
     }
 
-    public function identification(): EmployeeIdentification
+    protected function identification(): EmployeeIdentification
     {
         return $this->identification;
killedBy: Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setIdentification_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setIdentification_should_change_and_return_self
Error: Call to protected method Core\Employee\Domain\Employee::identification() from scope Tests\Feature\Core\Employee\Domain\EmployeeTest

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Domain/EmployeeTest.php:101

2) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_identification_

[Killed] PublicVisibility
core/Employee/Domain/Employee.php:105:5
         return $this->identification;
     }
 
-    public function setIdentification(EmployeeIdentification $identification): self
+    protected function setIdentification(EmployeeIdentification $identification): self
     {
         $this->identification = $identification;
killedBy: Tests\Feature\Core\Employee\Domain\EmployeeTest::test_refreshSearch_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_refreshSearch_should_change_and_return_self
Error: Call to protected method Core\Employee\Domain\Employee::setIdentification() from scope Tests\Feature\Core\Employee\Domain\EmployeeTest

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Domain/EmployeeTest.php:379

2) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setIdentificatio

[Killed] PublicVisibility
core/Employee/Domain/Employee.php:112:5
         return $this;
     }
 
-    public function name(): EmployeeName
+    protected function name(): EmployeeName
     {
         return $this->name;
killedBy: Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setName_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setName_should_change_and_return_self
Error: Call to protected method Core\Employee\Domain\Employee::name() from scope Tests\Feature\Core\Employee\Domain\EmployeeTest

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Domain/EmployeeTest.php:120

2) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_name_should_return_value_object
Err

[Killed] PublicVisibility
core/Employee/Domain/Employee.php:117:5
         return $this->name;
     }
 
-    public function setName(EmployeeName $name): self
+    protected function setName(EmployeeName $name): self
     {
         $this->name = $name;
killedBy: Tests\Feature\Core\Employee\Domain\EmployeeTest::test_refreshSearch_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_refreshSearch_should_change_and_return_self
Error: Call to protected method Core\Employee\Domain\Employee::setName() from scope Tests\Feature\Core\Employee\Domain\EmployeeTest

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Domain/EmployeeTest.php:385

2) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setName_should_change_and_

[Killed] PublicVisibility
core/Employee/Domain/Employee.php:124:5
         return $this;
     }
 
-    public function lastname(): EmployeeLastname
+    protected function lastname(): EmployeeLastname
     {
         return $this->lastname;
killedBy: Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setLastname_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setLastname_should_change_and_return_self
Error: Call to protected method Core\Employee\Domain\Employee::lastname() from scope Tests\Feature\Core\Employee\Domain\EmployeeTest

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Domain/EmployeeTest.php:139

2) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_lastname_should_return_valu

[Killed] PublicVisibility
core/Employee/Domain/Employee.php:129:5
         return $this->lastname;
     }
 
-    public function setLastname(EmployeeLastname $lastname): self
+    protected function setLastname(EmployeeLastname $lastname): self
     {
         $this->lastname = $lastname;
killedBy: Tests\Feature\Core\Employee\Domain\EmployeeTest::test_refreshSearch_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_refreshSearch_should_change_and_return_self
Error: Call to protected method Core\Employee\Domain\Employee::setLastname() from scope Tests\Feature\Core\Employee\Domain\EmployeeTest

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Domain/EmployeeTest.php:391

2) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setLastname_should_cha

[Killed] PublicVisibility
core/Employee/Domain/Employee.php:136:5
         return $this;
     }
 
-    public function phone(): EmployeePhone
+    protected function phone(): EmployeePhone
     {
         return $this->phone;
killedBy: Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setPhone_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setPhone_should_change_and_return_self
Error: Call to protected method Core\Employee\Domain\Employee::phone() from scope Tests\Feature\Core\Employee\Domain\EmployeeTest

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Domain/EmployeeTest.php:158

2) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_phone_should_return_value_object

[Killed] PublicVisibility
core/Employee/Domain/Employee.php:141:5
         return $this->phone;
     }
 
-    public function setPhone(EmployeePhone $phone): self
+    protected function setPhone(EmployeePhone $phone): self
     {
         $this->phone = $phone;
killedBy: Tests\Feature\Core\Employee\Domain\EmployeeTest::test_refreshSearch_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_refreshSearch_should_change_and_return_self
Error: Call to protected method Core\Employee\Domain\Employee::setPhone() from scope Tests\Feature\Core\Employee\Domain\EmployeeTest

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Domain/EmployeeTest.php:397

2) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setPhone_should_change_an

[Killed] PublicVisibility
core/Employee/Domain/Employee.php:148:5
         return $this;
     }
 
-    public function email(): EmployeeEmail
+    protected function email(): EmployeeEmail
     {
         return $this->email;
killedBy: Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setEmail_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setEmail_should_change_and_return_self
Error: Call to protected method Core\Employee\Domain\Employee::email() from scope Tests\Feature\Core\Employee\Domain\EmployeeTest

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Domain/EmployeeTest.php:177

2) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_email_should_return_value_object

[Killed] PublicVisibility
core/Employee/Domain/Employee.php:153:5
         return $this->email;
     }
 
-    public function setEmail(EmployeeEmail $email): self
+    protected function setEmail(EmployeeEmail $email): self
     {
         $this->email = $email;
killedBy: Tests\Feature\Core\Employee\Domain\EmployeeTest::test_refreshSearch_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_refreshSearch_should_change_and_return_self
Error: Call to protected method Core\Employee\Domain\Employee::setEmail() from scope Tests\Feature\Core\Employee\Domain\EmployeeTest

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Domain/EmployeeTest.php:403

2) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setEmail_should_change_an

[Killed] PublicVisibility
core/Employee/Domain/Employee.php:160:5
         return $this;
     }
 
-    public function address(): EmployeeAddress
+    protected function address(): EmployeeAddress
     {
         return $this->address;
killedBy: Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setAddress_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setAddress_should_change_and_return_self
Error: Call to protected method Core\Employee\Domain\Employee::address() from scope Tests\Feature\Core\Employee\Domain\EmployeeTest

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Domain/EmployeeTest.php:196

2) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_address_should_return_value_o

[Killed] PublicVisibility
core/Employee/Domain/Employee.php:165:5
         return $this->address;
     }
 
-    public function setAddress(EmployeeAddress $address): self
+    protected function setAddress(EmployeeAddress $address): self
     {
         $this->address = $address;
killedBy: Tests\Feature\Core\Employee\Domain\EmployeeTest::test_refreshSearch_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_refreshSearch_should_change_and_return_self
Error: Call to protected method Core\Employee\Domain\Employee::setAddress() from scope Tests\Feature\Core\Employee\Domain\EmployeeTest

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Domain/EmployeeTest.php:409

2) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setAddress_should_chang

[Killed] PublicVisibility
core/Employee/Domain/Employee.php:172:5
         return $this;
     }
 
-    public function state(): EmployeeState
+    protected function state(): EmployeeState
     {
         return $this->state;
killedBy: Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setState_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setState_should_change_and_return_self
Error: Call to protected method Core\Employee\Domain\Employee::state() from scope Tests\Feature\Core\Employee\Domain\EmployeeTest

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Domain/EmployeeTest.php:215

2) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_state_should_return_value_object

[Killed] PublicVisibility
core/Employee/Domain/Employee.php:177:5
         return $this->state;
     }
 
-    public function setState(EmployeeState $state): self
+    protected function setState(EmployeeState $state): self
     {
         $this->state = $state;
killedBy: Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setState_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setState_should_change_and_return_self
Error: Call to protected method Core\Employee\Domain\Employee::setState() from scope Tests\Feature\Core\Employee\Domain\EmployeeTest

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Domain/EmployeeTest.php:211

ERRORS!
Tests: 33, Assertions: 70, Errors: 1.

[Killed] PublicVisibility
core/Employee/Domain/Employee.php:184:5
         return $this;
     }
 
-    public function createdAt(): EmployeeCreatedAt
+    protected function createdAt(): EmployeeCreatedAt
     {
         return $this->createdAt;
killedBy: Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setCreatedAt_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setCreatedAt_should_change_and_return_self
Error: Call to protected method Core\Employee\Domain\Employee::createdAt() from scope Tests\Feature\Core\Employee\Domain\EmployeeTest

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Domain/EmployeeTest.php:234

2) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_createdAt_should_return_v

[Killed] PublicVisibility
core/Employee/Domain/Employee.php:189:5
         return $this->createdAt;
     }
 
-    public function setCreatedAt(EmployeeCreatedAt $createdAt): self
+    protected function setCreatedAt(EmployeeCreatedAt $createdAt): self
     {
         $this->createdAt = $createdAt;
killedBy: Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setCreatedAt_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setCreatedAt_should_change_and_return_self
Error: Call to protected method Core\Employee\Domain\Employee::setCreatedAt() from scope Tests\Feature\Core\Employee\Domain\EmployeeTest

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Domain/EmployeeTest.php:230

ERRORS!
Tests: 33, Assertions: 70, Errors: 1.

[Killed] PublicVisibility
core/Employee/Domain/Employee.php:196:5
         return $this;
     }
 
-    public function updatedAt(): EmployeeUpdateAt
+    protected function updatedAt(): EmployeeUpdateAt
     {
         return $this->updateAt;
killedBy: Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setUpdatedAt_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setUpdatedAt_should_change_and_return_self
Error: Call to protected method Core\Employee\Domain\Employee::updatedAt() from scope Tests\Feature\Core\Employee\Domain\EmployeeTest

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Domain/EmployeeTest.php:253

2) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_updateAt_should_return_va

[Killed] PublicVisibility
core/Employee/Domain/Employee.php:201:5
         return $this->updateAt;
     }
 
-    public function setUpdatedAt(EmployeeUpdateAt $updateAt): self
+    protected function setUpdatedAt(EmployeeUpdateAt $updateAt): self
     {
         $this->updateAt = $updateAt;
killedBy: Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setUpdatedAt_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setUpdatedAt_should_change_and_return_self
Error: Call to protected method Core\Employee\Domain\Employee::setUpdatedAt() from scope Tests\Feature\Core\Employee\Domain\EmployeeTest

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Domain/EmployeeTest.php:249

ERRORS!
Tests: 33, Assertions: 70, Errors: 1.

[Killed] PublicVisibility
core/Employee/Domain/Employee.php:208:5
         return $this;
     }
 
-    public function userId(): EmployeeUserId
+    protected function userId(): EmployeeUserId
     {
         return $this->userId;
killedBy: Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setUserId_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setUserId_should_change_and_return_self
Error: Call to protected method Core\Employee\Domain\Employee::userId() from scope Tests\Feature\Core\Employee\Domain\EmployeeTest

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Domain/EmployeeTest.php:272

2) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_userId_should_return_value_obje

[Killed] PublicVisibility
core/Employee/Domain/Employee.php:213:5
         return $this->userId;
     }
 
-    public function setUserId(EmployeeUserId $id): self
+    protected function setUserId(EmployeeUserId $id): self
     {
         $this->userId = $id;
killedBy: Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setUserId_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setUserId_should_change_and_return_self
Error: Call to protected method Core\Employee\Domain\Employee::setUserId() from scope Tests\Feature\Core\Employee\Domain\EmployeeTest

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Domain/EmployeeTest.php:268

ERRORS!
Tests: 33, Assertions: 70, Errors: 1.

[Killed] PublicVisibility
core/Employee/Domain/Employee.php:220:5
         return $this;
     }
 
-    public function search(): EmployeeSearch
+    protected function search(): EmployeeSearch
     {
         return $this->search;
killedBy: Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setSearch_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setSearch_should_change_and_return_self
Error: Call to protected method Core\Employee\Domain\Employee::search() from scope Tests\Feature\Core\Employee\Domain\EmployeeTest

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Domain/EmployeeTest.php:291

2) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_search_should_return_value_obje

[Killed] PublicVisibility
core/Employee/Domain/Employee.php:225:5
         return $this->search;
     }
 
-    public function setSearch(EmployeeSearch $search): self
+    protected function setSearch(EmployeeSearch $search): self
     {
         $this->search = $search;
killedBy: Tests\Feature\Core\Employee\Domain\EmployeeTest::test_refreshSearch_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_refreshSearch_should_change_and_return_self
Error: Call to protected method Core\Employee\Domain\Employee::setSearch() from scope Tests\Feature\Core\Employee\Domain\EmployeeTest

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Domain/EmployeeTest.php:423

2) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setSearch_should_change_

[Killed] PublicVisibility
core/Employee/Domain/Employee.php:235:5
     /**
      * @return $this
      */
-    public function refreshSearch(): self
+    protected function refreshSearch(): self
     {
         $data = [
killedBy: Tests\Feature\Core\Employee\Domain\EmployeeTest::test_refreshSearch_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_refreshSearch_should_change_and_return_self
Error: Call to protected method Core\Employee\Domain\Employee::refreshSearch() from scope Tests\Feature\Core\Employee\Domain\EmployeeTest

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Domain/EmployeeTest.php:425

ERRORS!
Tests: 33, Assertions: 64, Errors: 1.

[Killed] MethodCallRemoval
core/Employee/Domain/Employee.php:247:9
             $this->observations->value(),
         ];
 
-        $this->search->setValue(implode(' ', $data));
+        
 
         return $this;
killedBy: Tests\Feature\Core\Employee\Domain\EmployeeTest::test_refreshSearch_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_refreshSearch_should_change_and_return_self
Expectation failed for method name is "setValue" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 9, Failures: 1.

[Killed] PublicVisibility
core/Employee/Domain/Employee.php:252:5
         return $this;
     }
 
-    public function birthdate(): EmployeeBirthdate
+    protected function birthdate(): EmployeeBirthdate
     {
         return $this->birthdate;
killedBy: Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setBirthdate_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setBirthdate_should_change_and_return_self
Error: Call to protected method Core\Employee\Domain\Employee::birthdate() from scope Tests\Feature\Core\Employee\Domain\EmployeeTest

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Domain/EmployeeTest.php:310

2) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_birthdate_should_return_v

[Killed] PublicVisibility
core/Employee/Domain/Employee.php:257:5
         return $this->birthdate;
     }
 
-    public function setBirthdate(EmployeeBirthdate $date): self
+    protected function setBirthdate(EmployeeBirthdate $date): self
     {
         $this->birthdate = $date;
killedBy: Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setBirthdate_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setBirthdate_should_change_and_return_self
Error: Call to protected method Core\Employee\Domain\Employee::setBirthdate() from scope Tests\Feature\Core\Employee\Domain\EmployeeTest

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Domain/EmployeeTest.php:306

ERRORS!
Tests: 33, Assertions: 70, Errors: 1.

[Killed] PublicVisibility
core/Employee/Domain/Employee.php:264:5
         return $this;
     }
 
-    public function observations(): EmployeeObservations
+    protected function observations(): EmployeeObservations
     {
         return $this->observations;
killedBy: Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setObservations_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setObservations_should_change_and_return_self
Error: Call to protected method Core\Employee\Domain\Employee::observations() from scope Tests\Feature\Core\Employee\Domain\EmployeeTest

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Domain/EmployeeTest.php:367

2) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_observations_should

[Killed] PublicVisibility
core/Employee/Domain/Employee.php:269:5
         return $this->observations;
     }
 
-    public function setObservations(EmployeeObservations $observations): self
+    protected function setObservations(EmployeeObservations $observations): self
     {
         $this->observations = $observations;
killedBy: Tests\Feature\Core\Employee\Domain\EmployeeTest::test_refreshSearch_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_refreshSearch_should_change_and_return_self
Error: Call to protected method Core\Employee\Domain\Employee::setObservations() from scope Tests\Feature\Core\Employee\Domain\EmployeeTest

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Domain/EmployeeTest.php:415

2) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setObservations_sh

[Killed] PublicVisibility
core/Employee/Domain/Employee.php:276:5
         return $this;
     }
 
-    public function identificationType(): EmployeeIdentificationType
+    protected function identificationType(): EmployeeIdentificationType
     {
         return $this->identificationType;
killedBy: Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setIdentificationType_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setIdentificationType_should_change_and_return_self
Error: Call to protected method Core\Employee\Domain\Employee::identificationType() from scope Tests\Feature\Core\Employee\Domain\EmployeeTest

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Domain/EmployeeTest.php:329

2) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_identif

[Killed] PublicVisibility
core/Employee/Domain/Employee.php:281:5
         return $this->identificationType;
     }
 
-    public function setIdentificationType(EmployeeIdentificationType $type): self
+    protected function setIdentificationType(EmployeeIdentificationType $type): self
     {
         $this->identificationType = $type;
killedBy: Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setIdentificationType_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setIdentificationType_should_change_and_return_self
Error: Call to protected method Core\Employee\Domain\Employee::setIdentificationType() from scope Tests\Feature\Core\Employee\Domain\EmployeeTest

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Domain/EmployeeTest.php:325

ERRORS!
Tests: 33, Assertions: 70, Errors: 1.

[Killed] PublicVisibility
core/Employee/Domain/Employee.php:288:5
         return $this;
     }
 
-    public function image(): EmployeeImage
+    protected function image(): EmployeeImage
     {
         return $this->image;
killedBy: Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setImage_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setImage_should_change_and_return_self
Error: Call to protected method Core\Employee\Domain\Employee::image() from scope Tests\Feature\Core\Employee\Domain\EmployeeTest

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Domain/EmployeeTest.php:348

2) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_image_should_return_value_object

[Killed] PublicVisibility
core/Employee/Domain/Employee.php:293:5
         return $this->image;
     }
 
-    public function setImage(EmployeeImage $image): self
+    protected function setImage(EmployeeImage $image): self
     {
         $this->image = $image;
killedBy: Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setImage_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Domain\EmployeeTest::test_setImage_should_change_and_return_self
Error: Call to protected method Core\Employee\Domain\Employee::setImage() from scope Tests\Feature\Core\Employee\Domain\EmployeeTest

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Domain/EmployeeTest.php:344

ERRORS!
Tests: 33, Assertions: 70, Errors: 1.
