[Survived] Foreach_
core/Employee/Domain/Employees.php:13:9
 
     public function __construct(Employee ...$employees)
     {
-        foreach ($employees as $employee) {
-            $this->addItem($employee);
-        }
+        foreach ([] as $employee) {
     }
 

[Survived] MethodCallRemoval
core/Employee/Domain/Employees.php:14:13
     public function __construct(Employee ...$employees)
     {
         foreach ($employees as $employee) {
-            $this->addItem($employee);
+            
         }
     }
