[Killed] PublicVisibility
Employee/Domain/ValueObjects/EmployeeBirthdate.php:22:5
         return $this->value;
     }
 
-    public function toString(): ?string
+    protected function toString(): ?string
     {
         return ($this->value) ? $this->value->format('d/m/Y') : null;
killedBy: Tests\Feature\Core\Employee\Domain\ValueObjects\EmployeeBirthdateTest::test_value_should_return_date_toString
statusReason: 1) Tests\Feature\Core\Employee\Domain\ValueObjects\EmployeeBirthdateTest::test_value_should_return_date_toString
Error: Call to protected method Core\Employee\Domain\ValueObjects\EmployeeBirthdate::toString() from scope Tests\Feature\Core\Employee\Domain\ValueObjects\EmployeeBirthdateTest

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Domain/ValueObjects/EmployeeBirthdateTest.php:48

ERROR

[Killed] Ternary
Employee/Domain/ValueObjects/EmployeeBirthdate.php:24:9
 
     public function toString(): ?string
     {
-        return ($this->value) ? $this->value->format('d/m/Y') : null;
+        return $this->value ? null : $this->value->format('d/m/Y');
     }
 
killedBy: Tests\Feature\Core\Employee\Domain\ValueObjects\EmployeeBirthdateTest::test_value_should_return_date_toString
statusReason: 1) Tests\Feature\Core\Employee\Domain\ValueObjects\EmployeeBirthdateTest::test_value_should_return_date_toString
Failed asserting that null is not null.

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Domain/ValueObjects/EmployeeBirthdateTest.php:50

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
