[Killed] LogicalNot
Employee/Domain/ValueObjects/EmployeeEmail.php:14:9
 
     public function __construct(?string $value = null)
     {
-        if (! is_null($value)) {
+        if (is_null($value)) {
             $this->validate($value);
         }
killedBy: Tests\Feature\Core\Employee\Domain\ValueObjects\EmployeeEmailTest::test_value_should_return_null
statusReason: 1) Tests\Feature\Core\Employee\Domain\ValueObjects\EmployeeEmailTest::test_value_should_return_null
TypeError: Core\Employee\Domain\ValueObjects\EmployeeEmail::validate(): Argument #1 ($value) must be of type string, null given, called in /var/www/abacusSystem-new/src/core/Employee/Domain/ValueObjects/EmployeeEmail.php on line 13

/var/www/abacusSystem-new/src/core/Employee/Domain/ValueObjects/Emp

[Survived] MethodCallRemoval
Employee/Domain/ValueObjects/EmployeeEmail.php:15:13
     public function __construct(?string $value = null)
     {
         if (! is_null($value)) {
-            $this->validate($value);
+            
         }
         $this->value = $value;

[Killed] MethodCallRemoval
Employee/Domain/ValueObjects/EmployeeEmail.php:31:9
      */
     public function setValue($value): self
     {
-        $this->validate($value);
+        
         $this->value = $value;
 
killedBy: Tests\Feature\Core\Employee\Domain\ValueObjects\EmployeeEmailTest::test_setValue_should_exception
statusReason: 1) Tests\Feature\Core\Employee\Domain\ValueObjects\EmployeeEmailTest::test_setValue_should_exception
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] LogicalNot
Employee/Domain/ValueObjects/EmployeeEmail.php:39:9
 
     private function validate(string $value): void
     {
-        if (! filter_var($value, FILTER_VALIDATE_EMAIL)) {
+        if (filter_var($value, FILTER_VALIDATE_EMAIL)) {
             throw new InvalidArgumentException(
                 sprintf('<%s> does not allow the invalid email: <%s>.', static::class, $value)
killedBy: Tests\Feature\Core\Employee\Domain\ValueObjects\EmployeeEmailTest::test_setValue_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Domain\ValueObjects\EmployeeEmailTest::test_setValue_should_exception
Failed asserting that exception of type "InvalidArgumentException" is thrown.

ERRORS!
Tests: 3, Assertions: 1, Errors: 2, Failures: 1.

[Killed] Throw_
Employee/Domain/ValueObjects/EmployeeEmail.php:40:13
     private function validate(string $value): void
     {
         if (! filter_var($value, FILTER_VALIDATE_EMAIL)) {
-            throw new InvalidArgumentException(
-                sprintf('<%s> does not allow the invalid email: <%s>.', static::class, $value)
-            );
+            new InvalidArgumentException(sprintf('<%s> does not allow the invalid email: <%s>.', static::class, $value));
         }
     }
killedBy: Tests\Feature\Core\Employee\Domain\ValueObjects\EmployeeEmailTest::test_setValue_should_exception
statusReason: 1) Tests\Feature\Core\Employee\Domain\ValueObjects\EmployeeEmailTest::test_setValue_should_exception
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
