[Survived] ArrayItemRemoval
Employee/Domain/ValueObjects/EmployeeId.php:40:13
     private function validate(int $value): void
     {
         $options = [
-            'options' => [
-                'min_range' => 1,
-            ],
+            $options = ['options' => []];
         ];
 

[Survived] DecrementInteger
Employee/Domain/ValueObjects/EmployeeId.php:41:17
     {
         $options = [
             'options' => [
-                'min_range' => 1,
+                $options = ['options' => ['min_range' => 0]];
             ],
         ];

[Survived] IncrementInteger
Employee/Domain/ValueObjects/EmployeeId.php:41:17
     {
         $options = [
             'options' => [
-                'min_range' => 1,
+                $options = ['options' => ['min_range' => 2]];
             ],
         ];

[Killed] LogicalNot
Employee/Domain/ValueObjects/EmployeeId.php:45:9
             ],
         ];
 
-        if (! filter_var($value, FILTER_VALIDATE_INT, $options)) {
+        if (filter_var($value, FILTER_VALIDATE_INT, $options)) {
             throw new InvalidArgumentException(
                 sprintf('<%s> does not allow the value <%s>.', static::class, $value)
killedBy: Tests\Feature\Core\Employee\Domain\ValueObjects\EmployeeIdTest::test_setValue_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Domain\ValueObjects\EmployeeIdTest::test_setValue_should_return_exception
Failed asserting that exception of type "InvalidArgumentException" is thrown.

ERRORS!
Tests: 3, Assertions: 1, Errors: 2, Failures: 1.

[Killed] Throw_
Employee/Domain/ValueObjects/EmployeeId.php:46:13
         ];
 
         if (! filter_var($value, FILTER_VALIDATE_INT, $options)) {
-            throw new InvalidArgumentException(
-                sprintf('<%s> does not allow the value <%s>.', static::class, $value)
-            );
+            new InvalidArgumentException(sprintf('<%s> does not allow the value <%s>.', static::class, $value));
         }
     }
killedBy: Tests\Feature\Core\Employee\Domain\ValueObjects\EmployeeIdTest::test_setValue_should_return_exception
statusReason: 1) Tests\Feature\Core\Employee\Domain\ValueObjects\EmployeeIdTest::test_setValue_should_return_exception
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
