[Killed] MethodCallRemoval
Employee/Domain/ValueObjects/EmployeeState.php:11:9
 {
     public function __construct(int $value = self::STATE_NEW)
     {
-        parent::__construct($value);
+        
     }
 }
killedBy: Tests\Feature\Core\Employee\Domain\ValueObjects\EmployeeStateTest::test_getValueLiteral_should_return_string
statusReason: 1) Tests\Feature\Core\Employee\Domain\ValueObjects\EmployeeStateTest::test_getValueLiteral_should_return_string
Error: Typed property Core\SharedContext\Model\ValueObjectStatus::$valueLiteral must not be accessed before initialization

/var/www/abacusSystem-new/src/core/SharedContext/Model/ValueObjectStatus.php:80
/var/www/abacusSystem-new/tests/Feature/Core/Employee/Domain/ValueObjects/EmployeeSt
