[Killed] Foreach_
Employee/Infrastructure/Commands/EmployeeWarmup.php:34:9
         $this->employeeFactory = $employeeFactory;
         $this->readRepository = $readRepository;
 
-        foreach ($repositories as $repository) {
-            $this->repositories[] = $repository;
-        }
+        foreach ([] as $repository) {
     }
 
killedBy: Tests\Feature\Core\Employee\Infrastructure\Commands\EmployeeWarmupTest::test_handle_should_update_employee_in_repositories
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Commands\EmployeeWarmupTest::test_handle_should_update_employee_in_repositories
Error: Typed property Core\Employee\Infrastructure\Commands\EmployeeWarmup::$repositories must not be accessed before initialization

/var/www/abacusSystem-new/src/core/Employee/Infrastructure/Commands/EmployeeWarmup.php:49
/var/www/abacusSystem-new/tests/Feature/Core/Emplo

[Killed] PublicVisibility
Employee/Infrastructure/Commands/EmployeeWarmup.php:57:5
     /**
      * Execute the console command.
      */
-    public function handle(): int
+    protected function handle(): int
     {
         $employeeId = $this->employeeFactory->buildEmployeeId($this->argument('id'));
killedBy: Tests\Feature\Core\Employee\Infrastructure\Commands\EmployeeWarmupTest::test_handle_should_return_exception
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Commands\EmployeeWarmupTest::test_handle_should_return_exception
BadMethodCallException: Method Core\Employee\Infrastructure\Commands\EmployeeWarmup::handle does not exist.

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Macroable/Traits/Macroable.php:115
/var/www/abacusSystem-new/tests/Feature/Core/Employee/Infrastructure/Commands/E

[Killed] Foreach_
Employee/Infrastructure/Commands/EmployeeWarmup.php:64:13
         try {
             $employee = $this->readRepository->find($employeeId);
 
-            foreach ($this->repositories as $repository) {
-                $repository->persistEmployee($employee);
-            }
+            foreach ([] as $repository) {
         } catch (Exception $exception) {
             $this->logger->error($exception->getMessage(), $exception->getTrace());
killedBy: Tests\Feature\Core\Employee\Infrastructure\Commands\EmployeeWarmupTest::test_handle_should_update_employee_in_repositories
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Commands\EmployeeWarmupTest::test_handle_should_update_employee_in_repositories
Expectation failed for method name is "persistEmployee" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 6, Failures: 1.

[Killed] MethodCallRemoval
Employee/Infrastructure/Commands/EmployeeWarmup.php:65:17
             $employee = $this->readRepository->find($employeeId);
 
             foreach ($this->repositories as $repository) {
-                $repository->persistEmployee($employee);
+                
             }
         } catch (Exception $exception) {
killedBy: Tests\Feature\Core\Employee\Infrastructure\Commands\EmployeeWarmupTest::test_handle_should_update_employee_in_repositories
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Commands\EmployeeWarmupTest::test_handle_should_update_employee_in_repositories
Expectation failed for method name is "persistEmployee" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 6, Failures: 1.

[Killed] MethodCallRemoval
Employee/Infrastructure/Commands/EmployeeWarmup.php:73:9
             return CommandSymfony::FAILURE;
         }
 
-        $this->logger->info('Employee command executed');
+        
 
         return CommandSymfony::SUCCESS;
killedBy: Tests\Feature\Core\Employee\Infrastructure\Commands\EmployeeWarmupTest::test_handle_should_update_employee_in_repositories
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Commands\EmployeeWarmupTest::test_handle_should_update_employee_in_repositories
Expectation failed for method name is "info" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.
