[Killed] Foreach_
Employee/Infrastructure/Management/EmployeeService.php:83:9
         $request = new SearchEmployeesRequest($filters);
         $employees = $this->searchEmployees->execute($request);
 
-        foreach ($employees->aggregator() as $item) {
-            $employee = $this->searchEmployeeById($item);
-            $employees->addItem($employee);
-        }
+        foreach ([] as $item) {
 
         return $employees;
killedBy: Tests\Feature\Core\Employee\Infrastructure\Management\EmployeeServiceTest::test_searchEmployees_should_return_employees
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Management\EmployeeServiceTest::test_searchEmployees_should_return_employees
Expectation failed for method name is "execute" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] MethodCallRemoval
Employee/Infrastructure/Management/EmployeeService.php:85:13
 
         foreach ($employees->aggregator() as $item) {
             $employee = $this->searchEmployeeById($item);
-            $employees->addItem($employee);
+            
         }
 
killedBy: Tests\Feature\Core\Employee\Infrastructure\Management\EmployeeServiceTest::test_searchEmployees_should_return_employees
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Management\EmployeeServiceTest::test_searchEmployees_should_return_employees
Expectation failed for method name is "addItem" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] MethodCallRemoval
Employee/Infrastructure/Management/EmployeeService.php:122:9
             $this->employeeFactory->buildEmployeeId($id)
         );
 
-        $this->deleteEmployee->execute($request);
+        
     }
 }
killedBy: Tests\Feature\Core\Employee\Infrastructure\Management\EmployeeServiceTest::test_deleteEmployee_should_return_void
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Management\EmployeeServiceTest::test_deleteEmployee_should_return_void
Expectation failed for method name is "execute" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.
