[Killed] PublicVisibility
Persistence/Eloquent/Model/Employee.php:95:5
         ];
     }
 
-    public function getSearchField(): string
+    protected function getSearchField(): string
     {
         return $this->mainSearchField;
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_getSearchField_should_return_string
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_getSearchField_should_return_string
BadMethodCallException: Call to undefined method Core\Employee\Infrastructure\Persistence\Eloquent\Model\Employee::getSearchField()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/vendor/lara

[Killed] PublicVisibility
Persistence/Eloquent/Model/Employee.php:100:5
         return $this->mainSearchField;
     }
 
-    public function relationWithUser(): HasOne
+    protected function relationWithUser(): HasOne
     {
         return $this->hasOne(User::class, 'user__emp_id', 'emp_id');
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_relationWithUser_should_return_relation
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_relationWithUser_should_return_relation
BadMethodCallException: Call to undefined method MockObject_Employee_4e7c802a::relationWithUser()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/S

[Killed] PublicVisibility
Persistence/Eloquent/Model/Employee.php:105:5
         return $this->hasOne(User::class, 'user__emp_id', 'emp_id');
     }
 
-    public function user(): Model
+    protected function user(): Model
     {
         return $this->relationWithUser()->getModel();
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_user_should_return_model_user
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_user_should_return_model_user
BadMethodCallException: Call to undefined method Core\Employee\Infrastructure\Persistence\Eloquent\Model\Employee::user()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/vendor/laravel/framework/sr

[Killed] PublicVisibility
Persistence/Eloquent/Model/Employee.php:110:5
         return $this->relationWithUser()->getModel();
     }
 
-    public function id(): ?int
+    protected function id(): ?int
     {
         return $this->getAttribute('emp_id');
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_id_should_return_null
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_id_should_return_null
BadMethodCallException: Call to undefined method MockObject_Employee_9d2d9b29::id()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:

[Killed] PublicVisibility
Persistence/Eloquent/Model/Employee.php:115:5
         return $this->getAttribute('emp_id');
     }
 
-    public function changeId(?int $id): self
+    protected function changeId(?int $id): self
     {
         $this->setAttribute('emp_id', $id);
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeId_with_null_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeId_with_null_should_change_and_return_self
BadMethodCallException: Call to undefined method MockObject_Employee_a0157b10::changeId()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/

[Killed] MethodCallRemoval
Persistence/Eloquent/Model/Employee.php:117:9
 
     public function changeId(?int $id): self
     {
-        $this->setAttribute('emp_id', $id);
+        
 
         return $this;
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeId_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeId_should_change_and_return_self
Expectation failed for method name is "setAttribute" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] PublicVisibility
Persistence/Eloquent/Model/Employee.php:122:5
         return $this;
     }
 
-    public function identification(): ?string
+    protected function identification(): ?string
     {
         return $this->getAttribute('emp_identification');
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_identification_should_return_null
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_identification_should_return_null
BadMethodCallException: Call to undefined method MockObject_Employee_8f3dc79b::identification()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/T

[Killed] PublicVisibility
Persistence/Eloquent/Model/Employee.php:127:5
         return $this->getAttribute('emp_identification');
     }
 
-    public function changeIdentification(string $identification): self
+    protected function changeIdentification(string $identification): self
     {
         $this->setAttribute('emp_identification', $identification);
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeIdentification_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeIdentification_should_change_and_return_self
BadMethodCallException: Call to undefined method MockObject_Employee_6d7b02b6::changeIdentification()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/vendor/laravel/framework/s

[Killed] MethodCallRemoval
Persistence/Eloquent/Model/Employee.php:129:9
 
     public function changeIdentification(string $identification): self
     {
-        $this->setAttribute('emp_identification', $identification);
+        
 
         return $this;
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeIdentification_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeIdentification_should_change_and_return_self
Expectation failed for method name is "setAttribute" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] PublicVisibility
Persistence/Eloquent/Model/Employee.php:134:5
         return $this;
     }
 
-    public function name(): ?string
+    protected function name(): ?string
     {
         return $this->getAttribute('emp_name');
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_name_should_return_null
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_name_should_return_null
BadMethodCallException: Call to undefined method MockObject_Employee_81e304a6::name()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.

[Killed] PublicVisibility
Persistence/Eloquent/Model/Employee.php:139:5
         return $this->getAttribute('emp_name');
     }
 
-    public function changeName(string $name): self
+    protected function changeName(string $name): self
     {
         $this->setAttribute('emp_name', $name);
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeName_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeName_should_change_and_return_self
BadMethodCallException: Call to undefined method MockObject_Employee_2bf5bb98::changeName()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Suppor

[Killed] MethodCallRemoval
Persistence/Eloquent/Model/Employee.php:141:9
 
     public function changeName(string $name): self
     {
-        $this->setAttribute('emp_name', $name);
+        
 
         return $this;
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeName_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeName_should_change_and_return_self
Expectation failed for method name is "setAttribute" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] PublicVisibility
Persistence/Eloquent/Model/Employee.php:146:5
         return $this;
     }
 
-    public function lastname(): ?string
+    protected function lastname(): ?string
     {
         return $this->getAttribute('emp_lastname');
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_lastname_should_return_null
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_lastname_should_return_null
BadMethodCallException: Call to undefined method MockObject_Employee_80d28995::lastname()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/Forwar

[Killed] PublicVisibility
Persistence/Eloquent/Model/Employee.php:151:5
         return $this->getAttribute('emp_lastname');
     }
 
-    public function changeLastname(string $lastname): self
+    protected function changeLastname(string $lastname): self
     {
         $this->setAttribute('emp_lastname', $lastname);
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeLastname_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeLastname_should_change_and_return_self
BadMethodCallException: Call to undefined method MockObject_Employee_a476892f::changeLastname()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminat

[Killed] MethodCallRemoval
Persistence/Eloquent/Model/Employee.php:153:9
 
     public function changeLastname(string $lastname): self
     {
-        $this->setAttribute('emp_lastname', $lastname);
+        
 
         return $this;
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeLastname_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeLastname_should_change_and_return_self
Expectation failed for method name is "setAttribute" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] PublicVisibility
Persistence/Eloquent/Model/Employee.php:158:5
         return $this;
     }
 
-    public function phone(): ?string
+    protected function phone(): ?string
     {
         return $this->getAttribute('emp_phone_number');
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_phone_should_return_null
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_phone_should_return_null
BadMethodCallException: Call to undefined method MockObject_Employee_15ac3975::phone()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCall

[Killed] PublicVisibility
Persistence/Eloquent/Model/Employee.php:163:5
         return $this->getAttribute('emp_phone_number');
     }
 
-    public function changePhone(string $phone): self
+    protected function changePhone(string $phone): self
     {
         $this->setAttribute('emp_phone_number', $phone);
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changePhone_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changePhone_should_change_and_return_self
BadMethodCallException: Call to undefined method MockObject_Employee_3f0fddad::changePhone()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Supp

[Killed] MethodCallRemoval
Persistence/Eloquent/Model/Employee.php:165:9
 
     public function changePhone(string $phone): self
     {
-        $this->setAttribute('emp_phone_number', $phone);
+        
 
         return $this;
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changePhone_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changePhone_should_change_and_return_self
Expectation failed for method name is "setAttribute" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] PublicVisibility
Persistence/Eloquent/Model/Employee.php:170:5
         return $this;
     }
 
-    public function email(): ?string
+    protected function email(): ?string
     {
         return $this->getAttribute('emp_email');
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_email_should_return_null
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_email_should_return_null
BadMethodCallException: Call to undefined method MockObject_Employee_0ce4ebad::email()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCall

[Killed] PublicVisibility
Persistence/Eloquent/Model/Employee.php:175:5
         return $this->getAttribute('emp_email');
     }
 
-    public function changeEmail(string $email): self
+    protected function changeEmail(string $email): self
     {
         $this->setAttribute('emp_email', $email);
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeEmail_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeEmail_should_change_and_return_self
BadMethodCallException: Call to undefined method MockObject_Employee_c2c603dd::changeEmail()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Supp

[Killed] MethodCallRemoval
Persistence/Eloquent/Model/Employee.php:177:9
 
     public function changeEmail(string $email): self
     {
-        $this->setAttribute('emp_email', $email);
+        
 
         return $this;
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeEmail_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeEmail_should_change_and_return_self
Expectation failed for method name is "setAttribute" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] PublicVisibility
Persistence/Eloquent/Model/Employee.php:182:5
         return $this;
     }
 
-    public function address(): ?string
+    protected function address(): ?string
     {
         return $this->getAttribute('emp_address');
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_address_should_return_null
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_address_should_return_null
BadMethodCallException: Call to undefined method MockObject_Employee_4042adfa::address()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/Forwards

[Killed] PublicVisibility
Persistence/Eloquent/Model/Employee.php:187:5
         return $this->getAttribute('emp_address');
     }
 
-    public function changeAddress(?string $address): self
+    protected function changeAddress(?string $address): self
     {
         $this->setAttribute('emp_address', $address);
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeAddress_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeAddress_should_change_and_return_self
BadMethodCallException: Call to undefined method MockObject_Employee_3a8f246a::changeAddress()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/

[Killed] MethodCallRemoval
Persistence/Eloquent/Model/Employee.php:189:9
 
     public function changeAddress(?string $address): self
     {
-        $this->setAttribute('emp_address', $address);
+        
 
         return $this;
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeAddress_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeAddress_should_change_and_return_self
Expectation failed for method name is "setAttribute" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] PublicVisibility
Persistence/Eloquent/Model/Employee.php:194:5
         return $this;
     }
 
-    public function state(): int
+    protected function state(): int
     {
         return $this->getAttribute('emp_state');
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_state_should_return_int
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_state_should_return_int
BadMethodCallException: Call to undefined method MockObject_Employee_63149085::state()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls

[Killed] PublicVisibility
Persistence/Eloquent/Model/Employee.php:199:5
         return $this->getAttribute('emp_state');
     }
 
-    public function changeState(int $state): self
+    protected function changeState(int $state): self
     {
         $this->setAttribute('emp_state', $state);
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeState_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeState_should_change_and_return_self
BadMethodCallException: Call to undefined method MockObject_Employee_9198d4e3::changeState()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Supp

[Killed] MethodCallRemoval
Persistence/Eloquent/Model/Employee.php:201:9
 
     public function changeState(int $state): self
     {
-        $this->setAttribute('emp_state', $state);
+        
 
         return $this;
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeState_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeState_should_change_and_return_self
Expectation failed for method name is "setAttribute" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] PublicVisibility
Persistence/Eloquent/Model/Employee.php:209:5
     /**
      * @throws Exception
      */
-    public function createdAt(): ?DateTime
+    protected function createdAt(): ?DateTime
     {
         $datetime = $this->getAttribute('created_at');
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_createdAt_should_return_null
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_createdAt_should_return_null
BadMethodCallException: Call to undefined method MockObject_Employee_fc807613::createdAt()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/Forw

[Killed] Ternary
Persistence/Eloquent/Model/Employee.php:213:9
     {
         $datetime = $this->getAttribute('created_at');
 
-        return ($datetime) ? $this->getDateTime($datetime) : $datetime;
+        return $datetime ? $datetime : $this->getDateTime($datetime);
     }
 
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_createdAt_should_return_string
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_createdAt_should_return_null
Failed asserting that DateTime Object #1698 (
    'date' => '2024-06-12 11:23:48.767031',
    'timezone_type' => 3,
    'timezone' => 'UTC',
) is null.

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Infrastructure/Persistence/Eloquent/Model/EmployeeTest.php:505

[Killed] PublicVisibility
Persistence/Eloquent/Model/Employee.php:216:5
         return ($datetime) ? $this->getDateTime($datetime) : $datetime;
     }
 
-    public function changeCreatedAt(?DateTime $datetime): self
+    protected function changeCreatedAt(?DateTime $datetime): self
     {
         $this->setAttribute('created_at', $datetime);
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeCreatedAt_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeCreatedAt_should_change_and_return_self
BadMethodCallException: Call to undefined method MockObject_Employee_2c9fdfa3::changeCreatedAt()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/vendor/laravel/framework/src/Illumin

[Killed] MethodCallRemoval
Persistence/Eloquent/Model/Employee.php:218:9
 
     public function changeCreatedAt(?DateTime $datetime): self
     {
-        $this->setAttribute('created_at', $datetime);
+        
 
         return $this;
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeCreatedAt_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeCreatedAt_should_change_and_return_self
Expectation failed for method name is "setAttribute" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] PublicVisibility
Persistence/Eloquent/Model/Employee.php:226:5
     /**
      * @throws Exception
      */
-    public function updatedAt(): ?DateTime
+    protected function updatedAt(): ?DateTime
     {
         $datetime = $this->getAttribute('updated_at');
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_updatedAt_should_return_null
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_updatedAt_should_return_null
BadMethodCallException: Call to undefined method MockObject_Employee_47604847::updatedAt()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/Forw

[Killed] PublicVisibility
Persistence/Eloquent/Model/Employee.php:233:5
         return ($datetime) ? $this->getDateTime($datetime) : $datetime;
     }
 
-    public function changeUpdatedAt(?DateTime $datetime): self
+    protected function changeUpdatedAt(?DateTime $datetime): self
     {
         $this->setAttribute('updated_at', $datetime);
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeUpdatedAt_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeUpdatedAt_should_change_and_return_self
BadMethodCallException: Call to undefined method MockObject_Employee_bad927de::changeUpdatedAt()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/vendor/laravel/framework/src/Illumin

[Killed] MethodCallRemoval
Persistence/Eloquent/Model/Employee.php:235:9
 
     public function changeUpdatedAt(?DateTime $datetime): self
     {
-        $this->setAttribute('updated_at', $datetime);
+        
 
         return $this;
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeUpdatedAt_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeUpdatedAt_should_change_and_return_self
Expectation failed for method name is "setAttribute" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] PublicVisibility
Persistence/Eloquent/Model/Employee.php:243:5
     /**
      * @throws Exception
      */
-    public function deletedAt(): ?DateTime
+    protected function deletedAt(): ?DateTime
     {
         $datetime = $this->getAttribute('deleted_at');
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_deletedAt_should_return_null
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_deletedAt_should_return_null
BadMethodCallException: Call to undefined method MockObject_Employee_98d89d1f::deletedAt()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/Forw

[Killed] PublicVisibility
Persistence/Eloquent/Model/Employee.php:250:5
         return ($datetime) ? $this->getDateTime($datetime) : $datetime;
     }
 
-    public function changeDeletedAt(?DateTime $datetime): self
+    protected function changeDeletedAt(?DateTime $datetime): self
     {
         $this->setAttribute('deleted_at', $datetime);
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeDeletedAt_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeDeletedAt_should_change_and_return_self
BadMethodCallException: Call to undefined method MockObject_Employee_01a81201::changeDeletedAt()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/vendor/laravel/framework/src/Illumin

[Killed] MethodCallRemoval
Persistence/Eloquent/Model/Employee.php:252:9
 
     public function changeDeletedAt(?DateTime $datetime): self
     {
-        $this->setAttribute('deleted_at', $datetime);
+        
 
         return $this;
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeDeletedAt_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeDeletedAt_should_change_and_return_self
Expectation failed for method name is "setAttribute" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.
