[Killed] PublicVisibility
Persistence/Eloquent/Model/Employee.php:257:5
         return $this;
     }
 
-    public function search(): ?string
+    protected function search(): ?string
     {
         return $this->getAttribute('emp_search');
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_search_should_return_null
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_search_should_return_null
BadMethodCallException: Call to undefined method MockObject_Employee_89742039::search()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCa

[Killed] PublicVisibility
Persistence/Eloquent/Model/Employee.php:262:5
         return $this->getAttribute('emp_search');
     }
 
-    public function changeSearch(string $search): self
+    protected function changeSearch(string $search): self
     {
         $this->setAttribute('emp_search', $search);
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeSearch_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeSearch_should_change_and_return_self
BadMethodCallException: Call to undefined method MockObject_Employee_cd1e4052::changeSearch()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Su

[Killed] MethodCallRemoval
Persistence/Eloquent/Model/Employee.php:264:9
 
     public function changeSearch(string $search): self
     {
-        $this->setAttribute('emp_search', $search);
+        
 
         return $this;
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeSearch_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeSearch_should_change_and_return_self
Expectation failed for method name is "setAttribute" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] PublicVisibility
Persistence/Eloquent/Model/Employee.php:272:5
     /**
      * @throws Exception
      */
-    public function birthdate(): ?DateTime
+    protected function birthdate(): ?DateTime
     {
         $datetime = $this->getAttribute('emp_birthdate');
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_birthdate_should_return_null
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_birthdate_should_return_null
BadMethodCallException: Call to undefined method MockObject_Employee_1889061c::birthdate()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/Forw

[Killed] PublicVisibility
Persistence/Eloquent/Model/Employee.php:279:5
         return ($datetime) ? $this->getDateTime($datetime) : $datetime;
     }
 
-    public function changeBirthdate(?DateTime $date): self
+    protected function changeBirthdate(?DateTime $date): self
     {
         $this->setAttribute('emp_birthdate', $date);
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeBirthdate_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeBirthdate_should_change_and_return_self
BadMethodCallException: Call to undefined method MockObject_Employee_106b2cfa::changeBirthdate()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/vendor/laravel/framework/src/Illumin

[Killed] MethodCallRemoval
Persistence/Eloquent/Model/Employee.php:281:9
 
     public function changeBirthdate(?DateTime $date): self
     {
-        $this->setAttribute('emp_birthdate', $date);
+        
 
         return $this;
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeBirthdate_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeBirthdate_should_change_and_return_self
Expectation failed for method name is "setAttribute" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] PublicVisibility
Persistence/Eloquent/Model/Employee.php:286:5
         return $this;
     }
 
-    public function observations(): ?string
+    protected function observations(): ?string
     {
         return $this->getAttribute('emp_observations');
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_observations_should_return_null
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_observations_should_return_null
BadMethodCallException: Call to undefined method MockObject_Employee_ad6211a6::observations()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Trait

[Killed] PublicVisibility
Persistence/Eloquent/Model/Employee.php:291:5
         return $this->getAttribute('emp_observations');
     }
 
-    public function changeObservations(?string $observations): self
+    protected function changeObservations(?string $observations): self
     {
         $this->setAttribute('emp_observations', $observations);
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeObservations_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeObservations_should_change_and_return_self
BadMethodCallException: Call to undefined method MockObject_Employee_90fba6a4::changeObservations()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/vendor/laravel/framework/src/I

[Killed] MethodCallRemoval
Persistence/Eloquent/Model/Employee.php:293:9
 
     public function changeObservations(?string $observations): self
     {
-        $this->setAttribute('emp_observations', $observations);
+        
 
         return $this;
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeObservations_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeObservations_should_change_and_return_self
Expectation failed for method name is "setAttribute" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] PublicVisibility
Persistence/Eloquent/Model/Employee.php:298:5
         return $this;
     }
 
-    public function identificationType(): string
+    protected function identificationType(): string
     {
         return $this->getAttribute('emp_identification_type');
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_identificationType_should_return_string
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_identificationType_should_return_string
BadMethodCallException: Call to undefined method MockObject_Employee_20d5bcee::identificationType()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate

[Killed] PublicVisibility
Persistence/Eloquent/Model/Employee.php:303:5
         return $this->getAttribute('emp_identification_type');
     }
 
-    public function changeIdentificationType(string $type): self
+    protected function changeIdentificationType(string $type): self
     {
         $this->setAttribute('emp_identification_type', $type);
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeIdentificationType_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeIdentificationType_should_change_and_return_self
BadMethodCallException: Call to undefined method MockObject_Employee_2e4ae689::changeIdentificationType()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/vendor/laravel/fra

[Killed] MethodCallRemoval
Persistence/Eloquent/Model/Employee.php:305:9
 
     public function changeIdentificationType(string $type): self
     {
-        $this->setAttribute('emp_identification_type', $type);
+        
 
         return $this;
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeIdentificationType_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeIdentificationType_should_change_and_return_self
Expectation failed for method name is "setAttribute" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] PublicVisibility
Persistence/Eloquent/Model/Employee.php:310:5
         return $this;
     }
 
-    public function image(): ?string
+    protected function image(): ?string
     {
         return $this->getAttribute('emp_image');
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_image_should_return_null
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_image_should_return_null
BadMethodCallException: Call to undefined method MockObject_Employee_9754407d::image()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCall

[Killed] PublicVisibility
Persistence/Eloquent/Model/Employee.php:315:5
         return $this->getAttribute('emp_image');
     }
 
-    public function changeImage(?string $image): self
+    protected function changeImage(?string $image): self
     {
         $this->setAttribute('emp_image', $image);
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeImage_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeImage_should_change_and_return_self
BadMethodCallException: Call to undefined method MockObject_Employee_185835d7::changeImage()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Supp

[Killed] MethodCallRemoval
Persistence/Eloquent/Model/Employee.php:317:9
 
     public function changeImage(?string $image): self
     {
-        $this->setAttribute('emp_image', $image);
+        
 
         return $this;
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeImage_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Eloquent\Model\EmployeeTest::test_changeImage_should_change_and_return_self
Expectation failed for method name is "setAttribute" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.
