[NoCoverage] Throw_
Infrastructure/Persistence/Repositories/ChainEmployeeRepository.php:44:13
         try {
             return $this->read(__FUNCTION__, $id);
         } catch (Exception $exception) {
-            throw new EmployeeNotFoundException('Employee not found by id '.$id->value());
+            new EmployeeNotFoundException('Employee not found by id ' . $id->value());
         }
     }

[NoCoverage] Concat
Infrastructure/Persistence/Repositories/ChainEmployeeRepository.php:44:13
         try {
             return $this->read(__FUNCTION__, $id);
         } catch (Exception $exception) {
-            throw new EmployeeNotFoundException('Employee not found by id '.$id->value());
+            throw new EmployeeNotFoundException($id->value() . 'Employee not found by id ');
         }
     }

[NoCoverage] Concat
Infrastructure/Persistence/Repositories/ChainEmployeeRepository.php:59:13
         try {
             return $this->read(__FUNCTION__, $identification);
         } catch (Exception $exception) {
-            throw new EmployeeNotFoundException('Employee not found by identification '.$identification->value());
+            throw new EmployeeNotFoundException($identification->value() . 'Employee not found by identification ');
         }
     }

[NoCoverage] ConcatOperandRemoval
Infrastructure/Persistence/Repositories/ChainEmployeeRepository.php:59:13
         try {
             return $this->read(__FUNCTION__, $identification);
         } catch (Exception $exception) {
-            throw new EmployeeNotFoundException('Employee not found by identification '.$identification->value());
+            throw new EmployeeNotFoundException('Employee not found by identification ');
         }
     }

[NoCoverage] MethodCallRemoval
Infrastructure/Persistence/Repositories/ChainEmployeeRepository.php:68:9
      */
     public function delete(EmployeeId $id): void
     {
-        $this->write(__FUNCTION__, $id);
+        
     }
 

[NoCoverage] PublicVisibility
Infrastructure/Persistence/Repositories/ChainEmployeeRepository.php:76:5
         return $this->write(__FUNCTION__, $employee);
     }
 
-    public function persistEmployees(Employees $employees): Employees
+    protected function persistEmployees(Employees $employees): Employees
     {
         return $this->write(__FUNCTION__, $employees);

[NoCoverage] Throw_
Infrastructure/Persistence/Repositories/ChainEmployeeRepository.php:92:13
         try {
             return $this->read(__FUNCTION__, $filters);
         } catch (Exception $exception) {
-            throw new EmployeesNotFoundException('Employees not found');
+            new EmployeesNotFoundException('Employees not found');
         }
     }

[NoCoverage] PublicVisibility
Infrastructure/Persistence/Repositories/ChainEmployeeRepository.php:96:5
         }
     }
 
-    public function functionNameDelete(): bool
+    protected function functionNameDelete(): bool
     {
         return false;
