[Killed] IfNegation
Infrastructure/Persistence/Repositories/EloquentEmployeeRepository.php:68:9
 
         $data = $builder->first();
 
-        if (is_null($data)) {
-            throw new EmployeeNotFoundException('Employee not found with id: '.$id->value());
-        }
+        if (!is_null($data)) {
 
         $employeeModel = $this->updateAttributesModelEmployee((array) $data);
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_find_should_return_employee_object
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_find_should_return_employee_object
Core\Employee\Domain\ValueObjects\EmployeeId::value(): int was not expected to be called more than once.

/var/www/abacusSystem-new/src/core/Employee/Infrastructure/Persistence/Repositories/EloquentEmployeeRepository.php:51
/var/www/abacusSystem-new/tests/F

[Killed] ConcatOperandRemoval
Infrastructure/Persistence/Repositories/EloquentEmployeeRepository.php:69:13
         $data = $builder->first();
 
         if (is_null($data)) {
-            throw new EmployeeNotFoundException('Employee not found with id: '.$id->value());
+            throw new EmployeeNotFoundException($id->value());
         }
 
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_find_should_return_exception
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_find_should_return_exception
Failed asserting that exception message '1' contains 'Employee not found with id: 1'.

FAILURES!
Tests: 1, Assertions: 6, Failures: 1.

[Killed] Throw_
Infrastructure/Persistence/Repositories/EloquentEmployeeRepository.php:69:13
         $data = $builder->first();
 
         if (is_null($data)) {
-            throw new EmployeeNotFoundException('Employee not found with id: '.$id->value());
+            new EmployeeNotFoundException('Employee not found with id: ' . $id->value());
         }
 
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_find_should_return_exception
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_find_should_return_exception
Failed asserting that exception of type "Core\Employee\Exceptions\EmployeeNotFoundException" is thrown.

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.

[Killed] CastArray
Infrastructure/Persistence/Repositories/EloquentEmployeeRepository.php:72:9
             throw new EmployeeNotFoundException('Employee not found with id: '.$id->value());
         }
 
-        $employeeModel = $this->updateAttributesModelEmployee((array) $data);
+        $employeeModel = $this->updateAttributesModelEmployee($data);
 
         return $this->employeeTranslator->setModel($employeeModel)->toDomain();
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_find_should_return_employee_object
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_find_should_return_employee_object

/var/www/abacusSystem-new/src/core/Employee/Infrastructure/Persistence/Repositories/EloquentEmployeeRepository.php:154
/var/www/abacusSystem-new/src/core/Employee/Infrastructure/Persistence/Repositories/EloquentEmployeeRepository.php:53
/var/www/abacusSyst

[Killed] IfNegation
Infrastructure/Persistence/Repositories/EloquentEmployeeRepository.php:88:9
             ->where('emp_state', '>', ValueObjectStatus::STATE_DELETE);
         $data = $builder->first();
 
-        if (is_null($data)) {
-            throw new EmployeeNotFoundException('Employee not found with id: '.$identification->value());
-        }
+        if (!is_null($data)) {
 
         $employeeModel = $this->updateAttributesModelEmployee((array) $data);
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_findCriteria_should_return_employee_object
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_findCriteria_should_return_employee_object
Core\Employee\Domain\ValueObjects\EmployeeIdentification::value(): string was not expected to be called more than once.

/var/www/abacusSystem-new/src/core/Employee/Infrastructure/Persistence/Repositories/EloquentEmployeeRepository.php:65
/var/www/a

[Killed] ConcatOperandRemoval
Infrastructure/Persistence/Repositories/EloquentEmployeeRepository.php:89:13
         $data = $builder->first();
 
         if (is_null($data)) {
-            throw new EmployeeNotFoundException('Employee not found with id: '.$identification->value());
+            throw new EmployeeNotFoundException($identification->value());
         }
 
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_findCriteria_should_return_exception
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_findCriteria_should_return_exception
Failed asserting that exception message '12345' contains 'Employee not found with id: 1'.

FAILURES!
Tests: 1, Assertions: 6, Failures: 1.

[Killed] ConcatOperandRemoval
Infrastructure/Persistence/Repositories/EloquentEmployeeRepository.php:89:13
         $data = $builder->first();
 
         if (is_null($data)) {
-            throw new EmployeeNotFoundException('Employee not found with id: '.$identification->value());
+            throw new EmployeeNotFoundException('Employee not found with id: ');
         }
 
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_findCriteria_should_return_exception
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_findCriteria_should_return_exception
Failed asserting that exception message 'Employee not found with id: ' contains 'Employee not found with id: 1'.

FAILURES!
Tests: 1, Assertions: 6, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentEmployeeRepository.php:104:9
     public function delete(EmployeeId $id): void
     {
         $builder = $this->database->table($this->getTable());
-        $builder->where('emp_id', $id->value());
+        
         $data = $builder->first();
 
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_delete_should_return_void
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_delete_should_return_void
Expectation failed for method name is "value" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 7, Failures: 1.

[Survived] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentEmployeeRepository.php:112:9
         }
 
         $employeeModel = $this->updateAttributesModelEmployee((array) $data);
-        $employeeModel->changeState(ValueObjectStatus::STATE_DELETE);
+        
         $employeeModel->changeDeletedAt($this->getDateTime());
 

[Survived] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentEmployeeRepository.php:113:9
 
         $employeeModel = $this->updateAttributesModelEmployee((array) $data);
         $employeeModel->changeState(ValueObjectStatus::STATE_DELETE);
-        $employeeModel->changeDeletedAt($this->getDateTime());
+        
 
         $builder->update($employeeModel->toArray());

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentEmployeeRepository.php:115:9
         $employeeModel->changeState(ValueObjectStatus::STATE_DELETE);
         $employeeModel->changeDeletedAt($this->getDateTime());
 
-        $builder->update($employeeModel->toArray());
+        
     }
 
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_delete_should_return_void
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_delete_should_return_void
Expectation failed for method name is "toArray" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 6, Failures: 1.

[Killed] IfNegation
Infrastructure/Persistence/Repositories/EloquentEmployeeRepository.php:129:9
 
         $builder = $this->database->table($this->getTable());
 
-        if (is_null($employeeId)) {
-            $employeeId = $builder->insertGetId($dataModel);
-            $employee->id()->setValue($employeeId);
-        } else {
-            $dataModel['updated_at'] = $this->getDateTime();
-
-            $builder->where('emp_id', $employeeId);
-            $builder->update($dataModel);
-        }
+        if (!is_null($employeeId)) {
 
         return $employee;
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_persistEmployee_should_return_employee_object
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_persistEmployee_should_update_return_employee_object
Core\Employee\Domain\Employee::id(): Core\Employee\Domain\ValueObjects\EmployeeId was not expected to be called more than 2 times.

/var/www/abacusSystem-new/src/core/Employee/Infrastructure/Persistence/Repositories/EloquentEmployeeReposit

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentEmployeeRepository.php:131:13
 
         if (is_null($employeeId)) {
             $employeeId = $builder->insertGetId($dataModel);
-            $employee->id()->setValue($employeeId);
+            
         } else {
             $dataModel['updated_at'] = $this->getDateTime();
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_persistEmployee_should_return_employee_object
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_persistEmployee_should_return_employee_object
Expectation failed for method name is "id" when invoked 3 times.
Method was expected to be called 3 times, actually called 2 times.

FAILURES!
Tests: 1, Assertions: 8, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentEmployeeRepository.php:135:13
         } else {
             $dataModel['updated_at'] = $this->getDateTime();
 
-            $builder->where('emp_id', $employeeId);
+            
             $builder->update($dataModel);
         }
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_persistEmployee_should_update_return_employee_object
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_persistEmployee_should_update_return_employee_object
Mockery\Exception\InvalidCountException: Method where('emp_id', 1) from Mockery_1_Illuminate_Database_Query_Builder should be called
 exactly 2 times but called 1 times.

/var/www/abacusSystem-new/vendor/mockery/mockery/library/Mockery/Cou

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentEmployeeRepository.php:136:13
             $dataModel['updated_at'] = $this->getDateTime();
 
             $builder->where('emp_id', $employeeId);
-            $builder->update($dataModel);
+            
         }
 
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_persistEmployee_should_update_return_employee_object
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_persistEmployee_should_update_return_employee_object
Mockery\Exception\InvalidCountException: Method update(<Any Arguments>) from Mockery_1_Illuminate_Database_Query_Builder should be called
 exactly 1 times but called 0 times.

/var/www/abacusSystem-new/vendor/mockery/mockery/library/Mocker

[Killed] LogicalAndAllSubExprNegation
Infrastructure/Persistence/Repositories/EloquentEmployeeRepository.php:151:9
         $builder = $this->database->table($this->getTable())
             ->where('emp_state', '>', ValueObjectStatus::STATE_DELETE);
 
-        if (array_key_exists('q', $filters) && isset($filters['q'])) {
+        if (!array_key_exists('q', $filters) && !isset($filters['q'])) {
             $builder->whereFullText($this->model->getSearchField(), $filters['q']);
         }
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_getAll_should_return_employees_object
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_getAll_should_return_employees_object
Expectation failed for method name is "getSearchField" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 7, Failures: 1.

[Killed] LogicalAndSingleSubExprNegation
Infrastructure/Persistence/Repositories/EloquentEmployeeRepository.php:151:9
         $builder = $this->database->table($this->getTable())
             ->where('emp_state', '>', ValueObjectStatus::STATE_DELETE);
 
-        if (array_key_exists('q', $filters) && isset($filters['q'])) {
+        if (!array_key_exists('q', $filters) && isset($filters['q'])) {
             $builder->whereFullText($this->model->getSearchField(), $filters['q']);
         }
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_getAll_should_return_employees_object
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_getAll_should_return_employees_object
Expectation failed for method name is "getSearchField" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 7, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentEmployeeRepository.php:152:13
             ->where('emp_state', '>', ValueObjectStatus::STATE_DELETE);
 
         if (array_key_exists('q', $filters) && isset($filters['q'])) {
-            $builder->whereFullText($this->model->getSearchField(), $filters['q']);
+            
         }
         $employeeCollection = $builder->get(['emp_id']);
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_getAll_should_return_employees_object
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_getAll_should_return_employees_object
Expectation failed for method name is "getSearchField" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 7, Failures: 1.

[Killed] Throw_
Infrastructure/Persistence/Repositories/EloquentEmployeeRepository.php:157:13
         $employeeCollection = $builder->get(['emp_id']);
 
         if (empty($employeeCollection)) {
-            throw new EmployeesNotFoundException('Employees not found');
+            new EmployeesNotFoundException('Employees not found');
         }
 
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_getAll_should_return_exception
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_getAll_should_return_exception
Core\Employee\Infrastructure\Persistence\Translators\EmployeeTranslator::setCollection([]): Core\Employee\Infrastructure\Persistence\Translators\EmployeeTranslator was not expected to be called.

/var/www/abacusSystem-new/src/core/Employee/Infrastructure/Persis

[Killed] Foreach_
Infrastructure/Persistence/Repositories/EloquentEmployeeRepository.php:161:9
         }
 
         $collection = [];
-        foreach ($employeeCollection as $item) {
-            $employeeModel = $this->updateAttributesModelEmployee((array) $item);
-            $collection[] = $employeeModel->id();
-        }
+        foreach ([] as $item) {
 
         $employees = $this->employeeTranslator->setCollection($collection)->toDomainCollection();
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_getAll_should_return_employees_object
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_getAll_should_return_employees_object
Expectation failed for method name is "setCollection" when invoked 1 time
Parameter 0 for invocation Core\Employee\Infrastructure\Persistence\Translators\EmployeeTranslator::setCollection([]): Core\Employee\Infrastructure\Persistence\Translators\Employee

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentEmployeeRepository.php:167:9
         }
 
         $employees = $this->employeeTranslator->setCollection($collection)->toDomainCollection();
-        $employees->setFilters($filters);
+        
 
         return $employees;
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_getAll_should_return_employees_object
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_getAll_should_return_employees_object
Expectation failed for method name is "setFilters" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 9, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentEmployeeRepository.php:175:9
     private function domainToModel(Employee $domain): EmployeeModel
     {
         $builder = $this->database->table($this->getTable());
-        $builder->where('emp_id', $domain->id()->value());
+        
         $data = $builder->first();
 
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_persistEmployee_should_return_employee_object
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_persistEmployee_should_return_employee_object
Expectation failed for method name is "id" when invoked 3 times.
Method was expected to be called 3 times, actually called 2 times.

FAILURES!
Tests: 1, Assertions: 8, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentEmployeeRepository.php:180:9
 
         $model = $this->updateAttributesModelEmployee((array) $data);
 
-        $model->changeId($domain->id()->value());
+        
         $model->changeIdentification($domain->identification()->value());
         $model->changeIdentificationType($domain->identificationType()->value());
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_persistEmployee_should_return_employee_object
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_persistEmployee_should_return_employee_object
Expectation failed for method name is "changeId" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 7, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentEmployeeRepository.php:181:9
         $model = $this->updateAttributesModelEmployee((array) $data);
 
         $model->changeId($domain->id()->value());
-        $model->changeIdentification($domain->identification()->value());
+        
         $model->changeIdentificationType($domain->identificationType()->value());
         $model->changeName($domain->name()->value());
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_persistEmployee_should_return_employee_object
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_persistEmployee_should_return_employee_object
Expectation failed for method name is "changeIdentification" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 7, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentEmployeeRepository.php:182:9
 
         $model->changeId($domain->id()->value());
         $model->changeIdentification($domain->identification()->value());
-        $model->changeIdentificationType($domain->identificationType()->value());
+        
         $model->changeName($domain->name()->value());
         $model->changeLastname($domain->lastname()->value());
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_persistEmployee_should_return_employee_object
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_persistEmployee_should_return_employee_object
Expectation failed for method name is "changeIdentificationType" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 7, Failures: 1.

[Survived] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentEmployeeRepository.php:183:9
         $model->changeId($domain->id()->value());
         $model->changeIdentification($domain->identification()->value());
         $model->changeIdentificationType($domain->identificationType()->value());
-        $model->changeName($domain->name()->value());
+        
         $model->changeLastname($domain->lastname()->value());
         $model->changePhone($domain->phone()->value());

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentEmployeeRepository.php:184:9
         $model->changeIdentification($domain->identification()->value());
         $model->changeIdentificationType($domain->identificationType()->value());
         $model->changeName($domain->name()->value());
-        $model->changeLastname($domain->lastname()->value());
+        
         $model->changePhone($domain->phone()->value());
         $model->changeBirthdate($domain->birthdate()->value());
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_persistEmployee_should_return_employee_object
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_persistEmployee_should_return_employee_object
Expectation failed for method name is "changeLastname" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 7, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentEmployeeRepository.php:185:9
         $model->changeIdentificationType($domain->identificationType()->value());
         $model->changeName($domain->name()->value());
         $model->changeLastname($domain->lastname()->value());
-        $model->changePhone($domain->phone()->value());
+        
         $model->changeBirthdate($domain->birthdate()->value());
         $model->changeEmail($domain->email()->value());
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_persistEmployee_should_return_employee_object
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_persistEmployee_should_return_employee_object
Expectation failed for method name is "changePhone" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 7, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentEmployeeRepository.php:186:9
         $model->changeName($domain->name()->value());
         $model->changeLastname($domain->lastname()->value());
         $model->changePhone($domain->phone()->value());
-        $model->changeBirthdate($domain->birthdate()->value());
+        
         $model->changeEmail($domain->email()->value());
         $model->changeAddress($domain->address()->value());
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_persistEmployee_should_return_employee_object
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_persistEmployee_should_return_employee_object
Expectation failed for method name is "changeBirthdate" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 7, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentEmployeeRepository.php:187:9
         $model->changeLastname($domain->lastname()->value());
         $model->changePhone($domain->phone()->value());
         $model->changeBirthdate($domain->birthdate()->value());
-        $model->changeEmail($domain->email()->value());
+        
         $model->changeAddress($domain->address()->value());
         $model->changeObservations($domain->observations()->value());
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_persistEmployee_should_return_employee_object
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_persistEmployee_should_return_employee_object
Expectation failed for method name is "changeEmail" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 7, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentEmployeeRepository.php:188:9
         $model->changePhone($domain->phone()->value());
         $model->changeBirthdate($domain->birthdate()->value());
         $model->changeEmail($domain->email()->value());
-        $model->changeAddress($domain->address()->value());
+        
         $model->changeObservations($domain->observations()->value());
         $model->changeImage($domain->image()->value());
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_persistEmployee_should_return_employee_object
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_persistEmployee_should_return_employee_object
Expectation failed for method name is "changeAddress" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 7, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentEmployeeRepository.php:189:9
         $model->changeBirthdate($domain->birthdate()->value());
         $model->changeEmail($domain->email()->value());
         $model->changeAddress($domain->address()->value());
-        $model->changeObservations($domain->observations()->value());
+        
         $model->changeImage($domain->image()->value());
         $model->changeState($domain->state()->value());
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_persistEmployee_should_return_employee_object
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_persistEmployee_should_return_employee_object
Expectation failed for method name is "changeObservations" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 7, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentEmployeeRepository.php:190:9
         $model->changeEmail($domain->email()->value());
         $model->changeAddress($domain->address()->value());
         $model->changeObservations($domain->observations()->value());
-        $model->changeImage($domain->image()->value());
+        
         $model->changeState($domain->state()->value());
         $model->changeSearch($domain->search()->value());
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_persistEmployee_should_return_employee_object
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_persistEmployee_should_return_employee_object
Expectation failed for method name is "changeImage" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 7, Failures: 1.
