[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentEmployeeRepository.php:191:9
         $model->changeAddress($domain->address()->value());
         $model->changeObservations($domain->observations()->value());
         $model->changeImage($domain->image()->value());
-        $model->changeState($domain->state()->value());
+        
         $model->changeSearch($domain->search()->value());
         $model->changeCreatedAt($domain->createdAt()->value());
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_persistEmployee_should_return_employee_object
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_persistEmployee_should_return_employee_object
Expectation failed for method name is "changeState" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 7, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentEmployeeRepository.php:192:9
         $model->changeObservations($domain->observations()->value());
         $model->changeImage($domain->image()->value());
         $model->changeState($domain->state()->value());
-        $model->changeSearch($domain->search()->value());
+        
         $model->changeCreatedAt($domain->createdAt()->value());
 
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_persistEmployee_should_return_employee_object
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_persistEmployee_should_return_employee_object
Expectation failed for method name is "changeSearch" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 7, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentEmployeeRepository.php:193:9
         $model->changeImage($domain->image()->value());
         $model->changeState($domain->state()->value());
         $model->changeSearch($domain->search()->value());
-        $model->changeCreatedAt($domain->createdAt()->value());
+        
 
         if (! is_null($domain->updatedAt()->value())) {
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_persistEmployee_should_return_employee_object
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_persistEmployee_should_return_employee_object
Expectation failed for method name is "changeCreatedAt" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 7, Failures: 1.

[Killed] LogicalNot
Infrastructure/Persistence/Repositories/EloquentEmployeeRepository.php:195:9
         $model->changeSearch($domain->search()->value());
         $model->changeCreatedAt($domain->createdAt()->value());
 
-        if (! is_null($domain->updatedAt()->value())) {
+        if (is_null($domain->updatedAt()->value())) {
             $model->changeUpdatedAt($domain->updatedAt()->value());
         }
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_persistEmployee_should_return_employee_object
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_persistEmployee_should_return_employee_object
Expectation failed for method name is "updatedAt" when invoked 2 times.
Method was expected to be called 2 times, actually called 1 time.

FAILURES!
Tests: 1, Assertions: 8, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentEmployeeRepository.php:196:13
         $model->changeCreatedAt($domain->createdAt()->value());
 
         if (! is_null($domain->updatedAt()->value())) {
-            $model->changeUpdatedAt($domain->updatedAt()->value());
+            
         }
 
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_persistEmployee_should_return_employee_object
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_persistEmployee_should_return_employee_object
Expectation failed for method name is "updatedAt" when invoked 2 times.
Method was expected to be called 2 times, actually called 1 time.

FAILURES!
Tests: 1, Assertions: 8, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentEmployeeRepository.php:204:9
 
     private function updateAttributesModelEmployee(array $data = []): EmployeeModel
     {
-        $this->model->fill($data);
+        
 
         return $this->model;
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_find_should_return_employee_object
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\EloquentEmployeeRepositoryTest::test_find_should_return_employee_object
Expectation failed for method name is "fill" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 7, Failures: 1.
