[Killed] Throw_
Infrastructure/Persistence/Repositories/RedisEmployeeRepository.php:73:13
             $data = Redis::get($this->employeeKey($id));
         } catch (Exception $exception) {
             $this->logger->error($exception->getMessage(), $exception->getTrace());
-            throw new EmployeeNotFoundException('Employee not found by id '.$id->value());
+            new EmployeeNotFoundException('Employee not found by id ' . $id->value());
         }
 
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\RedisEmployeeRepositoryTest::test_find_should_return_exception
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\RedisEmployeeRepositoryTest::test_find_should_return_exception
Failed asserting that exception of type "ErrorException" matches expected exception "Core\Employee\Exceptions\EmployeeNotFoundException". Message was: "Undefined variable $data" at
/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Foundation/Bootstra

[Killed] ConcatOperandRemoval
Infrastructure/Persistence/Repositories/RedisEmployeeRepository.php:73:13
             $data = Redis::get($this->employeeKey($id));
         } catch (Exception $exception) {
             $this->logger->error($exception->getMessage(), $exception->getTrace());
-            throw new EmployeeNotFoundException('Employee not found by id '.$id->value());
+            throw new EmployeeNotFoundException($id->value());
         }
 
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\RedisEmployeeRepositoryTest::test_find_should_return_exception
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\RedisEmployeeRepositoryTest::test_find_should_return_exception
Failed asserting that exception message '1' contains 'Employee not found by id 1'.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] LogicalNot
Infrastructure/Persistence/Repositories/RedisEmployeeRepository.php:76:9
             throw new EmployeeNotFoundException('Employee not found by id '.$id->value());
         }
 
-        if (! is_null($data)) {
+        if (is_null($data)) {
             $dataArray = json_decode($data, true);
             $dataArray['createdAt'] = new \DateTime($dataArray['createdAt']['date']);
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\RedisEmployeeRepositoryTest::test_find_should_return_employee_object
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\RedisEmployeeRepositoryTest::test_find_should_return_employee_object
Failed asserting that null is an instance of class Core\Employee\Domain\Employee.

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Infrastructure/Persistence/Repositories/RedisEmployeeRepositoryTest.php:104

FAILURES!
Tests: 1, Assertions: 2, Failures: 1

[Killed] LogicalNot
Infrastructure/Persistence/Repositories/RedisEmployeeRepository.php:80:13
             $dataArray = json_decode($data, true);
             $dataArray['createdAt'] = new \DateTime($dataArray['createdAt']['date']);
 
-            if (! is_null($dataArray['updatedAt'])) {
+            if (is_null($dataArray['updatedAt'])) {
                 $dataArray['updatedAt'] = new \DateTime($dataArray['updatedAt']['date']);
             }
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\RedisEmployeeRepositoryTest::test_find_should_return_employee_object
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\RedisEmployeeRepositoryTest::test_find_should_return_employee_object
Expectation failed for method name is "buildEmployeeFromArray" when invoked 1 time
Parameter 0 for invocation Core\Employee\Domain\Contracts\EmployeeFactoryContract::buildEmployeeFromArray([...]): Core\Employee\Domain\Employee does not match expected value.
Fa

[Killed] LogicalNot
Infrastructure/Persistence/Repositories/RedisEmployeeRepository.php:84:13
                 $dataArray['updatedAt'] = new \DateTime($dataArray['updatedAt']['date']);
             }
 
-            if (! is_null($dataArray['birthdate'])) {
+            if (is_null($dataArray['birthdate'])) {
                 $dataArray['birthdate'] = new \DateTime($dataArray['birthdate']['date']);
             }
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\RedisEmployeeRepositoryTest::test_find_should_return_employee_object
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\RedisEmployeeRepositoryTest::test_find_should_return_employee_object
Expectation failed for method name is "buildEmployeeFromArray" when invoked 1 time
Parameter 0 for invocation Core\Employee\Domain\Contracts\EmployeeFactoryContract::buildEmployeeFromArray([...]): Core\Employee\Domain\Employee does not match expected value.
Fa

[Killed] ConcatOperandRemoval
Infrastructure/Persistence/Repositories/RedisEmployeeRepository.php:104:13
             $data = Redis::get($this->employeeIdentificationKey($identification));
         } catch (Exception $exception) {
             $this->logger->error($exception->getMessage(), $exception->getTrace());
-            throw new EmployeeNotFoundException('Employee not found by identification '.$identification->value());
+            throw new EmployeeNotFoundException($identification->value());
         }
 
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\RedisEmployeeRepositoryTest::test_findCriteria_should_return_exception
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\RedisEmployeeRepositoryTest::test_findCriteria_should_return_exception
Failed asserting that exception message 'test' contains 'Employee not found by identification test'.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] Throw_
Infrastructure/Persistence/Repositories/RedisEmployeeRepository.php:104:13
             $data = Redis::get($this->employeeIdentificationKey($identification));
         } catch (Exception $exception) {
             $this->logger->error($exception->getMessage(), $exception->getTrace());
-            throw new EmployeeNotFoundException('Employee not found by identification '.$identification->value());
+            new EmployeeNotFoundException('Employee not found by identification ' . $identification->value());
         }
 
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\RedisEmployeeRepositoryTest::test_findCriteria_should_return_exception
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\RedisEmployeeRepositoryTest::test_findCriteria_should_return_exception
Failed asserting that exception of type "ErrorException" matches expected exception "Core\Employee\Exceptions\EmployeeNotFoundException". Message was: "Undefined variable $data" at
/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Foundation/

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/RedisEmployeeRepository.php:119:9
 
     public function delete(EmployeeId $id): void
     {
-        Redis::delete($this->employeeKey($id));
+        
     }
 
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\RedisEmployeeRepositoryTest::test_delete_should_return_void
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\RedisEmployeeRepositoryTest::test_delete_should_return_void
Expectation failed for method name is "value" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/RedisEmployeeRepository.php:132:13
 
         $employeeData = $this->dataTransformer->write($employee)->read();
         try {
-            Redis::set($employeeKey, json_encode($employeeData));
+            
             Redis::set($employeeIdentificationKey, json_encode($employeeData));
         } catch (Exception $exception) {
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\RedisEmployeeRepositoryTest::test_persistEmployee_should_return_object
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\RedisEmployeeRepositoryTest::test_persistEmployee_should_return_exception
Failed asserting that exception of type "Core\Employee\Exceptions\EmployeePersistException" is thrown.

ERRORS!
Tests: 2, Assertions: 11, Errors: 1, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/RedisEmployeeRepository.php:133:13
         $employeeData = $this->dataTransformer->write($employee)->read();
         try {
             Redis::set($employeeKey, json_encode($employeeData));
-            Redis::set($employeeIdentificationKey, json_encode($employeeData));
+            
         } catch (Exception $exception) {
             $this->logger->error($exception->getMessage(), $exception->getTrace());
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\RedisEmployeeRepositoryTest::test_persistEmployee_should_return_object
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\RedisEmployeeRepositoryTest::test_persistEmployee_should_return_object
Mockery\Exception\InvalidCountException: Method set('employee::test', '[]') from Mockery_0_Illuminate_Redis_RedisManager should be called
 exactly 1 times but called 0 times.

/var/www/abacusSystem-new/vendor/mockery/mockery/library/Mockery/CountValidator/Ex

[Killed] Throw_
Infrastructure/Persistence/Repositories/RedisEmployeeRepository.php:136:13
             Redis::set($employeeIdentificationKey, json_encode($employeeData));
         } catch (Exception $exception) {
             $this->logger->error($exception->getMessage(), $exception->getTrace());
-            throw new EmployeePersistException('It could not persist Employee with key '.$employeeKey.' in redis');
+            new EmployeePersistException('It could not persist Employee with key ' . $employeeKey . ' in redis');
         }
 
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\RedisEmployeeRepositoryTest::test_persistEmployee_should_return_exception
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\RedisEmployeeRepositoryTest::test_persistEmployee_should_return_exception
Failed asserting that exception of type "Core\Employee\Exceptions\EmployeePersistException" is thrown.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] ConcatOperandRemoval
Infrastructure/Persistence/Repositories/RedisEmployeeRepository.php:136:13
             Redis::set($employeeIdentificationKey, json_encode($employeeData));
         } catch (Exception $exception) {
             $this->logger->error($exception->getMessage(), $exception->getTrace());
-            throw new EmployeePersistException('It could not persist Employee with key '.$employeeKey.' in redis');
+            throw new EmployeePersistException($employeeKey . ' in redis');
         }
 
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\RedisEmployeeRepositoryTest::test_persistEmployee_should_return_exception
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Repositories\RedisEmployeeRepositoryTest::test_persistEmployee_should_return_exception
Failed asserting that exception message 'employee::1 in redis' contains 'It could not persist Employee with key employee::1 in redis'.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.
