[Killed] MethodCallRemoval
Infrastructure/Persistence/Translators/EmployeeTranslator.php:53:9
             $this->employeeFactory->buildEmployeeCreatedAt($this->employee->createdAt())
         );
 
-        $employee->setIdentificationType($this->employeeFactory->buildEmployeeIdentificationType($this->employee->identificationType()));
+        
         $employee->setUpdatedAt($this->employeeFactory->buildEmployeeUpdatedAt($this->employee->updatedAt()));
 
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Translators\EmployeeTranslatorTest::test_toDomain_should_return_domain_object
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Translators\EmployeeTranslatorTest::test_toDomain_should_return_domain_object
Expectation failed for method name is "buildEmployeeIdentificationType" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Translators/EmployeeTranslator.php:54:9
         );
 
         $employee->setIdentificationType($this->employeeFactory->buildEmployeeIdentificationType($this->employee->identificationType()));
-        $employee->setUpdatedAt($this->employeeFactory->buildEmployeeUpdatedAt($this->employee->updatedAt()));
+        
 
         $employee->setAddress($this->employeeFactory->buildEmployeeAddress($this->employee->address()));
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Translators\EmployeeTranslatorTest::test_toDomain_should_return_domain_object
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Translators\EmployeeTranslatorTest::test_toDomain_should_return_domain_object
Expectation failed for method name is "buildEmployeeUpdatedAt" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Translators/EmployeeTranslator.php:56:9
         $employee->setIdentificationType($this->employeeFactory->buildEmployeeIdentificationType($this->employee->identificationType()));
         $employee->setUpdatedAt($this->employeeFactory->buildEmployeeUpdatedAt($this->employee->updatedAt()));
 
-        $employee->setAddress($this->employeeFactory->buildEmployeeAddress($this->employee->address()));
+        
         $employee->setPhone($this->employeeFactory->buildEmployeePhone($this->employee->phone()));
         $employee->setEmail($this->employeeFactory->buildEmployeeEmail($this->employee->email()));
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Translators\EmployeeTranslatorTest::test_toDomain_should_return_domain_object
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Translators\EmployeeTranslatorTest::test_toDomain_should_return_domain_object
Expectation failed for method name is "buildEmployeeAddress" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Translators/EmployeeTranslator.php:57:9
         $employee->setUpdatedAt($this->employeeFactory->buildEmployeeUpdatedAt($this->employee->updatedAt()));
 
         $employee->setAddress($this->employeeFactory->buildEmployeeAddress($this->employee->address()));
-        $employee->setPhone($this->employeeFactory->buildEmployeePhone($this->employee->phone()));
+        
         $employee->setEmail($this->employeeFactory->buildEmployeeEmail($this->employee->email()));
         $employee->setSearch($this->employeeFactory->buildEmployeeSearch($this->employee->search()));
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Translators\EmployeeTranslatorTest::test_toDomain_should_return_domain_object
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Translators\EmployeeTranslatorTest::test_toDomain_should_return_domain_object
Expectation failed for method name is "buildEmployeePhone" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Translators/EmployeeTranslator.php:58:9
 
         $employee->setAddress($this->employeeFactory->buildEmployeeAddress($this->employee->address()));
         $employee->setPhone($this->employeeFactory->buildEmployeePhone($this->employee->phone()));
-        $employee->setEmail($this->employeeFactory->buildEmployeeEmail($this->employee->email()));
+        
         $employee->setSearch($this->employeeFactory->buildEmployeeSearch($this->employee->search()));
         $employee->setBirthdate($this->employeeFactory->buildEmployeeBirthdate($this->employee->birthdate()));
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Translators\EmployeeTranslatorTest::test_toDomain_should_return_domain_object
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Translators\EmployeeTranslatorTest::test_toDomain_should_return_domain_object
Expectation failed for method name is "buildEmployeeEmail" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Translators/EmployeeTranslator.php:59:9
         $employee->setAddress($this->employeeFactory->buildEmployeeAddress($this->employee->address()));
         $employee->setPhone($this->employeeFactory->buildEmployeePhone($this->employee->phone()));
         $employee->setEmail($this->employeeFactory->buildEmployeeEmail($this->employee->email()));
-        $employee->setSearch($this->employeeFactory->buildEmployeeSearch($this->employee->search()));
+        
         $employee->setBirthdate($this->employeeFactory->buildEmployeeBirthdate($this->employee->birthdate()));
         $employee->setObservations($this->employeeFactory->buildEmployeeObservations($this->employee->observations()));
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Translators\EmployeeTranslatorTest::test_toDomain_should_return_domain_object
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Translators\EmployeeTranslatorTest::test_toDomain_should_return_domain_object
Expectation failed for method name is "buildEmployeeSearch" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Translators/EmployeeTranslator.php:60:9
         $employee->setPhone($this->employeeFactory->buildEmployeePhone($this->employee->phone()));
         $employee->setEmail($this->employeeFactory->buildEmployeeEmail($this->employee->email()));
         $employee->setSearch($this->employeeFactory->buildEmployeeSearch($this->employee->search()));
-        $employee->setBirthdate($this->employeeFactory->buildEmployeeBirthdate($this->employee->birthdate()));
+        
         $employee->setObservations($this->employeeFactory->buildEmployeeObservations($this->employee->observations()));
         $employee->setImage($this->employeeFactory->buildEmployeeImage($this->employee->image()));
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Translators\EmployeeTranslatorTest::test_toDomain_should_return_domain_object
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Translators\EmployeeTranslatorTest::test_toDomain_should_return_domain_object
Expectation failed for method name is "buildEmployeeBirthdate" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Translators/EmployeeTranslator.php:61:9
         $employee->setEmail($this->employeeFactory->buildEmployeeEmail($this->employee->email()));
         $employee->setSearch($this->employeeFactory->buildEmployeeSearch($this->employee->search()));
         $employee->setBirthdate($this->employeeFactory->buildEmployeeBirthdate($this->employee->birthdate()));
-        $employee->setObservations($this->employeeFactory->buildEmployeeObservations($this->employee->observations()));
+        
         $employee->setImage($this->employeeFactory->buildEmployeeImage($this->employee->image()));
 
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Translators\EmployeeTranslatorTest::test_toDomain_should_return_domain_object
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Translators\EmployeeTranslatorTest::test_toDomain_should_return_domain_object
Expectation failed for method name is "buildEmployeeObservations" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Translators/EmployeeTranslator.php:62:9
         $employee->setSearch($this->employeeFactory->buildEmployeeSearch($this->employee->search()));
         $employee->setBirthdate($this->employeeFactory->buildEmployeeBirthdate($this->employee->birthdate()));
         $employee->setObservations($this->employeeFactory->buildEmployeeObservations($this->employee->observations()));
-        $employee->setImage($this->employeeFactory->buildEmployeeImage($this->employee->image()));
+        
 
         /** @var User $user */
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Translators\EmployeeTranslatorTest::test_toDomain_should_return_domain_object
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Translators\EmployeeTranslatorTest::test_toDomain_should_return_domain_object
Expectation failed for method name is "buildEmployeeImage" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Translators/EmployeeTranslator.php:66:9
 
         /** @var User $user */
         $user = $this->employee->relationWithUser()->first(['user_id']);
-        $employee->setUserId($this->employeeFactory->buildEmployeeUserId($user->id()));
+        
 
         return $employee;
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Translators\EmployeeTranslatorTest::test_toDomain_should_return_domain_object
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Translators\EmployeeTranslatorTest::test_toDomain_should_return_domain_object
Expectation failed for method name is "buildEmployeeUserId" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] PublicVisibility
Infrastructure/Persistence/Translators/EmployeeTranslator.php:71:5
         return $employee;
     }
 
-    public function setCollection(array $collection): self
+    protected function setCollection(array $collection): self
     {
         $this->collection = $collection;
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Translators\EmployeeTranslatorTest::test_toDomainCollection_should_return_employees
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Translators\EmployeeTranslatorTest::test_toDomainCollection_should_return_employees
Error: Call to protected method Core\Employee\Infrastructure\Persistence\Translators\EmployeeTranslator::setCollection() from scope Tests\Feature\Core\Employee\Infrastructure\Persistence\Translators\EmployeeTranslatorTest

/var/www/abacusSystem-new/tests/Fea

[Killed] PublicVisibility
Infrastructure/Persistence/Translators/EmployeeTranslator.php:78:5
         return $this;
     }
 
-    public function toDomainCollection(): Employees
+    protected function toDomainCollection(): Employees
     {
         $employees = new Employees;
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Translators\EmployeeTranslatorTest::test_toDomainCollection_should_return_employees
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Translators\EmployeeTranslatorTest::test_toDomainCollection_should_return_employees
Error: Call to protected method Core\Employee\Infrastructure\Persistence\Translators\EmployeeTranslator::toDomainCollection() from scope Tests\Feature\Core\Employee\Infrastructure\Persistence\Translators\EmployeeTranslatorTest

/var/www/abacusSystem-new/test

[Killed] Foreach_
Infrastructure/Persistence/Translators/EmployeeTranslator.php:81:9
     public function toDomainCollection(): Employees
     {
         $employees = new Employees;
-        foreach ($this->collection as $id) {
-            $employees->addId($id);
-        }
+        foreach ([] as $id) {
 
         return $employees;
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Translators\EmployeeTranslatorTest::test_toDomainCollection_should_return_employees
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Translators\EmployeeTranslatorTest::test_toDomainCollection_should_return_employees
Failed asserting that actual size 0 matches expected size 1.

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Infrastructure/Persistence/Translators/EmployeeTranslatorTest.php:327

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Translators/EmployeeTranslator.php:82:13
     {
         $employees = new Employees;
         foreach ($this->collection as $id) {
-            $employees->addId($id);
+            
         }
 
killedBy: Tests\Feature\Core\Employee\Infrastructure\Persistence\Translators\EmployeeTranslatorTest::test_toDomainCollection_should_return_employees
statusReason: 1) Tests\Feature\Core\Employee\Infrastructure\Persistence\Translators\EmployeeTranslatorTest::test_toDomainCollection_should_return_employees
Failed asserting that actual size 0 matches expected size 1.

/var/www/abacusSystem-new/tests/Feature/Core/Employee/Infrastructure/Persistence/Translators/EmployeeTranslatorTest.php:327

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.
