[Survived] MethodCallRemoval
Institution/Application/Factory/InstitutionFactory.php:38:9
             $this->buildInstitutionName($data['name'])
         );
 
-        $institution->setShortname(
-            $this->buildInstitutionShortname($data['shortname'])
-        );
+        
 
         $institution->setCode(

[Survived] MethodCallRemoval
Institution/Application/Factory/InstitutionFactory.php:42:9
             $this->buildInstitutionShortname($data['shortname'])
         );
 
-        $institution->setCode(
-            $this->buildInstitutionCode($data['code'])
-        );
+        
 
         $institution->setObservations(

[Survived] MethodCallRemoval
Institution/Application/Factory/InstitutionFactory.php:46:9
             $this->buildInstitutionCode($data['code'])
         );
 
-        $institution->setObservations(
-            $this->buildInstitutionObservations($data['observations'])
-        );
+        
 
         $institution->setState(

[Survived] MethodCallRemoval
Institution/Application/Factory/InstitutionFactory.php:50:9
             $this->buildInstitutionObservations($data['observations'])
         );
 
-        $institution->setState(
-            $this->buildInstitutionState($data['state'])
-        );
+        
 
         $institution->setCreatedAt(

[Survived] MethodCallRemoval
Institution/Application/Factory/InstitutionFactory.php:54:9
             $this->buildInstitutionState($data['state'])
         );
 
-        $institution->setCreatedAt(
-            $this->buildInstitutionCreatedAt($data['createdAt'])
-        );
+        
 
         if (isset($data['logo'])) {

[Survived] MethodCallRemoval
Institution/Application/Factory/InstitutionFactory.php:59:13
         );
 
         if (isset($data['logo'])) {
-            $institution->setLogo(
-                $this->buildInstitutionLogo($data['logo'])
-            );
+            
         }
 

[Survived] MethodCallRemoval
Institution/Application/Factory/InstitutionFactory.php:65:13
         }
 
         if (isset($data['updatedAt'])) {
-            $institution->setUpdatedAt(
-                $this->buildInstitutionUpdatedAt($data['updatedAt'])
-            );
+            
         }
 
