[Killed] MethodCallRemoval
Application/UseCases/CreateInstitution/CreateInstitution.php:18:9
 {
     public function __construct(InstitutionRepositoryContract $institutionRepository)
     {
-        parent::__construct($institutionRepository);
+        
     }
 
killedBy: Tests\Feature\Core\Institution\Application\UseCases\CreateInstitution\CreateInstitutionTest::test_execute_should_save_and_return_object
statusReason: 1) Tests\Feature\Core\Institution\Application\UseCases\CreateInstitution\CreateInstitutionTest::test_execute_should_save_and_return_object
Error: Typed property Core\Institution\Application\UseCases\UseCasesService::$institutionRepository must not be accessed before initialization

/var/www/abacusSystem-new/src/core/Institution/Application/UseCases/CreateInstitution/CreateInstitution.php:29
/var/w

[Killed] MethodCallRemoval
Application/UseCases/CreateInstitution/CreateInstitution.php:26:9
      */
     public function execute(RequestService $request): Institution
     {
-        $this->validateRequest($request, CreateInstitutionRequest::class);
+        
 
         /** @var CreateInstitutionRequest $request */
killedBy: Tests\Feature\Core\Institution\Application\UseCases\CreateInstitution\CreateInstitutionTest::test_execute_should_return_exception
statusReason: 1) Tests\Feature\Core\Institution\Application\UseCases\CreateInstitution\CreateInstitutionTest::test_execute_should_return_exception
Failed asserting that exception of type "Error" matches expected exception "Exception". Message was: "Call to undefined method MockObject_SearchInstitutionByIdRequest_d8b7d30a::institution()" at
/var/www/abacusSystem-new/src/core/Institution/Application/UseCases/Crea

[Survived] MethodCallRemoval
Application/UseCases/CreateInstitution/CreateInstitution.php:30:9
 
         /** @var CreateInstitutionRequest $request */
         $institution = $request->institution();
-        $institution->refreshSearch();
+        
 
         /** @var CreateInstitutionRequest $request */
