[Killed] PublicVisibility
Application/UseCases/CreateInstitution/CreateInstitutionRequest.php:22:5
         $this->institution = $institution;
     }
 
-    public function institution(): Institution
+    protected function institution(): Institution
     {
         return $this->institution;
killedBy: Tests\Feature\Core\Institution\Application\UseCases\CreateInstitution\CreateInstitutionRequestTest::test_institution_should_return_object
statusReason: 1) Tests\Feature\Core\Institution\Application\UseCases\CreateInstitution\CreateInstitutionRequestTest::test_institution_should_return_object
Error: Call to protected method Core\Institution\Application\UseCases\CreateInstitution\CreateInstitutionRequest::institution() from scope Tests\Feature\Core\Institution\Application\UseCases\CreateInstitution\CreateInstitutionRequestTest

/var/www/abacusSyste
