[Killed] MethodCallRemoval
Application/UseCases/DeleteInstitution/DeleteInstitution.php:26:9
      */
     public function execute(RequestService $request): null
     {
-        $this->validateRequest($request, DeleteInstitutionRequest::class);
+        
 
         /** @var DeleteInstitutionRequest $request */
killedBy: Tests\Feature\Core\Institution\Application\UseCases\DeleteInstitution\DeleteInstitutionTest::test_execute_should_return_exception
statusReason: 1) Tests\Feature\Core\Institution\Application\UseCases\DeleteInstitution\DeleteInstitutionTest::test_execute_should_return_exception
Failed asserting that exception of type "Error" matches expected exception "Exception". Message was: "Call to undefined method MockObject_CreateInstitutionRequest_3703469c::id()" at
/var/www/abacusSystem-new/src/core/Institution/Application/UseCases/DeleteInstitution

[Killed] MethodCallRemoval
Application/UseCases/DeleteInstitution/DeleteInstitution.php:29:9
         $this->validateRequest($request, DeleteInstitutionRequest::class);
 
         /** @var DeleteInstitutionRequest $request */
-        $this->institutionRepository->delete($request->id());
+        
 
         return null;
killedBy: Tests\Feature\Core\Institution\Application\UseCases\DeleteInstitution\DeleteInstitutionTest::test_execute_should_return_null
statusReason: 1) Tests\Feature\Core\Institution\Application\UseCases\DeleteInstitution\DeleteInstitutionTest::test_execute_should_return_null
Expectation failed for method name is "delete" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.
