[Killed] PublicVisibility
Application/UseCases/DeleteInstitution/DeleteInstitutionRequest.php:21:5
         $this->id = $id;
     }
 
-    public function id(): InstitutionId
+    protected function id(): InstitutionId
     {
         return $this->id;
killedBy: Tests\Feature\Core\Institution\Application\UseCases\DeleteInstitution\DeleteInstitutionRequestTest::test_id_should_return_object
statusReason: 1) Tests\Feature\Core\Institution\Application\UseCases\DeleteInstitution\DeleteInstitutionRequestTest::test_id_should_return_object
Error: Call to protected method Core\Institution\Application\UseCases\DeleteInstitution\DeleteInstitutionRequest::id() from scope Tests\Feature\Core\Institution\Application\UseCases\DeleteInstitution\DeleteInstitutionRequestTest

/var/www/abacusSystem-new/tests/Featur
