[Killed] MethodCallRemoval
Application/UseCases/SearchInstitution/SearchInstitutionById.php:27:9
      */
     public function execute(RequestService $request): null|Institution
     {
-        $this->validateRequest($request, SearchInstitutionByIdRequest::class);
+        
 
         /** @var SearchInstitutionByIdRequest $request */
killedBy: Tests\Feature\Core\Institution\Application\UseCases\SearchInstitution\SearchInstitutionByIdTest::test_execute_should_return_exception
statusReason: 1) Tests\Feature\Core\Institution\Application\UseCases\SearchInstitution\SearchInstitutionByIdTest::test_execute_should_return_exception
Failed asserting that exception of type "Error" matches expected exception "Exception". Message was: "Call to undefined method MockObject_SearchInstitutionsRequest_4da23a1e::institutionId()" at
/var/www/abacusSystem-new/src/core/Institution/Application/UseCases/S
