[Killed] PublicVisibility
Application/UseCases/SearchInstitution/SearchInstitutionByIdRequest.php:22:5
         $this->id = $id;
     }
 
-    public function institutionId(): InstitutionId
+    protected function institutionId(): InstitutionId
     {
         return $this->id;
killedBy: Tests\Feature\Core\Institution\Application\UseCases\SearchInstitution\SearchInstitutionByIdRequestTest::test_id_should_return_value_object
statusReason: 1) Tests\Feature\Core\Institution\Application\UseCases\SearchInstitution\SearchInstitutionByIdRequestTest::test_id_should_return_value_object
Error: Call to protected method Core\Institution\Application\UseCases\SearchInstitution\SearchInstitutionByIdRequest::institutionId() from scope Tests\Feature\Core\Institution\Application\UseCases\SearchInstitution\SearchInstitutionByIdRequestTest

/var/www/
