[Killed] MethodCallRemoval
Application/UseCases/SearchInstitution/SearchInstitutions.php:27:9
      */
     public function execute(RequestService $request): null|Institutions
     {
-        $this->validateRequest($request, SearchInstitutionsRequest::class);
+        
 
         /** @var SearchInstitutionsRequest $request */
killedBy: Tests\Feature\Core\Institution\Application\UseCases\SearchInstitution\SearchInstitutionsTest::test_execute_should_return_exception
statusReason: 1) Tests\Feature\Core\Institution\Application\UseCases\SearchInstitution\SearchInstitutionsTest::test_execute_should_return_exception
Failed asserting that exception of type "Error" matches expected exception "Exception". Message was: "Call to undefined method MockObject_SearchInstitutionByIdRequest_c7de014d::filters()" at
/var/www/abacusSystem-new/src/core/Institution/Application/UseCases/SearchI
