[Killed] MethodCallRemoval
Application/UseCases/UpdateInstitution/UpdateInstitution.php:27:9
      */
     public function execute(RequestService $request): Institution
     {
-        $this->validateRequest($request, UpdateInstitutionRequest::class);
+        
 
         /** @var UpdateInstitutionRequest $request */
killedBy: Tests\Feature\Core\Institution\Application\UseCases\UpdateInstitution\UpdateInstitutionTest::test_execute_should_return_exception
statusReason: 1) Tests\Feature\Core\Institution\Application\UseCases\UpdateInstitution\UpdateInstitutionTest::test_execute_should_return_exception
Failed asserting that exception of type "Error" matches expected exception "Exception". Message was: "Call to undefined method MockObject_CreateInstitutionRequest_2cea7bc5::id()" at
/var/www/abacusSystem-new/src/core/Institution/Application/UseCases/UpdateInstitution

[Killed] Foreach_
Application/UseCases/UpdateInstitution/UpdateInstitution.php:31:9
 
         /** @var UpdateInstitutionRequest $request */
         $institution = $this->institutionRepository->find($request->id());
-        foreach ($request->data() as $field => $value) {
-            $methodName = 'change'.ucfirst($field);
-
-            if (is_callable([$this, $methodName])) {
-                $institution = $this->{$methodName}($institution, $value);
-            }
-        }
+        foreach ([] as $field => $value) {
 
         $institution->refreshSearch();
statusReason: 1) Tests\Feature\Core\Institution\Application\UseCases\UpdateInstitution\UpdateInstitutionTest::test_execute_should_update_and_return_object with data set #0 (['code', 'name', 'shortname', 'logo', 'observations', 2, DateTime Object (...)])
Expectation failed for method name is "data" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Asserti

[Killed] ConcatOperandRemoval
Application/UseCases/UpdateInstitution/UpdateInstitution.php:32:13
         /** @var UpdateInstitutionRequest $request */
         $institution = $this->institutionRepository->find($request->id());
         foreach ($request->data() as $field => $value) {
-            $methodName = 'change'.ucfirst($field);
+            $methodName = ucfirst($field);
 
             if (is_callable([$this, $methodName])) {
statusReason: 1) Tests\Feature\Core\Institution\Application\UseCases\UpdateInstitution\UpdateInstitutionTest::test_execute_should_update_and_return_object with data set #0 (['code', 'name', 'shortname', 'logo', 'observations', 2, DateTime Object (...)])
Expectation failed for method name is "code" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Asserti

[Killed] IfNegation
Application/UseCases/UpdateInstitution/UpdateInstitution.php:34:13
         foreach ($request->data() as $field => $value) {
             $methodName = 'change'.ucfirst($field);
 
-            if (is_callable([$this, $methodName])) {
-                $institution = $this->{$methodName}($institution, $value);
-            }
+            if (!is_callable([$this, $methodName])) {
         }
 
statusReason: 1) Tests\Feature\Core\Institution\Application\UseCases\UpdateInstitution\UpdateInstitutionTest::test_execute_should_update_and_return_object with data set #0 (['code', 'name', 'shortname', 'logo', 'observations', 2, DateTime Object (...)])
Expectation failed for method name is "code" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Asserti

[Killed] MethodCallRemoval
Application/UseCases/UpdateInstitution/UpdateInstitution.php:39:9
             }
         }
 
-        $institution->refreshSearch();
+        
 
         return $this->institutionRepository->persistInstitution($institution);
statusReason: 1) Tests\Feature\Core\Institution\Application\UseCases\UpdateInstitution\UpdateInstitutionTest::test_execute_should_update_and_return_object with data set #0 (['code', 'name', 'shortname', 'logo', 'observations', 2, DateTime Object (...)])
Expectation failed for method name is "refreshSearch" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1

[Killed] MethodCallRemoval
Application/UseCases/UpdateInstitution/UpdateInstitution.php:46:9
 
     private function changeCode(Institution $institution, string $code): Institution
     {
-        $institution->code()->setValue($code);
+        
 
         return $institution;
statusReason: 1) Tests\Feature\Core\Institution\Application\UseCases\UpdateInstitution\UpdateInstitutionTest::test_execute_should_update_and_return_object with data set #0 (['code', 'name', 'shortname', 'logo', 'observations', 2, DateTime Object (...)])
Expectation failed for method name is "code" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Asserti

[Killed] MethodCallRemoval
Application/UseCases/UpdateInstitution/UpdateInstitution.php:53:9
 
     private function changeName(Institution $institution, string $name): Institution
     {
-        $institution->name()->setValue($name);
+        
 
         return $institution;
statusReason: 1) Tests\Feature\Core\Institution\Application\UseCases\UpdateInstitution\UpdateInstitutionTest::test_execute_should_update_and_return_object with data set #0 (['code', 'name', 'shortname', 'logo', 'observations', 2, DateTime Object (...)])
Expectation failed for method name is "name" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Asserti

[Killed] MethodCallRemoval
Application/UseCases/UpdateInstitution/UpdateInstitution.php:60:9
 
     private function changeShortname(Institution $institution, string $shortname): Institution
     {
-        $institution->shortname()->setValue($shortname);
+        
 
         return $institution;
statusReason: 1) Tests\Feature\Core\Institution\Application\UseCases\UpdateInstitution\UpdateInstitutionTest::test_execute_should_update_and_return_object with data set #0 (['code', 'name', 'shortname', 'logo', 'observations', 2, DateTime Object (...)])
Expectation failed for method name is "shortname" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, As

[Killed] MethodCallRemoval
Application/UseCases/UpdateInstitution/UpdateInstitution.php:67:9
 
     private function changeLogo(Institution $institution, string $logo): Institution
     {
-        $institution->logo()->setValue($logo);
+        
 
         return $institution;
statusReason: 1) Tests\Feature\Core\Institution\Application\UseCases\UpdateInstitution\UpdateInstitutionTest::test_execute_should_update_and_return_object with data set #0 (['code', 'name', 'shortname', 'logo', 'observations', 2, DateTime Object (...)])
Expectation failed for method name is "logo" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Asserti

[Killed] MethodCallRemoval
Application/UseCases/UpdateInstitution/UpdateInstitution.php:74:9
 
     private function changeObservations(Institution $institution, string $observations): Institution
     {
-        $institution->observations()->setValue($observations);
+        
 
         return $institution;
statusReason: 1) Tests\Feature\Core\Institution\Application\UseCases\UpdateInstitution\UpdateInstitutionTest::test_execute_should_update_and_return_object with data set #0 (['code', 'name', 'shortname', 'logo', 'observations', 2, DateTime Object (...)])
Expectation failed for method name is "observations" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1,

[Killed] MethodCallRemoval
Application/UseCases/UpdateInstitution/UpdateInstitution.php:84:9
      */
     private function changeState(Institution $institution, int $state): Institution
     {
-        $institution->state()->setValue($state);
+        
 
         return $institution;
statusReason: 1) Tests\Feature\Core\Institution\Application\UseCases\UpdateInstitution\UpdateInstitutionTest::test_execute_should_update_and_return_object with data set #0 (['code', 'name', 'shortname', 'logo', 'observations', 2, DateTime Object (...)])
Expectation failed for method name is "state" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assert

[Killed] MethodCallRemoval
Application/UseCases/UpdateInstitution/UpdateInstitution.php:91:9
 
     private function changeUpdatedAt(Institution $institution, \DateTime $dateTime): Institution
     {
-        $institution->updatedAt()->setValue($dateTime);
+        
 
         return $institution;
statusReason: 1) Tests\Feature\Core\Institution\Application\UseCases\UpdateInstitution\UpdateInstitutionTest::test_execute_should_update_and_return_object with data set #0 (['code', 'name', 'shortname', 'logo', 'observations', 2, DateTime Object (...)])
Expectation failed for method name is "updatedAt" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, As
