[Killed] PublicVisibility
core/Institution/Domain/Institution.php:59:5
         return $this->id;
     }
 
-    public function setId(InstitutionId $id): self
+    protected function setId(InstitutionId $id): self
     {
         $this->id = $id;
killedBy: Tests\Feature\Core\Institution\Domain\InstitutionTest::test_setId_should_return_self
statusReason: 1) Tests\Feature\Core\Institution\Domain\InstitutionTest::test_setId_should_return_self
Error: Call to protected method Core\Institution\Domain\Institution::setId() from scope Tests\Feature\Core\Institution\Domain\InstitutionTest

/var/www/abacusSystem-new/tests/Feature/Core/Institution/Domain/InstitutionTest.php:66

ERRORS!
Tests: 21, Assertions: 47, Errors: 1.

[Killed] PublicVisibility
core/Institution/Domain/Institution.php:65:5
         return $this;
     }
 
-    public function name(): InstitutionName
+    protected function name(): InstitutionName
     {
         return $this->name;
killedBy: Tests\Feature\Core\Institution\Domain\InstitutionTest::test_setName_should_return_self
statusReason: 1) Tests\Feature\Core\Institution\Domain\InstitutionTest::test_setName_should_return_self
Error: Call to protected method Core\Institution\Domain\Institution::name() from scope Tests\Feature\Core\Institution\Domain\InstitutionTest

/var/www/abacusSystem-new/tests/Feature/Core/Institution/Domain/InstitutionTest.php:91

2) Tests\Feature\Core\Institution\Domain\InstitutionTest::test_name_should_retur

[Killed] PublicVisibility
core/Institution/Domain/Institution.php:70:5
         return $this->name;
     }
 
-    public function setName(InstitutionName $name): self
+    protected function setName(InstitutionName $name): self
     {
         $this->name = $name;
killedBy: Tests\Feature\Core\Institution\Domain\InstitutionTest::test_refreshSearch_should_update_and_return_self
statusReason: 1) Tests\Feature\Core\Institution\Domain\InstitutionTest::test_refreshSearch_should_update_and_return_self
Error: Call to protected method Core\Institution\Domain\Institution::setName() from scope Tests\Feature\Core\Institution\Domain\InstitutionTest

/var/www/abacusSystem-new/tests/Feature/Core/Institution/Domain/InstitutionTest.php:270

2) Tests\Feature\Core\Institution\Domain\InstitutionTest::t

[Killed] PublicVisibility
core/Institution/Domain/Institution.php:76:5
         return $this;
     }
 
-    public function shortname(): InstitutionShortname
+    protected function shortname(): InstitutionShortname
     {
         return $this->shortname;
killedBy: Tests\Feature\Core\Institution\Domain\InstitutionTest::test_setShortname_should_return_self
statusReason: 1) Tests\Feature\Core\Institution\Domain\InstitutionTest::test_setShortname_should_return_self
Error: Call to protected method Core\Institution\Domain\Institution::shortname() from scope Tests\Feature\Core\Institution\Domain\InstitutionTest

/var/www/abacusSystem-new/tests/Feature/Core/Institution/Domain/InstitutionTest.php:111

2) Tests\Feature\Core\Institution\Domain\InstitutionTest::test_shortn

[Killed] PublicVisibility
core/Institution/Domain/Institution.php:81:5
         return $this->shortname;
     }
 
-    public function setShortname(InstitutionShortname $shortname): self
+    protected function setShortname(InstitutionShortname $shortname): self
     {
         $this->shortname = $shortname;
killedBy: Tests\Feature\Core\Institution\Domain\InstitutionTest::test_refreshSearch_should_update_and_return_self
statusReason: 1) Tests\Feature\Core\Institution\Domain\InstitutionTest::test_refreshSearch_should_update_and_return_self
Error: Call to protected method Core\Institution\Domain\Institution::setShortname() from scope Tests\Feature\Core\Institution\Domain\InstitutionTest

/var/www/abacusSystem-new/tests/Feature/Core/Institution/Domain/InstitutionTest.php:276

2) Tests\Feature\Core\Institution\Domain\InstitutionTe

[Killed] PublicVisibility
core/Institution/Domain/Institution.php:87:5
         return $this;
     }
 
-    public function code(): InstitutionCode
+    protected function code(): InstitutionCode
     {
         return $this->code;
killedBy: Tests\Feature\Core\Institution\Domain\InstitutionTest::test_setCode_should_return_self
statusReason: 1) Tests\Feature\Core\Institution\Domain\InstitutionTest::test_setCode_should_return_self
Error: Call to protected method Core\Institution\Domain\Institution::code() from scope Tests\Feature\Core\Institution\Domain\InstitutionTest

/var/www/abacusSystem-new/tests/Feature/Core/Institution/Domain/InstitutionTest.php:131

2) Tests\Feature\Core\Institution\Domain\InstitutionTest::test_code_should_retu

[Killed] PublicVisibility
core/Institution/Domain/Institution.php:92:5
         return $this->code;
     }
 
-    public function setCode(InstitutionCode $code): self
+    protected function setCode(InstitutionCode $code): self
     {
         $this->code = $code;
killedBy: Tests\Feature\Core\Institution\Domain\InstitutionTest::test_refreshSearch_should_update_and_return_self
statusReason: 1) Tests\Feature\Core\Institution\Domain\InstitutionTest::test_refreshSearch_should_update_and_return_self
Error: Call to protected method Core\Institution\Domain\Institution::setCode() from scope Tests\Feature\Core\Institution\Domain\InstitutionTest

/var/www/abacusSystem-new/tests/Feature/Core/Institution/Domain/InstitutionTest.php:264

2) Tests\Feature\Core\Institution\Domain\InstitutionTest::t

[Killed] PublicVisibility
core/Institution/Domain/Institution.php:98:5
         return $this;
     }
 
-    public function logo(): InstitutionLogo
+    protected function logo(): InstitutionLogo
     {
         return $this->logo;
killedBy: Tests\Feature\Core\Institution\Domain\InstitutionTest::test_setLogo_should_return_self
statusReason: 1) Tests\Feature\Core\Institution\Domain\InstitutionTest::test_setLogo_should_return_self
Error: Call to protected method Core\Institution\Domain\Institution::logo() from scope Tests\Feature\Core\Institution\Domain\InstitutionTest

/var/www/abacusSystem-new/tests/Feature/Core/Institution/Domain/InstitutionTest.php:151

2) Tests\Feature\Core\Institution\Domain\InstitutionTest::test_logo_should_retu

[Killed] PublicVisibility
core/Institution/Domain/Institution.php:103:5
         return $this->logo;
     }
 
-    public function setLogo(InstitutionLogo $logo): self
+    protected function setLogo(InstitutionLogo $logo): self
     {
         $this->logo = $logo;
killedBy: Tests\Feature\Core\Institution\Domain\InstitutionTest::test_setLogo_should_return_self
statusReason: 1) Tests\Feature\Core\Institution\Domain\InstitutionTest::test_setLogo_should_return_self
Error: Call to protected method Core\Institution\Domain\Institution::setLogo() from scope Tests\Feature\Core\Institution\Domain\InstitutionTest

/var/www/abacusSystem-new/tests/Feature/Core/Institution/Domain/InstitutionTest.php:147

ERRORS!
Tests: 21, Assertions: 47, Errors: 1.

[Killed] PublicVisibility
core/Institution/Domain/Institution.php:109:5
         return $this;
     }
 
-    public function observations(): InstitutionObservations
+    protected function observations(): InstitutionObservations
     {
         return $this->observations;
killedBy: Tests\Feature\Core\Institution\Domain\InstitutionTest::test_setObservations_should_return_self
statusReason: 1) Tests\Feature\Core\Institution\Domain\InstitutionTest::test_setObservations_should_return_self
Error: Call to protected method Core\Institution\Domain\Institution::observations() from scope Tests\Feature\Core\Institution\Domain\InstitutionTest

/var/www/abacusSystem-new/tests/Feature/Core/Institution/Domain/InstitutionTest.php:171

2) Tests\Feature\Core\Institution\Domain\InstitutionTest::test_

[Killed] PublicVisibility
core/Institution/Domain/Institution.php:114:5
         return $this->observations;
     }
 
-    public function setObservations(InstitutionObservations $observations): self
+    protected function setObservations(InstitutionObservations $observations): self
     {
         $this->observations = $observations;
killedBy: Tests\Feature\Core\Institution\Domain\InstitutionTest::test_refreshSearch_should_update_and_return_self
statusReason: 1) Tests\Feature\Core\Institution\Domain\InstitutionTest::test_refreshSearch_should_update_and_return_self
Error: Call to protected method Core\Institution\Domain\Institution::setObservations() from scope Tests\Feature\Core\Institution\Domain\InstitutionTest

/var/www/abacusSystem-new/tests/Feature/Core/Institution/Domain/InstitutionTest.php:282

2) Tests\Feature\Core\Institution\Domain\Institutio

[Killed] PublicVisibility
core/Institution/Domain/Institution.php:120:5
         return $this;
     }
 
-    public function state(): InstitutionState
+    protected function state(): InstitutionState
     {
         return $this->state;
killedBy: Tests\Feature\Core\Institution\Domain\InstitutionTest::test_setState_should_return_self
statusReason: 1) Tests\Feature\Core\Institution\Domain\InstitutionTest::test_setState_should_return_self
Error: Call to protected method Core\Institution\Domain\Institution::state() from scope Tests\Feature\Core\Institution\Domain\InstitutionTest

/var/www/abacusSystem-new/tests/Feature/Core/Institution/Domain/InstitutionTest.php:192

2) Tests\Feature\Core\Institution\Domain\InstitutionTest::test_state_should_r

[Killed] PublicVisibility
core/Institution/Domain/Institution.php:125:5
         return $this->state;
     }
 
-    public function setState(InstitutionState $state): self
+    protected function setState(InstitutionState $state): self
     {
         $this->state = $state;
killedBy: Tests\Feature\Core\Institution\Domain\InstitutionTest::test_setState_should_return_self
statusReason: 1) Tests\Feature\Core\Institution\Domain\InstitutionTest::test_setState_should_return_self
Error: Call to protected method Core\Institution\Domain\Institution::setState() from scope Tests\Feature\Core\Institution\Domain\InstitutionTest

/var/www/abacusSystem-new/tests/Feature/Core/Institution/Domain/InstitutionTest.php:188

ERRORS!
Tests: 21, Assertions: 47, Errors: 1.

[Killed] PublicVisibility
core/Institution/Domain/Institution.php:131:5
         return $this;
     }
 
-    public function search(): InstitutionSearch
+    protected function search(): InstitutionSearch
     {
         return $this->search;
killedBy: Tests\Feature\Core\Institution\Domain\InstitutionTest::test_setSearch_should_return_self
statusReason: 1) Tests\Feature\Core\Institution\Domain\InstitutionTest::test_setSearch_should_return_self
Error: Call to protected method Core\Institution\Domain\Institution::search() from scope Tests\Feature\Core\Institution\Domain\InstitutionTest

/var/www/abacusSystem-new/tests/Feature/Core/Institution/Domain/InstitutionTest.php:212

2) Tests\Feature\Core\Institution\Domain\InstitutionTest::test_search_shoul

[Killed] PublicVisibility
core/Institution/Domain/Institution.php:136:5
         return $this->search;
     }
 
-    public function setSearch(InstitutionSearch $search): self
+    protected function setSearch(InstitutionSearch $search): self
     {
         $this->search = $search;
killedBy: Tests\Feature\Core\Institution\Domain\InstitutionTest::test_refreshSearch_should_update_and_return_self
statusReason: 1) Tests\Feature\Core\Institution\Domain\InstitutionTest::test_refreshSearch_should_update_and_return_self
Error: Call to protected method Core\Institution\Domain\Institution::setSearch() from scope Tests\Feature\Core\Institution\Domain\InstitutionTest

/var/www/abacusSystem-new/tests/Feature/Core/Institution/Domain/InstitutionTest.php:289

2) Tests\Feature\Core\Institution\Domain\InstitutionTest:

[Killed] PublicVisibility
core/Institution/Domain/Institution.php:142:5
         return $this;
     }
 
-    public function createdAt(): InstitutionCreatedAt
+    protected function createdAt(): InstitutionCreatedAt
     {
         return $this->createdAt;
killedBy: Tests\Feature\Core\Institution\Domain\InstitutionTest::test_setCreatedAt_should_return_self
statusReason: 1) Tests\Feature\Core\Institution\Domain\InstitutionTest::test_setCreatedAt_should_return_self
Error: Call to protected method Core\Institution\Domain\Institution::createdAt() from scope Tests\Feature\Core\Institution\Domain\InstitutionTest

/var/www/abacusSystem-new/tests/Feature/Core/Institution/Domain/InstitutionTest.php:232

2) Tests\Feature\Core\Institution\Domain\InstitutionTest::test_create

[Killed] PublicVisibility
core/Institution/Domain/Institution.php:147:5
         return $this->createdAt;
     }
 
-    public function setCreatedAt(InstitutionCreatedAt $createdAt): self
+    protected function setCreatedAt(InstitutionCreatedAt $createdAt): self
     {
         $this->createdAt = $createdAt;
killedBy: Tests\Feature\Core\Institution\Domain\InstitutionTest::test_setCreatedAt_should_return_self
statusReason: 1) Tests\Feature\Core\Institution\Domain\InstitutionTest::test_setCreatedAt_should_return_self
Error: Call to protected method Core\Institution\Domain\Institution::setCreatedAt() from scope Tests\Feature\Core\Institution\Domain\InstitutionTest

/var/www/abacusSystem-new/tests/Feature/Core/Institution/Domain/InstitutionTest.php:228

ERRORS!
Tests: 21, Assertions: 47, Errors: 1.

[Killed] PublicVisibility
core/Institution/Domain/Institution.php:153:5
         return $this;
     }
 
-    public function updatedAt(): InstitutionUpdatedAt
+    protected function updatedAt(): InstitutionUpdatedAt
     {
         return $this->updatedAt;
killedBy: Tests\Feature\Core\Institution\Domain\InstitutionTest::test_setUpdatedAt_should_return_self
statusReason: 1) Tests\Feature\Core\Institution\Domain\InstitutionTest::test_setUpdatedAt_should_return_self
Error: Call to protected method Core\Institution\Domain\Institution::updatedAt() from scope Tests\Feature\Core\Institution\Domain\InstitutionTest

/var/www/abacusSystem-new/tests/Feature/Core/Institution/Domain/InstitutionTest.php:252

2) Tests\Feature\Core\Institution\Domain\InstitutionTest::test_update

[Killed] PublicVisibility
core/Institution/Domain/Institution.php:158:5
         return $this->updatedAt;
     }
 
-    public function setUpdatedAt(InstitutionUpdatedAt $updatedAt): self
+    protected function setUpdatedAt(InstitutionUpdatedAt $updatedAt): self
     {
         $this->updatedAt = $updatedAt;
killedBy: Tests\Feature\Core\Institution\Domain\InstitutionTest::test_setUpdatedAt_should_return_self
statusReason: 1) Tests\Feature\Core\Institution\Domain\InstitutionTest::test_setUpdatedAt_should_return_self
Error: Call to protected method Core\Institution\Domain\Institution::setUpdatedAt() from scope Tests\Feature\Core\Institution\Domain\InstitutionTest

/var/www/abacusSystem-new/tests/Feature/Core/Institution/Domain/InstitutionTest.php:248

ERRORS!
Tests: 21, Assertions: 47, Errors: 1.

[Killed] PublicVisibility
core/Institution/Domain/Institution.php:164:5
         return $this;
     }
 
-    public function refreshSearch(): self
+    protected function refreshSearch(): self
     {
         $data = [
killedBy: Tests\Feature\Core\Institution\Domain\InstitutionTest::test_refreshSearch_should_update_and_return_self
statusReason: 1) Tests\Feature\Core\Institution\Domain\InstitutionTest::test_refreshSearch_should_update_and_return_self
Error: Call to protected method Core\Institution\Domain\Institution::refreshSearch() from scope Tests\Feature\Core\Institution\Domain\InstitutionTest

/var/www/abacusSystem-new/tests/Feature/Core/Institution/Domain/InstitutionTest.php:291

ERRORS!
Tests: 21, Assertions: 43, Errors: 1.
