[Killed] Foreach_
core/Institution/Domain/Institutions.php:17:9
 
     public function __construct(Institution ...$institutions)
     {
-        foreach ($institutions as $institution) {
-            $this->addItem($institution);
-        }
+        foreach ([] as $institution) {
     }
 
killedBy: Tests\Feature\Core\Institution\Domain\InstitutionsTest::test_addItem_should_return_self
statusReason: 1) Tests\Feature\Core\Institution\Domain\InstitutionsTest::test_addItem_should_return_self
Failed asserting that actual size 1 matches expected size 2.

/var/www/abacusSystem-new/tests/Feature/Core/Institution/Domain/InstitutionsTest.php:44

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
core/Institution/Domain/Institutions.php:18:13
     public function __construct(Institution ...$institutions)
     {
         foreach ($institutions as $institution) {
-            $this->addItem($institution);
+            
         }
     }
killedBy: Tests\Feature\Core\Institution\Domain\InstitutionsTest::test_addItem_should_return_self
statusReason: 1) Tests\Feature\Core\Institution\Domain\InstitutionsTest::test_addItem_should_return_self
Failed asserting that actual size 1 matches expected size 2.

/var/www/abacusSystem-new/tests/Feature/Core/Institution/Domain/InstitutionsTest.php:44

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.
