[Killed] Foreach_
Institution/Infrastructure/Commands/InstitutionWarmup.php:63:13
         try {
             $institution = $this->readRepository->find($institutionId);
 
-            foreach ($this->repositories as $repository) {
-                $repository->persistInstitution($institution);
-            }
+            foreach ([] as $repository) {
         } catch (Exception $exception) {
             $this->logger->error($exception->getMessage(), $exception->getTrace());
killedBy: Tests\Feature\Core\Institution\Infrastructure\Commands\InstitutionWarmupTest::test_handle_should_update_institution_in_repositories
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Commands\InstitutionWarmupTest::test_handle_should_update_institution_in_repositories
Expectation failed for method name is "persistInstitution" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 6, Failures: 1.

[Killed] MethodCallRemoval
Institution/Infrastructure/Commands/InstitutionWarmup.php:64:17
             $institution = $this->readRepository->find($institutionId);
 
             foreach ($this->repositories as $repository) {
-                $repository->persistInstitution($institution);
+                
             }
         } catch (Exception $exception) {
killedBy: Tests\Feature\Core\Institution\Infrastructure\Commands\InstitutionWarmupTest::test_handle_should_update_institution_in_repositories
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Commands\InstitutionWarmupTest::test_handle_should_update_institution_in_repositories
Expectation failed for method name is "persistInstitution" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 6, Failures: 1.

[Killed] MethodCallRemoval
Institution/Infrastructure/Commands/InstitutionWarmup.php:72:9
             return CommandSymfony::FAILURE;
         }
 
-        $this->logger->info('Institution command executed');
+        
 
         return CommandSymfony::SUCCESS;
killedBy: Tests\Feature\Core\Institution\Infrastructure\Commands\InstitutionWarmupTest::test_handle_should_update_institution_in_repositories
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Commands\InstitutionWarmupTest::test_handle_should_update_institution_in_repositories
Expectation failed for method name is "info" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.
