[Killed] Foreach_
Institution/Infrastructure/Management/InstitutionService.php:70:9
         $request = new SearchInstitutionsRequest($filters);
         $institutions = $this->searchInstitutions->execute($request);
 
-        foreach ($institutions->aggregator() as $item) {
-            $institution = $this->searchInstitutionById($item);
-            $institutions->addItem($institution);
-        }
+        foreach ([] as $item) {
 
         return $institutions;
killedBy: Tests\Feature\Core\Institution\Infrastructure\Management\InstitutionServiceTest::test_searchInstitutions_should_return_object
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Management\InstitutionServiceTest::test_searchInstitutions_should_return_object
Expectation failed for method name is "buildInstitutionId" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
Institution/Infrastructure/Management/InstitutionService.php:72:13
 
         foreach ($institutions->aggregator() as $item) {
             $institution = $this->searchInstitutionById($item);
-            $institutions->addItem($institution);
+            
         }
 
killedBy: Tests\Feature\Core\Institution\Infrastructure\Management\InstitutionServiceTest::test_searchInstitutions_should_return_object
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Management\InstitutionServiceTest::test_searchInstitutions_should_return_object
Expectation failed for method name is "addItem" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 6, Failures: 1.

[Killed] MethodCallRemoval
Institution/Infrastructure/Management/InstitutionService.php:111:9
             $this->institutionFactory->buildInstitutionId($id)
         );
 
-        $this->deleteInstitution->execute($request);
+        
     }
 }
killedBy: Tests\Feature\Core\Institution\Infrastructure\Management\InstitutionServiceTest::test_deleteInstitution_should_return_object
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Management\InstitutionServiceTest::test_deleteInstitution_should_return_object
Expectation failed for method name is "execute" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.
