[Survived] ArrayItemRemoval
Persistence/Eloquent/Model/Institution.php:76:9
 
     protected function casts(): array
     {
-        return [
-            'created_at' => 'datetime:Y-m-d H:i:s',
-            'updated_at' => 'datetime:Y-m-d H:i:s',
-            'deleted_at' => 'datetime:Y-m-d H:i:s',
-        ];
+        return ['updated_at' => 'datetime:Y-m-d H:i:s', 'deleted_at' => 'datetime:Y-m-d H:i:s'];
     }
 

[Killed] MethodCallRemoval
Persistence/Eloquent/Model/Institution.php:95:9
 
     public function changeId(?int $id): self
     {
-        $this->setAttribute('inst_id', $id);
+        
         return $this;
     }
killedBy: Tests\Feature\Core\Institution\Infrastructure\Persistence\Eloquent\Model\InstitutionTest::test_id_should_change_and_return_int
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Persistence\Eloquent\Model\InstitutionTest::test_id_should_change_and_return_int
Failed asserting that null is identical to 1.

/var/www/abacusSystem-new/tests/Feature/Core/Institution/Infrastructure/Persistence/Eloquent/Model/InstitutionTest.php:47

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] PublicVisibility
Persistence/Eloquent/Model/Institution.php:99:5
         return $this;
     }
 
-    public function code(): ?string
+    protected function code(): ?string
     {
         return $this->getAttribute('inst_code');
killedBy: Tests\Feature\Core\Institution\Infrastructure\Persistence\Eloquent\Model\InstitutionTest::test_code_should_change_and_return_string
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Persistence\Eloquent\Model\InstitutionTest::test_code_should_change_and_return_string
BadMethodCallException: Call to undefined method Core\Institution\Infrastructure\Persistence\Eloquent\Model\Institution::code()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/vendor/l

[Killed] PublicVisibility
Persistence/Eloquent/Model/Institution.php:104:5
         return $this->getAttribute('inst_code');
     }
 
-    public function changeCode(?string $code): self
+    protected function changeCode(?string $code): self
     {
         $this->setAttribute('inst_code', $code);
killedBy: Tests\Feature\Core\Institution\Infrastructure\Persistence\Eloquent\Model\InstitutionTest::test_code_should_change_and_return_string
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Persistence\Eloquent\Model\InstitutionTest::test_code_should_change_and_return_string
BadMethodCallException: Call to undefined method Core\Institution\Infrastructure\Persistence\Eloquent\Model\Institution::changeCode()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/ve

[Killed] MethodCallRemoval
Persistence/Eloquent/Model/Institution.php:106:9
 
     public function changeCode(?string $code): self
     {
-        $this->setAttribute('inst_code', $code);
+        
         return $this;
     }
killedBy: Tests\Feature\Core\Institution\Infrastructure\Persistence\Eloquent\Model\InstitutionTest::test_code_should_change_and_return_string
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Persistence\Eloquent\Model\InstitutionTest::test_code_should_change_and_return_string
Failed asserting that null is identical to 'test'.

/var/www/abacusSystem-new/tests/Feature/Core/Institution/Infrastructure/Persistence/Eloquent/Model/InstitutionTest.php:62

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] PublicVisibility
Persistence/Eloquent/Model/Institution.php:115:5
         return $this->getAttribute('inst_name');
     }
 
-    public function changeName(?string $name): self
+    protected function changeName(?string $name): self
     {
         $this->setAttribute('inst_name', $name);
killedBy: Tests\Feature\Core\Institution\Infrastructure\Persistence\Eloquent\Model\InstitutionTest::test_name_should_change_and_return_string
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Persistence\Eloquent\Model\InstitutionTest::test_name_should_change_and_return_string
BadMethodCallException: Call to undefined method Core\Institution\Infrastructure\Persistence\Eloquent\Model\Institution::changeName()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/ve

[Killed] MethodCallRemoval
Persistence/Eloquent/Model/Institution.php:117:9
 
     public function changeName(?string $name): self
     {
-        $this->setAttribute('inst_name', $name);
+        
         return $this;
     }
killedBy: Tests\Feature\Core\Institution\Infrastructure\Persistence\Eloquent\Model\InstitutionTest::test_name_should_change_and_return_string
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Persistence\Eloquent\Model\InstitutionTest::test_name_should_change_and_return_string
Failed asserting that null is identical to 'test'.

/var/www/abacusSystem-new/tests/Feature/Core/Institution/Infrastructure/Persistence/Eloquent/Model/InstitutionTest.php:77

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] PublicVisibility
Persistence/Eloquent/Model/Institution.php:121:5
         return $this;
     }
 
-    public function shortname(): ?string
+    protected function shortname(): ?string
     {
         return $this->getAttribute('inst_shortname');
killedBy: Tests\Feature\Core\Institution\Infrastructure\Persistence\Eloquent\Model\InstitutionTest::test_shortname_should_change_and_return_string
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Persistence\Eloquent\Model\InstitutionTest::test_shortname_should_change_and_return_string
BadMethodCallException: Call to undefined method Core\Institution\Infrastructure\Persistence\Eloquent\Model\Institution::shortname()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-ne

[Killed] PublicVisibility
Persistence/Eloquent/Model/Institution.php:126:5
         return $this->getAttribute('inst_shortname');
     }
 
-    public function changeShortname(?string $shortname): self
+    protected function changeShortname(?string $shortname): self
     {
         $this->setAttribute('inst_shortname', $shortname);
killedBy: Tests\Feature\Core\Institution\Infrastructure\Persistence\Eloquent\Model\InstitutionTest::test_shortname_should_change_and_return_string
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Persistence\Eloquent\Model\InstitutionTest::test_shortname_should_change_and_return_string
BadMethodCallException: Call to undefined method Core\Institution\Infrastructure\Persistence\Eloquent\Model\Institution::changeShortname()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSys

[Killed] MethodCallRemoval
Persistence/Eloquent/Model/Institution.php:128:9
 
     public function changeShortname(?string $shortname): self
     {
-        $this->setAttribute('inst_shortname', $shortname);
+        
         return $this;
     }
killedBy: Tests\Feature\Core\Institution\Infrastructure\Persistence\Eloquent\Model\InstitutionTest::test_shortname_should_change_and_return_string
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Persistence\Eloquent\Model\InstitutionTest::test_shortname_should_change_and_return_string
Failed asserting that null is identical to 'test'.

/var/www/abacusSystem-new/tests/Feature/Core/Institution/Infrastructure/Persistence/Eloquent/Model/InstitutionTest.php:92

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] PublicVisibility
Persistence/Eloquent/Model/Institution.php:132:5
         return $this;
     }
 
-    public function logo(): ?string
+    protected function logo(): ?string
     {
         return $this->getAttribute('inst_logo');
killedBy: Tests\Feature\Core\Institution\Infrastructure\Persistence\Eloquent\Model\InstitutionTest::test_logo_should_change_and_return_string
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Persistence\Eloquent\Model\InstitutionTest::test_logo_should_change_and_return_string
BadMethodCallException: Call to undefined method Core\Institution\Infrastructure\Persistence\Eloquent\Model\Institution::logo()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/vendor/l

[Killed] PublicVisibility
Persistence/Eloquent/Model/Institution.php:137:5
         return $this->getAttribute('inst_logo');
     }
 
-    public function changeLogo(?string $logo): self
+    protected function changeLogo(?string $logo): self
     {
         $this->setAttribute('inst_logo', $logo);
killedBy: Tests\Feature\Core\Institution\Infrastructure\Persistence\Eloquent\Model\InstitutionTest::test_logo_should_change_and_return_string
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Persistence\Eloquent\Model\InstitutionTest::test_logo_should_change_and_return_string
BadMethodCallException: Call to undefined method Core\Institution\Infrastructure\Persistence\Eloquent\Model\Institution::changeLogo()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/ve

[Killed] MethodCallRemoval
Persistence/Eloquent/Model/Institution.php:139:9
 
     public function changeLogo(?string $logo): self
     {
-        $this->setAttribute('inst_logo', $logo);
+        
         return $this;
     }
killedBy: Tests\Feature\Core\Institution\Infrastructure\Persistence\Eloquent\Model\InstitutionTest::test_logo_should_change_and_return_string
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Persistence\Eloquent\Model\InstitutionTest::test_logo_should_change_and_return_string
Failed asserting that null is identical to 'test'.

/var/www/abacusSystem-new/tests/Feature/Core/Institution/Infrastructure/Persistence/Eloquent/Model/InstitutionTest.php:107

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
Persistence/Eloquent/Model/Institution.php:150:9
 
     public function changeObservations(?string $observations): self
     {
-        $this->setAttribute('inst_observations', $observations);
+        
         return $this;
     }
killedBy: Tests\Feature\Core\Institution\Infrastructure\Persistence\Eloquent\Model\InstitutionTest::test_observations_should_change_and_return_string
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Persistence\Eloquent\Model\InstitutionTest::test_observations_should_change_and_return_string
Failed asserting that null is identical to 'test'.

/var/www/abacusSystem-new/tests/Feature/Core/Institution/Infrastructure/Persistence/Eloquent/Model/InstitutionTest.php:122

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
Persistence/Eloquent/Model/Institution.php:161:9
 
     public function changeSearch(string $search): self
     {
-        $this->setAttribute('inst_search', $search);
+        
         return $this;
     }
killedBy: Tests\Feature\Core\Institution\Infrastructure\Persistence\Eloquent\Model\InstitutionTest::test_search_should_change_and_return_string
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Persistence\Eloquent\Model\InstitutionTest::test_search_should_change_and_return_string
Failed asserting that null is identical to 'test'.

/var/www/abacusSystem-new/tests/Feature/Core/Institution/Infrastructure/Persistence/Eloquent/Model/InstitutionTest.php:197

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
Persistence/Eloquent/Model/Institution.php:172:9
 
     public function changeState(int $state): self
     {
-        $this->setAttribute('inst_state', $state);
+        
         return $this;
     }
killedBy: Tests\Feature\Core\Institution\Infrastructure\Persistence\Eloquent\Model\InstitutionTest::test_state_should_change_and_return_string
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Persistence\Eloquent\Model\InstitutionTest::test_state_should_change_and_return_string
Failed asserting that 1 is identical to 2.

/var/www/abacusSystem-new/tests/Feature/Core/Institution/Infrastructure/Persistence/Eloquent/Model/InstitutionTest.php:138

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.
