[NoCoverage] Concat
Infrastructure/Persistence/Repositories/ChainInstitutionRepository.php:46:13
         try {
             return $this->read(__FUNCTION__, $id);
         } catch (Exception $exception) {
-            throw new InstitutionNotFoundException('Institution not found by id '. $id->value());
+            throw new InstitutionNotFoundException($id->value() . 'Institution not found by id ');
         }
     }

[NoCoverage] ConcatOperandRemoval
Infrastructure/Persistence/Repositories/ChainInstitutionRepository.php:46:13
         try {
             return $this->read(__FUNCTION__, $id);
         } catch (Exception $exception) {
-            throw new InstitutionNotFoundException('Institution not found by id '. $id->value());
+            throw new InstitutionNotFoundException($id->value());
         }
     }

[NoCoverage] Throw_
Infrastructure/Persistence/Repositories/ChainInstitutionRepository.php:60:13
         try {
             return $this->read(__FUNCTION__, $filters);
         } catch (Exception $exception) {
-            throw new InstitutionsNotFoundException('Institutions not found');
+            new InstitutionsNotFoundException('Institutions not found');
         }
     }
