[Killed] IfNegation
Infrastructure/Persistence/Repositories/EloquentInstitutionRepository.php:65:9
             ->where('inst_state', '>', ValueObjectStatus::STATE_DELETE);
 
         $data = $builder->first();
-        if (is_null($data)) {
-            throw new InstitutionNotFoundException('Institution not found with id '.$id->value());
-        }
+        if (!is_null($data)) {
 
         $institutionModel = $this->updateAttributesModelInstitution((array) $data);
killedBy: Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_find_should_return_object
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_find_should_return_object
Core\Institution\Domain\ValueObjects\InstitutionId::value(): int was not expected to be called more than once.

/var/www/abacusSystem-new/src/core/Institution/Infrastructure/Persistence/Repositories/EloquentInstitutionRepository.php:54
/var/www/abacusSystem-ne

[Killed] Throw_
Infrastructure/Persistence/Repositories/EloquentInstitutionRepository.php:66:13
 
         $data = $builder->first();
         if (is_null($data)) {
-            throw new InstitutionNotFoundException('Institution not found with id '.$id->value());
+            new InstitutionNotFoundException('Institution not found with id ' . $id->value());
         }
 
killedBy: Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_find_should_return_exception
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_find_should_return_exception
Illuminate\Database\Eloquent\Model::fill([]) was not expected to be called.

/var/www/abacusSystem-new/src/core/Institution/Infrastructure/Persistence/Repositories/EloquentInstitutionRepository.php:137
/var/www/abacusSystem-new/src/core/Institution/Infrastr

[Killed] ConcatOperandRemoval
Infrastructure/Persistence/Repositories/EloquentInstitutionRepository.php:66:13
 
         $data = $builder->first();
         if (is_null($data)) {
-            throw new InstitutionNotFoundException('Institution not found with id '.$id->value());
+            throw new InstitutionNotFoundException('Institution not found with id ');
         }
 
killedBy: Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_find_should_return_exception
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_find_should_return_exception
Failed asserting that exception message 'Institution not found with id ' contains 'Institution not found with id 1'.

FAILURES!
Tests: 1, Assertions: 6, Failures: 1.

[Killed] CastArray
Infrastructure/Persistence/Repositories/EloquentInstitutionRepository.php:69:9
             throw new InstitutionNotFoundException('Institution not found with id '.$id->value());
         }
 
-        $institutionModel = $this->updateAttributesModelInstitution((array) $data);
+        $institutionModel = $this->updateAttributesModelInstitution($data);
 
         return $this->institutionTranslator->setModel($institutionModel)->toDomain();
killedBy: Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_find_should_return_object
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_find_should_return_object

/var/www/abacusSystem-new/src/core/Institution/Infrastructure/Persistence/Repositories/EloquentInstitutionRepository.php:135
/var/www/abacusSystem-new/src/core/Institution/Infrastructure/Persistence/Repositories/EloquentInstitutionRepository.php:56
/var/www/a

[Killed] IfNegation
Infrastructure/Persistence/Repositories/EloquentInstitutionRepository.php:87:9
         }
 
         $institutionCollection = $builder->get(['inst_id']);
-        if (is_null($institutionCollection)) {
-            throw new InstitutionsNotFoundException('Institutions not found');
-        }
+        if (!is_null($institutionCollection)) {
 
         $collection = [];
killedBy: Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_getAll_should_return_collection
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_getAll_should_return_exception
Failed asserting that exception of type "ErrorException" matches expected exception "Core\Institution\Exceptions\InstitutionsNotFoundException". Message was: "foreach() argument must be of type array|object, null given" at
/var/www/abacusSystem-new/vendor

[Killed] Throw_
Infrastructure/Persistence/Repositories/EloquentInstitutionRepository.php:88:13
 
         $institutionCollection = $builder->get(['inst_id']);
         if (is_null($institutionCollection)) {
-            throw new InstitutionsNotFoundException('Institutions not found');
+            new InstitutionsNotFoundException('Institutions not found');
         }
 
killedBy: Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_getAll_should_return_exception
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_getAll_should_return_exception
Failed asserting that exception of type "ErrorException" matches expected exception "Core\Institution\Exceptions\InstitutionsNotFoundException". Message was: "foreach() argument must be of type array|object, null given" at
/var/www/abacusSystem-new/vendor

[Killed] Foreach_
Infrastructure/Persistence/Repositories/EloquentInstitutionRepository.php:92:9
         }
 
         $collection = [];
-        foreach ($institutionCollection as $item) {
-            $institutionModel = $this->updateAttributesModelInstitution((array) $item);
-            $collection[] = $institutionModel->id();
-        }
+        foreach ([] as $item) {
 
         $institutions = $this->institutionTranslator->setCollection($collection)->toDomainCollection();
killedBy: Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_getAll_should_return_collection
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_getAll_should_return_collection
Expectation failed for method name is "setCollection" when invoked 1 time
Parameter 0 for invocation Core\Institution\Infrastructure\Persistence\Translators\InstitutionTranslator::setCollection([]): Core\Institution\Infrastructure\Persistence\Translators

[Killed] CastArray
Infrastructure/Persistence/Repositories/EloquentInstitutionRepository.php:93:13
 
         $collection = [];
         foreach ($institutionCollection as $item) {
-            $institutionModel = $this->updateAttributesModelInstitution((array) $item);
+            $institutionModel = $this->updateAttributesModelInstitution($item);
             $collection[] = $institutionModel->id();
         }
killedBy: Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_getAll_should_return_collection
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_getAll_should_return_collection

/var/www/abacusSystem-new/src/core/Institution/Infrastructure/Persistence/Repositories/EloquentInstitutionRepository.php:135
/var/www/abacusSystem-new/src/core/Institution/Infrastructure/Persistence/Repositories/EloquentInstitutionRepository.php:74
/var

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentInstitutionRepository.php:98:9
         }
 
         $institutions = $this->institutionTranslator->setCollection($collection)->toDomainCollection();
-        $institutions->setFilters($filters);
+        
 
         return $institutions;
killedBy: Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_getAll_should_return_collection
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_getAll_should_return_collection
Expectation failed for method name is "setFilters" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 9, Failures: 1.

[Killed] IfNegation
Infrastructure/Persistence/Repositories/EloquentInstitutionRepository.php:113:9
             ->where('inst_id', $id->value());
         $data = $builder->first();
 
-        if (is_null($data)) {
-            throw new InstitutionNotFoundException('Institution not found with id '.$id->value());
-        }
+        if (!is_null($data)) {
 
         $institutionModel = $this->updateAttributesModelInstitution((array) $data);
killedBy: Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_delete_should_return_void
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_delete_should_return_void
Core\Institution\Domain\ValueObjects\InstitutionId::value(): int was not expected to be called more than once.

/var/www/abacusSystem-new/src/core/Institution/Infrastructure/Persistence/Repositories/EloquentInstitutionRepository.php:90
/var/www/abacusSystem-ne

[Killed] Concat
Infrastructure/Persistence/Repositories/EloquentInstitutionRepository.php:114:13
         $data = $builder->first();
 
         if (is_null($data)) {
-            throw new InstitutionNotFoundException('Institution not found with id '.$id->value());
+            throw new InstitutionNotFoundException($id->value() . 'Institution not found with id ');
         }
 
killedBy: Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_delete_should_return_exception
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_delete_should_return_exception
Failed asserting that exception message '1Institution not found with id ' contains 'Institution not found with id 1'.

FAILURES!
Tests: 1, Assertions: 6, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentInstitutionRepository.php:118:9
         }
 
         $institutionModel = $this->updateAttributesModelInstitution((array) $data);
-        $institutionModel->changeState(ValueObjectStatus::STATE_DELETE);
+        
         $institutionModel->changeDeletedAt(new \DateTime);
 
killedBy: Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_delete_should_return_void
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_delete_should_return_void
Expectation failed for method name is "changeState" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 6, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentInstitutionRepository.php:119:9
 
         $institutionModel = $this->updateAttributesModelInstitution((array) $data);
         $institutionModel->changeState(ValueObjectStatus::STATE_DELETE);
-        $institutionModel->changeDeletedAt(new \DateTime);
+        
 
         $builder->update($institutionModel->toArray());
killedBy: Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_delete_should_return_void
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_delete_should_return_void
Expectation failed for method name is "changeDeletedAt" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 6, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentInstitutionRepository.php:121:9
         $institutionModel->changeState(ValueObjectStatus::STATE_DELETE);
         $institutionModel->changeDeletedAt(new \DateTime);
 
-        $builder->update($institutionModel->toArray());
+        
     }
 
killedBy: Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_delete_should_return_void
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_delete_should_return_void
Expectation failed for method name is "toArray" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 6, Failures: 1.

[Killed] IfNegation
Infrastructure/Persistence/Repositories/EloquentInstitutionRepository.php:135:9
 
         $builder = $this->databaseManager->table($this->getTable());
 
-        if (is_null($institutionId)) {
-            $institutionId = $builder->insertGetId($dataModel);
-            $institution->id()->setValue($institutionId);
-        } else {
-            $builder->where('inst_id', $institutionId);
-            $builder->update($dataModel);
-        }
+        if (!is_null($institutionId)) {
 
         return $institution;
killedBy: Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_persistInstitution_should_save_and_return_object
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_persistInstitution_should_update_and_return_object
Core\Institution\Domain\Institution::id(): Core\Institution\Domain\ValueObjects\InstitutionId was not expected to be called more than 2 times.

/var/www/abacusSystem-new/src/core/Institution/Infrastructure/Persistence/Repositories/Eloq

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentInstitutionRepository.php:137:13
 
         if (is_null($institutionId)) {
             $institutionId = $builder->insertGetId($dataModel);
-            $institution->id()->setValue($institutionId);
+            
         } else {
             $builder->where('inst_id', $institutionId);
killedBy: Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_persistInstitution_should_save_and_return_object
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_persistInstitution_should_save_and_return_object
Expectation failed for method name is "id" when invoked 3 times.
Method was expected to be called 3 times, actually called 2 times.

FAILURES!
Tests: 1, Assertions: 8, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentInstitutionRepository.php:139:13
             $institutionId = $builder->insertGetId($dataModel);
             $institution->id()->setValue($institutionId);
         } else {
-            $builder->where('inst_id', $institutionId);
+            
             $builder->update($dataModel);
         }
killedBy: Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_persistInstitution_should_update_and_return_object
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_persistInstitution_should_update_and_return_object
Mockery\Exception\InvalidCountException: Method where('inst_id', 1) from Mockery_1_Illuminate_Database_Query_Builder should be called
 exactly 1 times but called 0 times.

/var/www/abacusSystem-new/vendor/mockery/mockery/library/Mocker

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentInstitutionRepository.php:140:13
             $institution->id()->setValue($institutionId);
         } else {
             $builder->where('inst_id', $institutionId);
-            $builder->update($dataModel);
+            
         }
 
killedBy: Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_persistInstitution_should_update_and_return_object
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_persistInstitution_should_update_and_return_object
Mockery\Exception\InvalidCountException: Method update(<Any Arguments>) from Mockery_1_Illuminate_Database_Query_Builder should be called
 exactly 1 times but called 0 times.

/var/www/abacusSystem-new/vendor/mockery/mockery/library/Mo

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentInstitutionRepository.php:149:9
     private function domainToModel(Institution $domain): InstitutionModel
     {
         $builder = $this->databaseManager->table($this->getTable());
-        $builder->where('inst_id', $domain->id()->value());
+        
         $data = $builder->first();
 
killedBy: Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_persistInstitution_should_save_and_return_object
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_persistInstitution_should_save_and_return_object
Expectation failed for method name is "id" when invoked 3 times.
Method was expected to be called 3 times, actually called 2 times.

FAILURES!
Tests: 1, Assertions: 8, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentInstitutionRepository.php:153:9
         $data = $builder->first();
 
         $model = $this->updateAttributesModelInstitution((array) $data);
-        $model->changeId($domain->id()->value());
+        
         $model->changeName($domain->name()->value());
         $model->changeShortname($domain->shortname()->value());
killedBy: Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_persistInstitution_should_save_and_return_object
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_persistInstitution_should_save_and_return_object
Expectation failed for method name is "changeId" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 7, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentInstitutionRepository.php:154:9
 
         $model = $this->updateAttributesModelInstitution((array) $data);
         $model->changeId($domain->id()->value());
-        $model->changeName($domain->name()->value());
+        
         $model->changeShortname($domain->shortname()->value());
         $model->changeCode($domain->code()->value());
killedBy: Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_persistInstitution_should_save_and_return_object
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_persistInstitution_should_save_and_return_object
Expectation failed for method name is "changeName" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 7, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentInstitutionRepository.php:155:9
         $model = $this->updateAttributesModelInstitution((array) $data);
         $model->changeId($domain->id()->value());
         $model->changeName($domain->name()->value());
-        $model->changeShortname($domain->shortname()->value());
+        
         $model->changeCode($domain->code()->value());
         $model->changeLogo($domain->logo()->value());
killedBy: Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_persistInstitution_should_save_and_return_object
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_persistInstitution_should_save_and_return_object
Expectation failed for method name is "changeShortname" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 7, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentInstitutionRepository.php:156:9
         $model->changeId($domain->id()->value());
         $model->changeName($domain->name()->value());
         $model->changeShortname($domain->shortname()->value());
-        $model->changeCode($domain->code()->value());
+        
         $model->changeLogo($domain->logo()->value());
         $model->changeObservations($domain->observations()->value());
killedBy: Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_persistInstitution_should_save_and_return_object
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_persistInstitution_should_save_and_return_object
Expectation failed for method name is "changeCode" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 7, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentInstitutionRepository.php:157:9
         $model->changeName($domain->name()->value());
         $model->changeShortname($domain->shortname()->value());
         $model->changeCode($domain->code()->value());
-        $model->changeLogo($domain->logo()->value());
+        
         $model->changeObservations($domain->observations()->value());
         $model->changeSearch($domain->search()->value());
killedBy: Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_persistInstitution_should_save_and_return_object
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_persistInstitution_should_save_and_return_object
Expectation failed for method name is "changeLogo" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 7, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentInstitutionRepository.php:158:9
         $model->changeShortname($domain->shortname()->value());
         $model->changeCode($domain->code()->value());
         $model->changeLogo($domain->logo()->value());
-        $model->changeObservations($domain->observations()->value());
+        
         $model->changeSearch($domain->search()->value());
         $model->changeState($domain->state()->value());
killedBy: Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_persistInstitution_should_save_and_return_object
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_persistInstitution_should_save_and_return_object
Expectation failed for method name is "changeObservations" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 7, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentInstitutionRepository.php:159:9
         $model->changeCode($domain->code()->value());
         $model->changeLogo($domain->logo()->value());
         $model->changeObservations($domain->observations()->value());
-        $model->changeSearch($domain->search()->value());
+        
         $model->changeState($domain->state()->value());
         $model->changeCreatedAt($domain->createdAt()->value());
killedBy: Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_persistInstitution_should_save_and_return_object
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_persistInstitution_should_save_and_return_object
Expectation failed for method name is "changeSearch" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 7, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentInstitutionRepository.php:160:9
         $model->changeLogo($domain->logo()->value());
         $model->changeObservations($domain->observations()->value());
         $model->changeSearch($domain->search()->value());
-        $model->changeState($domain->state()->value());
+        
         $model->changeCreatedAt($domain->createdAt()->value());
 
killedBy: Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_persistInstitution_should_save_and_return_object
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_persistInstitution_should_save_and_return_object
Expectation failed for method name is "changeState" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 7, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentInstitutionRepository.php:161:9
         $model->changeObservations($domain->observations()->value());
         $model->changeSearch($domain->search()->value());
         $model->changeState($domain->state()->value());
-        $model->changeCreatedAt($domain->createdAt()->value());
+        
 
         if (!is_null($domain->updatedAt()->value())) {
killedBy: Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_persistInstitution_should_save_and_return_object
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\EloquentInstitutionRepositoryTest::test_persistInstitution_should_save_and_return_object
Expectation failed for method name is "changeCreatedAt" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 7, Failures: 1.
