[Killed] ConcatOperandRemoval
Infrastructure/Persistence/Repositories/RedisInstitutionRepository.php:71:13
             $data = Redis::get($this->institutionKey($id));
         } catch (Exception $exception) {
             $this->logger->error($exception->getMessage(), $exception->getTrace());
-            throw new InstitutionsNotFoundException('Institution not found by id '. $id->value());
+            throw new InstitutionsNotFoundException('Institution not found by id ');
         }
 
killedBy: Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\RedisInstitutionRepositoryTest::test_find_should_return_exception
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\RedisInstitutionRepositoryTest::test_find_should_return_exception
Failed asserting that exception message 'Institution not found by id ' contains 'Institution not found by id 1'.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] ConcatOperandRemoval
Infrastructure/Persistence/Repositories/RedisInstitutionRepository.php:71:13
             $data = Redis::get($this->institutionKey($id));
         } catch (Exception $exception) {
             $this->logger->error($exception->getMessage(), $exception->getTrace());
-            throw new InstitutionsNotFoundException('Institution not found by id '. $id->value());
+            throw new InstitutionsNotFoundException($id->value());
         }
 
killedBy: Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\RedisInstitutionRepositoryTest::test_find_should_return_exception
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\RedisInstitutionRepositoryTest::test_find_should_return_exception
Failed asserting that exception message '1' contains 'Institution not found by id 1'.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/RedisInstitutionRepository.php:96:9
 
     public function delete(InstitutionId $id): void
     {
-        Redis::delete($this->institutionKey($id));
+        
     }
 
killedBy: Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\RedisInstitutionRepositoryTest::test_delete_should_return_void
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\RedisInstitutionRepositoryTest::test_delete_should_return_void
Expectation failed for method name is "value" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/RedisInstitutionRepository.php:108:13
         $institutionData = $this->dataTransformer->write($institution)->read();
 
         try {
-            Redis::set($institutionKey, json_encode($institutionData));
+            
         } catch (Exception $exception) {
             $this->logger->error($exception->getMessage(), $exception->getTrace());
killedBy: Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\RedisInstitutionRepositoryTest::test_persistInstitution_should_return_object
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\RedisInstitutionRepositoryTest::test_persistInstitution_should_return_exception
Failed asserting that exception of type "Core\Institution\Exceptions\InstitutionPersistException" is thrown.

ERRORS!
Tests: 2, Assertions: 8, Errors: 1, Failures: 1.

[Killed] Throw_
Infrastructure/Persistence/Repositories/RedisInstitutionRepository.php:111:13
             Redis::set($institutionKey, json_encode($institutionData));
         } catch (Exception $exception) {
             $this->logger->error($exception->getMessage(), $exception->getTrace());
-            throw new InstitutionPersistException('It could not persist Institution with key '.$institutionKey.' in redis');
+            new InstitutionPersistException('It could not persist Institution with key ' . $institutionKey . ' in redis');
         }
 
killedBy: Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\RedisInstitutionRepositoryTest::test_persistInstitution_should_return_exception
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\RedisInstitutionRepositoryTest::test_persistInstitution_should_return_exception
Failed asserting that exception of type "Core\Institution\Exceptions\InstitutionPersistException" is thrown.

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] Concat
Infrastructure/Persistence/Repositories/RedisInstitutionRepository.php:111:13
             Redis::set($institutionKey, json_encode($institutionData));
         } catch (Exception $exception) {
             $this->logger->error($exception->getMessage(), $exception->getTrace());
-            throw new InstitutionPersistException('It could not persist Institution with key '.$institutionKey.' in redis');
+            throw new InstitutionPersistException('It could not persist Institution with key ' . ' in redis' . $institutionKey);
         }
 
killedBy: Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\RedisInstitutionRepositoryTest::test_persistInstitution_should_return_exception
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Persistence\Repositories\RedisInstitutionRepositoryTest::test_persistInstitution_should_return_exception
Failed asserting that exception message 'It could not persist Institution with key  in redisinstitution::2' contains 'It could not persist Institution with key institution::2'.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.
