[Survived] MethodCallRemoval
Infrastructure/Persistence/Translators/InstitutionTranslator.php:48:9
             $this->institutionFactory->buildInstitutionName($this->institution->name())
         );
 
-        $institution->setShortname($this->institutionFactory->buildInstitutionShortname($this->institution->shortname()));
+        
         $institution->setCode($this->institutionFactory->buildInstitutionCode($this->institution->code()));
         $institution->setLogo($this->institutionFactory->buildInstitutionLogo($this->institution->logo()));

[Survived] MethodCallRemoval
Infrastructure/Persistence/Translators/InstitutionTranslator.php:49:9
         );
 
         $institution->setShortname($this->institutionFactory->buildInstitutionShortname($this->institution->shortname()));
-        $institution->setCode($this->institutionFactory->buildInstitutionCode($this->institution->code()));
+        
         $institution->setLogo($this->institutionFactory->buildInstitutionLogo($this->institution->logo()));
         $institution->setState($this->institutionFactory->buildInstitutionState($this->institution->state()));

[Survived] MethodCallRemoval
Infrastructure/Persistence/Translators/InstitutionTranslator.php:50:9
 
         $institution->setShortname($this->institutionFactory->buildInstitutionShortname($this->institution->shortname()));
         $institution->setCode($this->institutionFactory->buildInstitutionCode($this->institution->code()));
-        $institution->setLogo($this->institutionFactory->buildInstitutionLogo($this->institution->logo()));
+        
         $institution->setState($this->institutionFactory->buildInstitutionState($this->institution->state()));
         $institution->setObservations($this->institutionFactory->buildInstitutionObservations($this->institution->observations()));

[Survived] MethodCallRemoval
Infrastructure/Persistence/Translators/InstitutionTranslator.php:51:9
         $institution->setShortname($this->institutionFactory->buildInstitutionShortname($this->institution->shortname()));
         $institution->setCode($this->institutionFactory->buildInstitutionCode($this->institution->code()));
         $institution->setLogo($this->institutionFactory->buildInstitutionLogo($this->institution->logo()));
-        $institution->setState($this->institutionFactory->buildInstitutionState($this->institution->state()));
+        
         $institution->setObservations($this->institutionFactory->buildInstitutionObservations($this->institution->observations()));
         $institution->setCreatedAt($this->institutionFactory->buildInstitutionCreatedAt($this->institution->createdAt()));

[Survived] MethodCallRemoval
Infrastructure/Persistence/Translators/InstitutionTranslator.php:52:9
         $institution->setCode($this->institutionFactory->buildInstitutionCode($this->institution->code()));
         $institution->setLogo($this->institutionFactory->buildInstitutionLogo($this->institution->logo()));
         $institution->setState($this->institutionFactory->buildInstitutionState($this->institution->state()));
-        $institution->setObservations($this->institutionFactory->buildInstitutionObservations($this->institution->observations()));
+        
         $institution->setCreatedAt($this->institutionFactory->buildInstitutionCreatedAt($this->institution->createdAt()));
         $institution->setUpdatedAt($this->institutionFactory->buildInstitutionUpdatedAt($this->institution->updatedAt()));

[Survived] MethodCallRemoval
Infrastructure/Persistence/Translators/InstitutionTranslator.php:53:9
         $institution->setLogo($this->institutionFactory->buildInstitutionLogo($this->institution->logo()));
         $institution->setState($this->institutionFactory->buildInstitutionState($this->institution->state()));
         $institution->setObservations($this->institutionFactory->buildInstitutionObservations($this->institution->observations()));
-        $institution->setCreatedAt($this->institutionFactory->buildInstitutionCreatedAt($this->institution->createdAt()));
+        
         $institution->setUpdatedAt($this->institutionFactory->buildInstitutionUpdatedAt($this->institution->updatedAt()));
         $institution->setSearch($this->institutionFactory->buildInstitutionSearch($this->institution->search()));

[Survived] MethodCallRemoval
Infrastructure/Persistence/Translators/InstitutionTranslator.php:54:9
         $institution->setState($this->institutionFactory->buildInstitutionState($this->institution->state()));
         $institution->setObservations($this->institutionFactory->buildInstitutionObservations($this->institution->observations()));
         $institution->setCreatedAt($this->institutionFactory->buildInstitutionCreatedAt($this->institution->createdAt()));
-        $institution->setUpdatedAt($this->institutionFactory->buildInstitutionUpdatedAt($this->institution->updatedAt()));
+        
         $institution->setSearch($this->institutionFactory->buildInstitutionSearch($this->institution->search()));
 

[Survived] MethodCallRemoval
Infrastructure/Persistence/Translators/InstitutionTranslator.php:55:9
         $institution->setObservations($this->institutionFactory->buildInstitutionObservations($this->institution->observations()));
         $institution->setCreatedAt($this->institutionFactory->buildInstitutionCreatedAt($this->institution->createdAt()));
         $institution->setUpdatedAt($this->institutionFactory->buildInstitutionUpdatedAt($this->institution->updatedAt()));
-        $institution->setSearch($this->institutionFactory->buildInstitutionSearch($this->institution->search()));
+        
 
         return $institution;

[Killed] PublicVisibility
Infrastructure/Persistence/Translators/InstitutionTranslator.php:66:5
         return $this;
     }
 
-    public function toDomainCollection(): Institutions
+    protected function toDomainCollection(): Institutions
     {
         $institutions = new Institutions;
killedBy: Tests\Feature\Core\Institution\Infrastructure\Persistence\Translators\InstitutionTranslatorTest::test_toDomainCollection_should_return_object
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Persistence\Translators\InstitutionTranslatorTest::test_toDomainCollection_should_return_object
Error: Call to protected method Core\Institution\Infrastructure\Persistence\Translators\InstitutionTranslator::toDomainCollection() from scope Tests\Feature\Core\Institution\Infrastructure\Persistence\Translators\InstitutionTranslatorTest

/var/www/abacus

[Killed] Foreach_
Infrastructure/Persistence/Translators/InstitutionTranslator.php:69:9
     public function toDomainCollection(): Institutions
     {
         $institutions = new Institutions;
-        foreach ($this->collection as $id) {
-            $institutions->addId($id);
-        }
+        foreach ([] as $id) {
 
         return $institutions;
killedBy: Tests\Feature\Core\Institution\Infrastructure\Persistence\Translators\InstitutionTranslatorTest::test_toDomainCollection_should_return_object
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Persistence\Translators\InstitutionTranslatorTest::test_toDomainCollection_should_return_object
Failed asserting that actual size 0 matches expected size 3.

/var/www/abacusSystem-new/tests/Feature/Core/Institution/Infrastructure/Persistence/Translators/InstitutionTranslatorTest.php:104

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Translators/InstitutionTranslator.php:70:13
     {
         $institutions = new Institutions;
         foreach ($this->collection as $id) {
-            $institutions->addId($id);
+            
         }
 
killedBy: Tests\Feature\Core\Institution\Infrastructure\Persistence\Translators\InstitutionTranslatorTest::test_toDomainCollection_should_return_object
statusReason: 1) Tests\Feature\Core\Institution\Infrastructure\Persistence\Translators\InstitutionTranslatorTest::test_toDomainCollection_should_return_object
Failed asserting that actual size 0 matches expected size 3.

/var/www/abacusSystem-new/tests/Feature/Core/Institution/Infrastructure/Persistence/Translators/InstitutionTranslatorTest.php:104

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.
