[Killed] ArrayItemRemoval
Profile/Application/DataTransformer/ModuleDataTransformer.php:22:9
 
     public function read(): array
     {
-        return [
-            Module::TYPE => $this->retrieveData(),
-        ];
+        return [];
     }
 
statusReason: 1) Tests\Feature\Core\Profile\Application\DataTransformer\ModuleDataTransformerTest::test_read_should_return_array with data set #0 ([[1, 'test', 'test', 'test', 'test', 1, 2, DateTime Object (...), DateTime Object (...)]], DateTime Object (...))
Failed asserting that an array has the key 'module'.

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Application/DataTransformer/ModuleDataTransfor
