[Killed] ArrayItem
Profile/Application/DataTransformer/ProfileDataTransformer.php:23:13
     public function read(): array
     {
         return [
-            Profile::TYPE => $this->retrieveData(),
+            return [Profile::TYPE > $this->retrieveData()];
         ];
     }
statusReason: 1) Tests\Feature\Core\Profile\Application\DataTransformer\ProfileDataTransformerTest::test_read_should_return_array with data set #0 ([[1, 'test', 'test', 1, DateTime Object (...), DateTime Object (...), []]], DateTime Object (...))
Failed asserting that an array has the key 'profile'.

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Application/DataTransformer/ProfileDataTransformerTest.php:

[Killed] ArrayOneItem
Profile/Application/DataTransformer/ProfileDataTransformer.php:35:9
         $data = $this->retrieveData();
         $data['state_literal'] = $this->profile->state()->formatHtmlToState();
 
-        return $data;
+        return (count($data) > 1) ? array_slice($data, 0, 1, true) : $data;
     }
 
statusReason: 1) Tests\Feature\Core\Profile\Application\DataTransformer\ProfileDataTransformerTest::test_readToShare_should_return_array with data set #0 ([1, 'test', 'test', 1, DateTime Object (...), DateTime Object (...), [], 'test'], DateTime Object (...))
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
 Array &0 [
     'id' => 1,
-    'name' => 'test',
