[Killed] MethodCallRemoval
Profile/Application/Factory/ModuleFactory.php:39:13
         );
 
         if (isset($data['position'])) {
-            $module->position()->setValue($data['position']);
+            
         }
 
statusReason: 1) Tests\Feature\Core\Profile\Application\Factory\ModuleFactoryTest::test_buildModuleFromArray_should_return_module_object with data set #0 ([[1, 'test', 'test', 'test', 'test', 1, 2, DateTime Object (...), DateTime Object (...)]])
Failed asserting that 1 is identical to 2.

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Application/Factory/ModuleFactoryTest.php:70

FAILURES!
Tests: 1, Asser

[Survived] MethodCallRemoval
Profile/Application/Factory/ModuleFactory.php:42:9
             $module->position()->setValue($data['position']);
         }
 
-        $module->createdAt()->setValue($data['createdAt']);
+        
 
         if (isset($data['updatedAt'])) {

[Survived] MethodCallRemoval
Profile/Application/Factory/ModuleFactory.php:45:13
         $module->createdAt()->setValue($data['createdAt']);
 
         if (isset($data['updatedAt'])) {
-            $module->updatedAt()->setValue($data['updatedAt']);
+            
         }
 

[Killed] Foreach_
Profile/Application/Factory/ModuleFactory.php:128:9
         $data = $data[Modules::TYPE];
 
         $modules = new Modules;
-        foreach ($data as $item) {
-            $modules->addItem(
-                $this->buildModuleFromArray($item)
-            );
-        }
+        foreach ([] as $item) {
 
         return $modules;
statusReason: 1) Tests\Feature\Core\Profile\Application\Factory\ModuleFactoryTest::test_buildModulesFromArray_should_return_modules with data set #0 ([[[[1, 'test', 'test', 'test', 'test', 1, 2, DateTime Object (...), DateTime Object (...)]]]])
Failed asserting that actual size 0 matches expected size 1.

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Application/Factory/ModuleFactoryTest.php:123

FAILURE

[Killed] MethodCallRemoval
Profile/Application/Factory/ModuleFactory.php:129:13
 
         $modules = new Modules;
         foreach ($data as $item) {
-            $modules->addItem(
-                $this->buildModuleFromArray($item)
-            );
+            
         }
 
statusReason: 1) Tests\Feature\Core\Profile\Application\Factory\ModuleFactoryTest::test_buildModulesFromArray_should_return_modules with data set #0 ([[[[1, 'test', 'test', 'test', 'test', 1, 2, DateTime Object (...), DateTime Object (...)]]]])
Failed asserting that actual size 0 matches expected size 1.

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Application/Factory/ModuleFactoryTest.php:123

FAILURE

[Survived] DecrementInteger
Profile/Application/Factory/ModuleFactory.php:142:5
         return new ModuleSearch($search);
     }
 
-    public function buildModulePosition(int $position = 1): ModulePosition
+    public function buildModulePosition(int $position = 0): ModulePosition
     {
         return new ModulePosition($position);

[Survived] IncrementInteger
Profile/Application/Factory/ModuleFactory.php:142:5
         return new ModuleSearch($search);
     }
 
-    public function buildModulePosition(int $position = 1): ModulePosition
+    public function buildModulePosition(int $position = 2): ModulePosition
     {
         return new ModulePosition($position);
