[Killed] MethodCallRemoval
Profile/Application/Factory/ProfileFactory.php:33:9
             $this->buildProfileCreatedAt($data['createdAt'])
         );
 
-        $profile->setDescription(
-            $this->buildProfileDescription($data['description'])
-        );
+        
 
         $profile->setModulesAggregator($data['modulesAggregator']);
statusReason: 1) Tests\Feature\Core\Profile\Application\Factory\ProfileFactoryTest::test_buildProfileFromArray_should_return_profile_object with data set #0 ([[1, 'test', 1, 'test', [1, 2, 3], DateTime Object (...), DateTime Object (...)]])
Failed asserting that null is identical to 'test'.

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Application/Factory/ProfileFactoryTest.php:59

FAILURES!
Tests: 1, A

[Killed] MethodCallRemoval
Profile/Application/Factory/ProfileFactory.php:37:9
             $this->buildProfileDescription($data['description'])
         );
 
-        $profile->setModulesAggregator($data['modulesAggregator']);
+        
 
         if (isset($data['updatedAt'])) {
statusReason: 1) Tests\Feature\Core\Profile\Application\Factory\ProfileFactoryTest::test_buildProfileFromArray_should_return_profile_object with data set #0 ([[1, 'test', 1, 'test', [1, 2, 3], DateTime Object (...), DateTime Object (...)]])
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
-Array &0 [
-    0 => 1,
-    1 => 2,

[Survived] MethodCallRemoval
Profile/Application/Factory/ProfileFactory.php:40:13
         $profile->setModulesAggregator($data['modulesAggregator']);
 
         if (isset($data['updatedAt'])) {
-            $profile->updatedAt()->setValue($data['updatedAt']);
+            
         }
 
