[Killed] MethodCallRemoval
Application/UseCases/CreateProfile/CreateProfile.php:15:9
 {
     public function __construct(ProfileRepositoryContract $profileRepository)
     {
-        parent::__construct($profileRepository);
+        
     }
 
killedBy: Tests\Feature\Core\Profile\Application\UseCases\CreateProfile\CreateProfileTest::test_execute_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Application\UseCases\CreateProfile\CreateProfileTest::test_execute_should_return_object
Error: Typed property Core\Profile\Application\UseCases\UseCasesService::$profileRepository must not be accessed before initialization

/var/www/abacusSystem-new/src/core/Profile/Application/UseCases/CreateProfile/CreateProfile.php:25
/var/www/abacusSystem-new/tests/Feature/Core/Pr

[Killed] MethodCallRemoval
Application/UseCases/CreateProfile/CreateProfile.php:23:9
      */
     public function execute(RequestService $request): Profile
     {
-        $this->validateRequest($request, CreateProfileRequest::class);
+        
 
         /** @var CreateProfileRequest $request */
killedBy: Tests\Feature\Core\Profile\Application\UseCases\CreateProfile\CreateProfileTest::test_execute_should_return_exception
statusReason: 1) Tests\Feature\Core\Profile\Application\UseCases\CreateProfile\CreateProfileTest::test_execute_should_return_exception
Failed asserting that exception of type "Error" matches expected exception "Exception". Message was: "Call to undefined method MockObject_UpdateProfileRequest_1483060e::profile()" at
/var/www/abacusSystem-new/src/core/Profile/Application/UseCases/CreateProfile/CreateProfile.php:

[Killed] MethodCallRemoval
Application/UseCases/CreateProfile/CreateProfile.php:27:9
 
         /** @var CreateProfileRequest $request */
         $profile = $request->profile();
-        $profile->refreshSearch();
+        
 
         return $this->profileRepository->persistProfile($profile);
killedBy: Tests\Feature\Core\Profile\Application\UseCases\CreateProfile\CreateProfileTest::test_execute_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Application\UseCases\CreateProfile\CreateProfileTest::test_execute_should_return_object
Expectation failed for method name is "refreshSearch" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.
