[Killed] PublicVisibility
Application/UseCases/CreateProfile/CreateProfileRequest.php:17:5
         $this->profile = $profile;
     }
 
-    public function profile(): Profile
+    protected function profile(): Profile
     {
         return $this->profile;
killedBy: Tests\Feature\Core\Profile\Application\UseCases\CreateProfile\CreateProfileRequestTest::test_profile_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Application\UseCases\CreateProfile\CreateProfileRequestTest::test_profile_should_return_object
Error: Call to protected method Core\Profile\Application\UseCases\CreateProfile\CreateProfileRequest::profile() from scope Tests\Feature\Core\Profile\Application\UseCases\CreateProfile\CreateProfileRequestTest

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Application
