[Killed] MethodCallRemoval
Application/UseCases/DeleteProfile/DeleteProfile.php:22:9
      */
     public function execute(RequestService $request): null
     {
-        $this->validateRequest($request, DeleteProfileRequest::class);
+        
 
         /** @var DeleteProfileRequest $request */
killedBy: Tests\Feature\Core\Profile\Application\UseCases\DeleteProfile\DeleteProfileTest::test_execute_should_return_exception
statusReason: 1) Tests\Feature\Core\Profile\Application\UseCases\DeleteProfile\DeleteProfileTest::test_execute_should_return_exception
Failed asserting that exception of type "Error" matches expected exception "Exception". Message was: "Call to undefined method MockObject_CreateProfileRequest_90739b67::id()" at
/var/www/abacusSystem-new/src/core/Profile/Application/UseCases/DeleteProfile/DeleteProfile.php:22
/v

[Killed] MethodCallRemoval
Application/UseCases/DeleteProfile/DeleteProfile.php:25:9
         $this->validateRequest($request, DeleteProfileRequest::class);
 
         /** @var DeleteProfileRequest $request */
-        $this->profileRepository->deleteProfile($request->id());
+        
 
         return null;
killedBy: Tests\Feature\Core\Profile\Application\UseCases\DeleteProfile\DeleteProfileTest::test_execute_should_return_null
statusReason: 1) Tests\Feature\Core\Profile\Application\UseCases\DeleteProfile\DeleteProfileTest::test_execute_should_return_null
Expectation failed for method name is "deleteProfile" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.
