[Killed] PublicVisibility
Application/UseCases/DeleteProfile/DeleteProfileRequest.php:17:5
         $this->id = $id;
     }
 
-    public function id(): ProfileId
+    protected function id(): ProfileId
     {
         return $this->id;
killedBy: Tests\Feature\Core\Profile\Application\UseCases\DeleteProfile\DeleteProfileRequestTest::test_id_should_return_value_object
statusReason: 1) Tests\Feature\Core\Profile\Application\UseCases\DeleteProfile\DeleteProfileRequestTest::test_id_should_return_value_object
Error: Call to protected method Core\Profile\Application\UseCases\DeleteProfile\DeleteProfileRequest::id() from scope Tests\Feature\Core\Profile\Application\UseCases\DeleteProfile\DeleteProfileRequestTest

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Application/Use
