[Killed] MethodCallRemoval
Application/UseCases/SearchProfile/SearchProfileById.php:23:9
      */
     public function execute(RequestService $request): ?Profile
     {
-        $this->validateRequest($request, SearchProfileByIdRequest::class);
+        
 
         /** @var SearchProfileByIdRequest $request */
killedBy: Tests\Feature\Core\Profile\Application\UseCases\SearchProfile\SearchProfileByIdTest::test_execute_should_return_exception
statusReason: 1) Tests\Feature\Core\Profile\Application\UseCases\SearchProfile\SearchProfileByIdTest::test_execute_should_return_exception
Failed asserting that exception of type "Error" matches expected exception "Exception". Message was: "Call to undefined method MockObject_DeleteProfileRequest_255b20a2::profileId()" at
/var/www/abacusSystem-new/src/core/Profile/Application/UseCases/SearchProfile/SearchProfil
