[Killed] PublicVisibility
Application/UseCases/SearchProfile/SearchProfileByIdRequest.php:17:5
         $this->id = $id;
     }
 
-    public function profileId(): ProfileId
+    protected function profileId(): ProfileId
     {
         return $this->id;
killedBy: Tests\Feature\Core\Profile\Application\UseCases\SearchProfile\SearchProfileByIdRequestTest::test_profileId_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Application\UseCases\SearchProfile\SearchProfileByIdRequestTest::test_profileId_should_return_object
Error: Call to protected method Core\Profile\Application\UseCases\SearchProfile\SearchProfileByIdRequest::profileId() from scope Tests\Feature\Core\Profile\Application\UseCases\SearchProfile\SearchProfileByIdRequestTest

/var/www/abacusSystem-new/tests/Feature/Core/Pro
