[Killed] MethodCallRemoval
Application/UseCases/SearchProfile/SearchProfiles.php:23:9
      */
     public function execute(RequestService $request): ?Profiles
     {
-        $this->validateRequest($request, SearchProfilesRequest::class);
+        
 
         /** @var SearchProfilesRequest $request */
killedBy: Tests\Feature\Core\Profile\Application\UseCases\SearchProfile\SearchProfilesTest::test_execute_should_return_exception
statusReason: 1) Tests\Feature\Core\Profile\Application\UseCases\SearchProfile\SearchProfilesTest::test_execute_should_return_exception
Failed asserting that exception of type "Error" matches expected exception "Exception". Message was: "Call to undefined method MockObject_SearchProfileByIdRequest_08899d95::filters()" at
/var/www/abacusSystem-new/src/core/Profile/Application/UseCases/SearchProfile/SearchProfile
