[Killed] MethodCallRemoval
Application/UseCases/UpdateProfile/UpdateProfile.php:23:9
      */
     public function execute(RequestService $request): Profile
     {
-        $this->validateRequest($request, UpdateProfileRequest::class);
+        
 
         /** @var UpdateProfileRequest $request */
killedBy: Tests\Feature\Core\Profile\Application\UseCases\UpdateProfile\UpdateProfileTest::test_execute_should_return_exception
statusReason: 1) Tests\Feature\Core\Profile\Application\UseCases\UpdateProfile\UpdateProfileTest::test_execute_should_return_exception
Failed asserting that exception of type "Error" matches expected exception "Exception". Message was: "Call to undefined method MockObject_CreateProfileRequest_96d3f7cd::profileId()" at
/var/www/abacusSystem-new/src/core/Profile/Application/UseCases/UpdateProfile/UpdateProfile.ph

[Killed] Foreach_
Application/UseCases/UpdateProfile/UpdateProfile.php:27:9
 
         /** @var UpdateProfileRequest $request */
         $profile = $this->profileRepository->find($request->profileId());
-        foreach ($request->data() as $field => $value) {
-            $methodName = 'change'.\ucfirst($field);
-
-            if (is_callable([$this, $methodName])) {
-                $profile = $this->{$methodName}($profile, $value);
-            }
-        }
+        foreach ([] as $field => $value) {
 
         $profile->refreshSearch();
killedBy: Tests\Feature\Core\Profile\Application\UseCases\UpdateProfile\UpdateProfileTest::test_execute_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Application\UseCases\UpdateProfile\UpdateProfileTest::test_execute_should_return_object
Expectation failed for method name is "setValue" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] ConcatOperandRemoval
Application/UseCases/UpdateProfile/UpdateProfile.php:28:13
         /** @var UpdateProfileRequest $request */
         $profile = $this->profileRepository->find($request->profileId());
         foreach ($request->data() as $field => $value) {
-            $methodName = 'change'.\ucfirst($field);
+            $methodName = 'change';
 
             if (is_callable([$this, $methodName])) {
killedBy: Tests\Feature\Core\Profile\Application\UseCases\UpdateProfile\UpdateProfileTest::test_execute_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Application\UseCases\UpdateProfile\UpdateProfileTest::test_execute_should_return_object
Expectation failed for method name is "setValue" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] ConcatOperandRemoval
Application/UseCases/UpdateProfile/UpdateProfile.php:28:13
         /** @var UpdateProfileRequest $request */
         $profile = $this->profileRepository->find($request->profileId());
         foreach ($request->data() as $field => $value) {
-            $methodName = 'change'.\ucfirst($field);
+            $methodName = \ucfirst($field);
 
             if (is_callable([$this, $methodName])) {
killedBy: Tests\Feature\Core\Profile\Application\UseCases\UpdateProfile\UpdateProfileTest::test_execute_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Application\UseCases\UpdateProfile\UpdateProfileTest::test_execute_should_return_object
Expectation failed for method name is "setValue" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] IfNegation
Application/UseCases/UpdateProfile/UpdateProfile.php:30:13
         foreach ($request->data() as $field => $value) {
             $methodName = 'change'.\ucfirst($field);
 
-            if (is_callable([$this, $methodName])) {
-                $profile = $this->{$methodName}($profile, $value);
-            }
+            if (!is_callable([$this, $methodName])) {
         }
 
killedBy: Tests\Feature\Core\Profile\Application\UseCases\UpdateProfile\UpdateProfileTest::test_execute_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Application\UseCases\UpdateProfile\UpdateProfileTest::test_execute_should_return_object
Expectation failed for method name is "setValue" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] MethodCallRemoval
Application/UseCases/UpdateProfile/UpdateProfile.php:35:9
             }
         }
 
-        $profile->refreshSearch();
+        
 
         return $this->profileRepository->persistProfile($profile);
killedBy: Tests\Feature\Core\Profile\Application\UseCases\UpdateProfile\UpdateProfileTest::test_execute_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Application\UseCases\UpdateProfile\UpdateProfileTest::test_execute_should_return_object
Expectation failed for method name is "refreshSearch" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 8, Failures: 1.

[Killed] MethodCallRemoval
Application/UseCases/UpdateProfile/UpdateProfile.php:45:9
      */
     private function changeState(Profile $profile, int $value): Profile
     {
-        $profile->state()->setValue($value);
+        
 
         return $profile;
killedBy: Tests\Feature\Core\Profile\Application\UseCases\UpdateProfile\UpdateProfileTest::test_execute_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Application\UseCases\UpdateProfile\UpdateProfileTest::test_execute_should_return_object
Expectation failed for method name is "setValue" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] MethodCallRemoval
Application/UseCases/UpdateProfile/UpdateProfile.php:52:9
 
     private function changeDescription(Profile $profile, string $value): Profile
     {
-        $profile->description()->setValue($value);
+        
 
         return $profile;
killedBy: Tests\Feature\Core\Profile\Application\UseCases\UpdateProfile\UpdateProfileTest::test_execute_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Application\UseCases\UpdateProfile\UpdateProfileTest::test_execute_should_return_object
Expectation failed for method name is "setValue" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.

[Killed] MethodCallRemoval
Application/UseCases/UpdateProfile/UpdateProfile.php:59:9
 
     private function changeName(Profile $profile, string $value): Profile
     {
-        $profile->name()->setValue($value);
+        
 
         return $profile;
killedBy: Tests\Feature\Core\Profile\Application\UseCases\UpdateProfile\UpdateProfileTest::test_execute_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Application\UseCases\UpdateProfile\UpdateProfileTest::test_execute_should_return_object
Expectation failed for method name is "setValue" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 6, Failures: 1.

[Killed] MethodCallRemoval
Application/UseCases/UpdateProfile/UpdateProfile.php:66:9
 
     private function changeModules(Profile $profile, array $modules): Profile
     {
-        $profile->setModulesAggregator($modules);
+        
 
         return $profile;
killedBy: Tests\Feature\Core\Profile\Application\UseCases\UpdateProfile\UpdateProfileTest::test_execute_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Application\UseCases\UpdateProfile\UpdateProfileTest::test_execute_should_return_object
Expectation failed for method name is "setModulesAggregator" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 8, Failures: 1.

[Killed] MethodCallRemoval
Application/UseCases/UpdateProfile/UpdateProfile.php:73:9
 
     private function changeUpdateAt(Profile $profile, \DateTime $dateTime): Profile
     {
-        $profile->updatedAt()->setValue($dateTime);
+        
 
         return $profile;
killedBy: Tests\Feature\Core\Profile\Application\UseCases\UpdateProfile\UpdateProfileTest::test_execute_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Application\UseCases\UpdateProfile\UpdateProfileTest::test_execute_should_return_object
Expectation failed for method name is "updatedAt" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 8, Failures: 1.
