[NoCoverage] InstanceOf_
Profile/Application/UseCases/UseCasesService.php:26:9
      */
     protected function validateRequest(RequestService $request, string $requestClass): RequestService
     {
-        if (! $request instanceof $requestClass) {
+        if (!true) {
             throw new Exception('Request not valid');
         }
