[Killed] MethodCallRemoval
Application/UseCasesModule/CreateModule/CreateModule.php:15:9
 {
     public function __construct(ModuleRepositoryContract $moduleRepository)
     {
-        parent::__construct($moduleRepository);
+        
     }
 
killedBy: Tests\Feature\Core\Profile\Application\UseCasesModule\CreateModule\CreateModuleTest::test_execute_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Application\UseCasesModule\CreateModule\CreateModuleTest::test_execute_should_return_object
Error: Typed property Core\Profile\Application\UseCasesModule\UseCasesService::$moduleRepository must not be accessed before initialization

/var/www/abacusSystem-new/src/core/Profile/Application/UseCasesModule/CreateModule/CreateModule.php:25
/var/www/abacusSystem-new/tests/Fe

[Killed] MethodCallRemoval
Application/UseCasesModule/CreateModule/CreateModule.php:23:9
      */
     public function execute(RequestService $request): Module
     {
-        $this->validateRequest($request, CreateModuleRequest::class);
+        
 
         /** @var CreateModuleRequest $request */
killedBy: Tests\Feature\Core\Profile\Application\UseCasesModule\CreateModule\CreateModuleTest::test_execute_should_return_exception
statusReason: 1) Tests\Feature\Core\Profile\Application\UseCasesModule\CreateModule\CreateModuleTest::test_execute_should_return_exception
Failed asserting that exception of type "Error" matches expected exception "Exception". Message was: "Call to undefined method MockObject_DeleteModuleRequest_ed63a1c3::module()" at
/var/www/abacusSystem-new/src/core/Profile/Application/UseCasesModule/CreateModule/CreateModul

[Killed] MethodCallRemoval
Application/UseCasesModule/CreateModule/CreateModule.php:27:9
 
         /** @var CreateModuleRequest $request */
         $module = $request->module();
-        $module->refreshSearch();
+        
 
         return $this->moduleRepository->persistModule($module);
killedBy: Tests\Feature\Core\Profile\Application\UseCasesModule\CreateModule\CreateModuleTest::test_execute_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Application\UseCasesModule\CreateModule\CreateModuleTest::test_execute_should_return_object
Expectation failed for method name is "refreshSearch" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.
