[Killed] PublicVisibility
Application/UseCasesModule/CreateModule/CreateModuleRequest.php:17:5
         $this->module = $module;
     }
 
-    public function module(): Module
+    protected function module(): Module
     {
         return $this->module;
killedBy: Tests\Feature\Core\Profile\Application\UseCasesModule\CreateModule\CreateModuleRequestTest::test_module_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Application\UseCasesModule\CreateModule\CreateModuleRequestTest::test_module_should_return_object
Error: Call to protected method Core\Profile\Application\UseCasesModule\CreateModule\CreateModuleRequest::module() from scope Tests\Feature\Core\Profile\Application\UseCasesModule\CreateModule\CreateModuleRequestTest

/var/www/abacusSystem-new/tests/Feature/Core/Profile/A
