[Killed] MethodCallRemoval
Application/UseCasesModule/DeleteModule/DeleteModule.php:22:9
      */
     public function execute(RequestService $request): null
     {
-        $this->validateRequest($request, DeleteModuleRequest::class);
+        
 
         /** @var DeleteModuleRequest $request */
killedBy: Tests\Feature\Core\Profile\Application\UseCasesModule\DeleteModule\DeleteModuleTest::test_execute_should_return_exception
statusReason: 1) Tests\Feature\Core\Profile\Application\UseCasesModule\DeleteModule\DeleteModuleTest::test_execute_should_return_exception
Failed asserting that exception of type "Error" matches expected exception "Exception". Message was: "Call to undefined method MockObject_CreateModuleRequest_39f20a49::id()" at
/var/www/abacusSystem-new/src/core/Profile/Application/UseCasesModule/DeleteModule/DeleteModule.ph

[Killed] MethodCallRemoval
Application/UseCasesModule/DeleteModule/DeleteModule.php:25:9
         $this->validateRequest($request, DeleteModuleRequest::class);
 
         /** @var DeleteModuleRequest $request */
-        $this->moduleRepository->deleteModule($request->id());
+        
 
         return null;
killedBy: Tests\Feature\Core\Profile\Application\UseCasesModule\DeleteModule\DeleteModuleTest::test_execute_should_return_null
statusReason: 1) Tests\Feature\Core\Profile\Application\UseCasesModule\DeleteModule\DeleteModuleTest::test_execute_should_return_null
Expectation failed for method name is "deleteModule" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.
