[Killed] PublicVisibility
Application/UseCasesModule/DeleteModule/DeleteModuleRequest.php:17:5
         $this->id = $id;
     }
 
-    public function id(): ModuleId
+    protected function id(): ModuleId
     {
         return $this->id;
killedBy: Tests\Feature\Core\Profile\Application\UseCasesModule\DeleteModule\DeleteModuleRequestTest::test_moduleId_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Application\UseCasesModule\DeleteModule\DeleteModuleRequestTest::test_moduleId_should_return_object
Error: Call to protected method Core\Profile\Application\UseCasesModule\DeleteModule\DeleteModuleRequest::id() from scope Tests\Feature\Core\Profile\Application\UseCasesModule\DeleteModule\DeleteModuleRequestTest

/var/www/abacusSystem-new/tests/Feature/Core/Profile/App
