[Killed] MethodCallRemoval
Application/UseCasesModule/SearchModule/SearchModuleById.php:23:9
      */
     public function execute(RequestService $request): ?Module
     {
-        $this->validateRequest($request, SearchModuleByIdRequest::class);
+        
 
         /** @var SearchModuleByIdRequest $request */
killedBy: Tests\Feature\Core\Profile\Application\UseCasesModule\SearchModule\SearchModuleByIdTest::test_execute_should_return_exception
statusReason: 1) Tests\Feature\Core\Profile\Application\UseCasesModule\SearchModule\SearchModuleByIdTest::test_execute_should_return_exception
Failed asserting that exception of type "Error" matches expected exception "Exception". Message was: "Call to undefined method MockObject_DeleteModuleRequest_02646034::moduleId()" at
/var/www/abacusSystem-new/src/core/Profile/Application/UseCasesModule/SearchModule/Searc
