[Killed] PublicVisibility
Application/UseCasesModule/SearchModule/SearchModuleByIdRequest.php:17:5
         $this->id = $id;
     }
 
-    public function moduleId(): ModuleId
+    protected function moduleId(): ModuleId
     {
         return $this->id;
killedBy: Tests\Feature\Core\Profile\Application\UseCasesModule\SearchModule\SearchModuleByIdRequestTest::test_moduleId_should_return_value_object
statusReason: 1) Tests\Feature\Core\Profile\Application\UseCasesModule\SearchModule\SearchModuleByIdRequestTest::test_moduleId_should_return_value_object
Error: Call to protected method Core\Profile\Application\UseCasesModule\SearchModule\SearchModuleByIdRequest::moduleId() from scope Tests\Feature\Core\Profile\Application\UseCasesModule\SearchModule\SearchModuleByIdRequestTest

/var/www/abacusSystem-new/tests/
