[Killed] MethodCallRemoval
Application/UseCasesModule/SearchModule/SearchModules.php:23:9
      */
     public function execute(RequestService $request): ?Modules
     {
-        $this->validateRequest($request, SearchModulesRequest::class);
+        
 
         /** @var SearchModulesRequest $request */
killedBy: Tests\Feature\Core\Profile\Application\UseCasesModule\SearchModule\SearchModulesTest::test_execute_should_return_exception
statusReason: 1) Tests\Feature\Core\Profile\Application\UseCasesModule\SearchModule\SearchModulesTest::test_execute_should_return_exception
Failed asserting that exception of type "Error" matches expected exception "Exception". Message was: "Call to undefined method MockObject_DeleteModuleRequest_a82119df::filters()" at
/var/www/abacusSystem-new/src/core/Profile/Application/UseCasesModule/SearchModule/SearchMod
