[Killed] MethodCallRemoval
Application/UseCasesModule/UpdateModule/UpdateModule.php:23:9
      */
     public function execute(RequestService $request): Module
     {
-        $this->validateRequest($request, UpdateModuleRequest::class);
+        
 
         /** @var UpdateModuleRequest $request */
killedBy: Tests\Feature\Core\Profile\Application\UseCasesModule\UpdateModule\UpdateModuleTest::test_execute_should_return_exception
statusReason: 1) Tests\Feature\Core\Profile\Application\UseCasesModule\UpdateModule\UpdateModuleTest::test_execute_should_return_exception
Failed asserting that exception of type "Error" matches expected exception "Exception". Message was: "Call to undefined method MockObject_DeleteModuleRequest_6cff0255::moduleId()" at
/var/www/abacusSystem-new/src/core/Profile/Application/UseCasesModule/UpdateModule/UpdateMod

[Killed] Foreach_
Application/UseCasesModule/UpdateModule/UpdateModule.php:27:9
 
         /** @var UpdateModuleRequest $request */
         $module = $this->moduleRepository->find($request->moduleId());
-        foreach ($request->data() as $field => $value) {
-            $methodName = 'change'.\ucfirst($field);
-
-            if (\is_callable([$this, $methodName])) {
-                $module = $this->{$methodName}($module, $value);
-            }
-        }
+        foreach ([] as $field => $value) {
 
         $module->refreshSearch();
killedBy: Tests\Feature\Core\Profile\Application\UseCasesModule\UpdateModule\UpdateModuleTest::test_execute_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Application\UseCasesModule\UpdateModule\UpdateModuleTest::test_execute_should_return_object
Expectation failed for method name is "data" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] IfNegation
Application/UseCasesModule/UpdateModule/UpdateModule.php:30:13
         foreach ($request->data() as $field => $value) {
             $methodName = 'change'.\ucfirst($field);
 
-            if (\is_callable([$this, $methodName])) {
-                $module = $this->{$methodName}($module, $value);
-            }
+            if (!\is_callable([$this, $methodName])) {
         }
 
killedBy: Tests\Feature\Core\Profile\Application\UseCasesModule\UpdateModule\UpdateModuleTest::test_execute_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Application\UseCasesModule\UpdateModule\UpdateModuleTest::test_execute_should_return_object
Expectation failed for method name is "name" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.

[Killed] ArrayItemRemoval
Application/UseCasesModule/UpdateModule/UpdateModule.php:30:13
         foreach ($request->data() as $field => $value) {
             $methodName = 'change'.\ucfirst($field);
 
-            if (\is_callable([$this, $methodName])) {
+            if (\is_callable([$methodName])) {
                 $module = $this->{$methodName}($module, $value);
             }
killedBy: Tests\Feature\Core\Profile\Application\UseCasesModule\UpdateModule\UpdateModuleTest::test_execute_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Application\UseCasesModule\UpdateModule\UpdateModuleTest::test_execute_should_return_object
Expectation failed for method name is "name" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.

[Killed] MethodCallRemoval
Application/UseCasesModule/UpdateModule/UpdateModule.php:35:9
             }
         }
 
-        $module->refreshSearch();
+        
 
         return $this->moduleRepository->persistModule($module);
killedBy: Tests\Feature\Core\Profile\Application\UseCasesModule\UpdateModule\UpdateModuleTest::test_execute_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Application\UseCasesModule\UpdateModule\UpdateModuleTest::test_execute_should_return_object
Expectation failed for method name is "refreshSearch" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.

[Killed] MethodCallRemoval
Application/UseCasesModule/UpdateModule/UpdateModule.php:42:9
 
     private function changeName(Module $module, string $value): Module
     {
-        $module->name()->setValue($value);
+        
 
         return $module;
killedBy: Tests\Feature\Core\Profile\Application\UseCasesModule\UpdateModule\UpdateModuleTest::test_execute_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Application\UseCasesModule\UpdateModule\UpdateModuleTest::test_execute_should_return_object
Expectation failed for method name is "name" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.

[Killed] MethodCallRemoval
Application/UseCasesModule/UpdateModule/UpdateModule.php:49:9
 
     private function changeRoute(Module $module, string $value): Module
     {
-        $module->route()->setValue($value);
+        
 
         return $module;
killedBy: Tests\Feature\Core\Profile\Application\UseCasesModule\UpdateModule\UpdateModuleTest::test_execute_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Application\UseCasesModule\UpdateModule\UpdateModuleTest::test_execute_should_return_object
Expectation failed for method name is "route" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.

[Killed] MethodCallRemoval
Application/UseCasesModule/UpdateModule/UpdateModule.php:56:9
 
     private function changeIcon(Module $module, string $value): Module
     {
-        $module->icon()->setValue($value);
+        
 
         return $module;
killedBy: Tests\Feature\Core\Profile\Application\UseCasesModule\UpdateModule\UpdateModuleTest::test_execute_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Application\UseCasesModule\UpdateModule\UpdateModuleTest::test_execute_should_return_object
Expectation failed for method name is "icon" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.

[Killed] MethodCallRemoval
Application/UseCasesModule/UpdateModule/UpdateModule.php:63:9
 
     private function changeKey(Module $module, string $value): Module
     {
-        $module->menuKey()->setValue($value);
+        
 
         return $module;
killedBy: Tests\Feature\Core\Profile\Application\UseCasesModule\UpdateModule\UpdateModuleTest::test_execute_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Application\UseCasesModule\UpdateModule\UpdateModuleTest::test_execute_should_return_object
Expectation failed for method name is "menuKey" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.

[Killed] MethodCallRemoval
Application/UseCasesModule/UpdateModule/UpdateModule.php:73:9
      */
     private function changeState(Module $module, int $value): Module
     {
-        $module->state()->setValue($value);
+        
 
         return $module;
killedBy: Tests\Feature\Core\Profile\Application\UseCasesModule\UpdateModule\UpdateModuleTest::test_execute_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Application\UseCasesModule\UpdateModule\UpdateModuleTest::test_execute_should_return_object
Expectation failed for method name is "state" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.

[Killed] MethodCallRemoval
Application/UseCasesModule/UpdateModule/UpdateModule.php:80:9
 
     private function changePosition(Module $module, int $value): Module
     {
-        $module->position()->setValue($value);
+        
 
         return $module;
killedBy: Tests\Feature\Core\Profile\Application\UseCasesModule\UpdateModule\UpdateModuleTest::test_execute_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Application\UseCasesModule\UpdateModule\UpdateModuleTest::test_execute_should_return_object
Expectation failed for method name is "position" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.

[Killed] MethodCallRemoval
Application/UseCasesModule/UpdateModule/UpdateModule.php:87:9
 
     private function changeUpdatedAt(Module $module, \DateTime $dateTime): Module
     {
-        $module->updatedAt()->setValue($dateTime);
+        
 
         return $module;
killedBy: Tests\Feature\Core\Profile\Application\UseCasesModule\UpdateModule\UpdateModuleTest::test_execute_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Application\UseCasesModule\UpdateModule\UpdateModuleTest::test_execute_should_return_object
Expectation failed for method name is "updatedAt" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.
