[Killed] PublicVisibility
core/Profile/Domain/Module.php:70:5
         return $this->id;
     }
 
-    public function setId(ModuleId $id): self
+    protected function setId(ModuleId $id): self
     {
         $this->id = $id;
killedBy: Tests\Feature\Core\Profile\Domain\ModuleTest::test_setId_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Profile\Domain\ModuleTest::test_setId_should_change_and_return_self
Error: Call to protected method Core\Profile\Domain\Module::setId() from scope Tests\Feature\Core\Profile\Domain\ModuleTest

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Domain/ModuleTest.php:82

ERRORS!
Tests: 26, Assertions: 59, Errors: 1.

[Killed] PublicVisibility
core/Profile/Domain/Module.php:77:5
         return $this;
     }
 
-    public function menuKey(): ModuleMenuKey
+    protected function menuKey(): ModuleMenuKey
     {
         return $this->menuKey;
killedBy: Tests\Feature\Core\Profile\Domain\ModuleTest::test_setMenuKey_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Profile\Domain\ModuleTest::test_setMenuKey_should_change_and_return_self
Error: Call to protected method Core\Profile\Domain\Module::menuKey() from scope Tests\Feature\Core\Profile\Domain\ModuleTest

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Domain/ModuleTest.php:106

2) Tests\Feature\Core\Profile\Domain\ModuleTest::test_menuKey_should_return_value_object
Error: Ca

[Killed] PublicVisibility
core/Profile/Domain/Module.php:82:5
         return $this->menuKey;
     }
 
-    public function setMenuKey(ModuleMenuKey $menuKey): self
+    protected function setMenuKey(ModuleMenuKey $menuKey): self
     {
         $this->menuKey = $menuKey;
killedBy: Tests\Feature\Core\Profile\Domain\ModuleTest::test_setMenuKey_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Profile\Domain\ModuleTest::test_setMenuKey_should_change_and_return_self
Error: Call to protected method Core\Profile\Domain\Module::setMenuKey() from scope Tests\Feature\Core\Profile\Domain\ModuleTest

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Domain/ModuleTest.php:102

ERRORS!
Tests: 26, Assertions: 59, Errors: 1.

[Killed] PublicVisibility
core/Profile/Domain/Module.php:89:5
         return $this;
     }
 
-    public function name(): ModuleName
+    protected function name(): ModuleName
     {
         return $this->name;
killedBy: Tests\Feature\Core\Profile\Domain\ModuleTest::test_setName_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Profile\Domain\ModuleTest::test_setName_should_change_and_return_self
Error: Call to protected method Core\Profile\Domain\Module::name() from scope Tests\Feature\Core\Profile\Domain\ModuleTest

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Domain/ModuleTest.php:126

2) Tests\Feature\Core\Profile\Domain\ModuleTest::test_name_should_return_value_object
Error: Call to pro

[Killed] PublicVisibility
core/Profile/Domain/Module.php:94:5
         return $this->name;
     }
 
-    public function setName(ModuleName $name): self
+    protected function setName(ModuleName $name): self
     {
         $this->name = $name;
killedBy: Tests\Feature\Core\Profile\Domain\ModuleTest::test_setName_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Profile\Domain\ModuleTest::test_setName_should_change_and_return_self
Error: Call to protected method Core\Profile\Domain\Module::setName() from scope Tests\Feature\Core\Profile\Domain\ModuleTest

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Domain/ModuleTest.php:122

ERRORS!
Tests: 26, Assertions: 59, Errors: 1.

[Killed] PublicVisibility
core/Profile/Domain/Module.php:101:5
         return $this;
     }
 
-    public function route(): ModuleRoute
+    protected function route(): ModuleRoute
     {
         return $this->route;
killedBy: Tests\Feature\Core\Profile\Domain\ModuleTest::test_setRoute_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Profile\Domain\ModuleTest::test_setRoute_should_change_and_return_self
Error: Call to protected method Core\Profile\Domain\Module::route() from scope Tests\Feature\Core\Profile\Domain\ModuleTest

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Domain/ModuleTest.php:146

2) Tests\Feature\Core\Profile\Domain\ModuleTest::test_route_should_return_value_object
Error: Call to

[Killed] PublicVisibility
core/Profile/Domain/Module.php:106:5
         return $this->route;
     }
 
-    public function setRoute(ModuleRoute $route): self
+    protected function setRoute(ModuleRoute $route): self
     {
         $this->route = $route;
killedBy: Tests\Feature\Core\Profile\Domain\ModuleTest::test_setRoute_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Profile\Domain\ModuleTest::test_setRoute_should_change_and_return_self
Error: Call to protected method Core\Profile\Domain\Module::setRoute() from scope Tests\Feature\Core\Profile\Domain\ModuleTest

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Domain/ModuleTest.php:142

ERRORS!
Tests: 26, Assertions: 59, Errors: 1.

[Killed] PublicVisibility
core/Profile/Domain/Module.php:113:5
         return $this;
     }
 
-    public function icon(): ModuleIcon
+    protected function icon(): ModuleIcon
     {
         return $this->icon;
killedBy: Tests\Feature\Core\Profile\Domain\ModuleTest::test_setIcon_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Profile\Domain\ModuleTest::test_setIcon_should_change_and_return_self
Error: Call to protected method Core\Profile\Domain\Module::icon() from scope Tests\Feature\Core\Profile\Domain\ModuleTest

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Domain/ModuleTest.php:165

2) Tests\Feature\Core\Profile\Domain\ModuleTest::test_icon_should_return_value_object
Error: Call to pro

[Killed] PublicVisibility
core/Profile/Domain/Module.php:118:5
         return $this->icon;
     }
 
-    public function setIcon(ModuleIcon $icon): self
+    protected function setIcon(ModuleIcon $icon): self
     {
         $this->icon = $icon;
killedBy: Tests\Feature\Core\Profile\Domain\ModuleTest::test_setIcon_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Profile\Domain\ModuleTest::test_setIcon_should_change_and_return_self
Error: Call to protected method Core\Profile\Domain\Module::setIcon() from scope Tests\Feature\Core\Profile\Domain\ModuleTest

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Domain/ModuleTest.php:161

ERRORS!
Tests: 26, Assertions: 59, Errors: 1.

[Killed] PublicVisibility
core/Profile/Domain/Module.php:125:5
         return $this;
     }
 
-    public function state(): ModuleState
+    protected function state(): ModuleState
     {
         return $this->state;
killedBy: Tests\Feature\Core\Profile\Domain\ModuleTest::test_setState_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Profile\Domain\ModuleTest::test_setState_should_change_and_return_self
Error: Call to protected method Core\Profile\Domain\Module::state() from scope Tests\Feature\Core\Profile\Domain\ModuleTest

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Domain/ModuleTest.php:184

2) Tests\Feature\Core\Profile\Domain\ModuleTest::test_state_should_return_value_object
Error: Call to

[Killed] PublicVisibility
core/Profile/Domain/Module.php:130:5
         return $this->state;
     }
 
-    public function setState(ModuleState $state): self
+    protected function setState(ModuleState $state): self
     {
         $this->state = $state;
killedBy: Tests\Feature\Core\Profile\Domain\ModuleTest::test_setState_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Profile\Domain\ModuleTest::test_setState_should_change_and_return_self
Error: Call to protected method Core\Profile\Domain\Module::setState() from scope Tests\Feature\Core\Profile\Domain\ModuleTest

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Domain/ModuleTest.php:180

ERRORS!
Tests: 26, Assertions: 59, Errors: 1.

[Killed] PublicVisibility
core/Profile/Domain/Module.php:137:5
         return $this;
     }
 
-    public function createdAt(): ModuleCreatedAt
+    protected function createdAt(): ModuleCreatedAt
     {
         return $this->createdAt;
killedBy: Tests\Feature\Core\Profile\Domain\ModuleTest::test_setCreatedAt_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Profile\Domain\ModuleTest::test_setCreatedAt_should_change_and_return_self
Error: Call to protected method Core\Profile\Domain\Module::createdAt() from scope Tests\Feature\Core\Profile\Domain\ModuleTest

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Domain/ModuleTest.php:203

2) Tests\Feature\Core\Profile\Domain\ModuleTest::test_createdAt_should_return_value_object
Err

[Killed] PublicVisibility
core/Profile/Domain/Module.php:142:5
         return $this->createdAt;
     }
 
-    public function setCreatedAt(ModuleCreatedAt $createdAt): self
+    protected function setCreatedAt(ModuleCreatedAt $createdAt): self
     {
         $this->createdAt = $createdAt;
killedBy: Tests\Feature\Core\Profile\Domain\ModuleTest::test_setCreatedAt_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Profile\Domain\ModuleTest::test_setCreatedAt_should_change_and_return_self
Error: Call to protected method Core\Profile\Domain\Module::setCreatedAt() from scope Tests\Feature\Core\Profile\Domain\ModuleTest

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Domain/ModuleTest.php:199

ERRORS!
Tests: 26, Assertions: 59, Errors: 1.

[Killed] PublicVisibility
core/Profile/Domain/Module.php:149:5
         return $this;
     }
 
-    public function updatedAt(): ModuleUpdatedAt
+    protected function updatedAt(): ModuleUpdatedAt
     {
         return $this->updatedAt;
killedBy: Tests\Feature\Core\Profile\Domain\ModuleTest::test_setUpdatedAt_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Profile\Domain\ModuleTest::test_setUpdatedAt_should_change_and_return_self
Error: Call to protected method Core\Profile\Domain\Module::updatedAt() from scope Tests\Feature\Core\Profile\Domain\ModuleTest

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Domain/ModuleTest.php:222

2) Tests\Feature\Core\Profile\Domain\ModuleTest::test_updatedAt_should_return_value_object
Err

[Killed] PublicVisibility
core/Profile/Domain/Module.php:154:5
         return $this->updatedAt;
     }
 
-    public function setUpdatedAt(ModuleUpdatedAt $updatedAt): self
+    protected function setUpdatedAt(ModuleUpdatedAt $updatedAt): self
     {
         $this->updatedAt = $updatedAt;
killedBy: Tests\Feature\Core\Profile\Domain\ModuleTest::test_setUpdatedAt_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Profile\Domain\ModuleTest::test_setUpdatedAt_should_change_and_return_self
Error: Call to protected method Core\Profile\Domain\Module::setUpdatedAt() from scope Tests\Feature\Core\Profile\Domain\ModuleTest

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Domain/ModuleTest.php:218

ERRORS!
Tests: 26, Assertions: 59, Errors: 1.

[Killed] PublicVisibility
core/Profile/Domain/Module.php:161:5
         return $this;
     }
 
-    public function search(): ModuleSearch
+    protected function search(): ModuleSearch
     {
         return $this->search;
killedBy: Tests\Feature\Core\Profile\Domain\ModuleTest::test_setSearch_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Profile\Domain\ModuleTest::test_setSearch_should_change_and_return_self
Error: Call to protected method Core\Profile\Domain\Module::search() from scope Tests\Feature\Core\Profile\Domain\ModuleTest

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Domain/ModuleTest.php:241

2) Tests\Feature\Core\Profile\Domain\ModuleTest::test_search_should_return_value_object
Error: Call

[Killed] PublicVisibility
core/Profile/Domain/Module.php:166:5
         return $this->search;
     }
 
-    public function setSearch(ModuleSearch $search): self
+    protected function setSearch(ModuleSearch $search): self
     {
         $this->search = $search;
killedBy: Tests\Feature\Core\Profile\Domain\ModuleTest::test_refreshSearch_should_return_self
statusReason: 1) Tests\Feature\Core\Profile\Domain\ModuleTest::test_refreshSearch_should_return_self
Error: Call to protected method Core\Profile\Domain\Module::setSearch() from scope Tests\Feature\Core\Profile\Domain\ModuleTest

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Domain/ModuleTest.php:310

2) Tests\Feature\Core\Profile\Domain\ModuleTest::test_setSearch_should_change_and_return_self
Error: Cal

[Killed] PublicVisibility
core/Profile/Domain/Module.php:173:5
         return $this;
     }
 
-    public function options(): array
+    protected function options(): array
     {
         return $this->options;
killedBy: Tests\Feature\Core\Profile\Domain\ModuleTest::test_setOptions_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Profile\Domain\ModuleTest::test_setOptions_should_change_and_return_self
Error: Call to protected method Core\Profile\Domain\Module::options() from scope Tests\Feature\Core\Profile\Domain\ModuleTest

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Domain/ModuleTest.php:257

2) Tests\Feature\Core\Profile\Domain\ModuleTest::test_options_should_return_value_object
Error: Ca

[Killed] PublicVisibility
core/Profile/Domain/Module.php:178:5
         return $this->options;
     }
 
-    public function setOptions(array $data): self
+    protected function setOptions(array $data): self
     {
         $this->options = $data;
killedBy: Tests\Feature\Core\Profile\Domain\ModuleTest::test_setOptions_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Profile\Domain\ModuleTest::test_setOptions_should_change_and_return_self
Error: Call to protected method Core\Profile\Domain\Module::setOptions() from scope Tests\Feature\Core\Profile\Domain\ModuleTest

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Domain/ModuleTest.php:253

ERRORS!
Tests: 26, Assertions: 59, Errors: 1.

[Killed] PublicVisibility
core/Profile/Domain/Module.php:185:5
         return $this;
     }
 
-    public function position(): ModulePosition
+    protected function position(): ModulePosition
     {
         return $this->position;
killedBy: Tests\Feature\Core\Profile\Domain\ModuleTest::test_setPosition_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Profile\Domain\ModuleTest::test_setPosition_should_change_and_return_self
Error: Call to protected method Core\Profile\Domain\Module::position() from scope Tests\Feature\Core\Profile\Domain\ModuleTest

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Domain/ModuleTest.php:333

2) Tests\Feature\Core\Profile\Domain\ModuleTest::test_position_should_return_value_object
Error:

[Killed] PublicVisibility
core/Profile/Domain/Module.php:190:5
         return $this->position;
     }
 
-    public function setPosition(ModulePosition $position): self
+    protected function setPosition(ModulePosition $position): self
     {
         $this->position = $position;
killedBy: Tests\Feature\Core\Profile\Domain\ModuleTest::test_setPosition_should_change_and_return_self
statusReason: 1) Tests\Feature\Core\Profile\Domain\ModuleTest::test_setPosition_should_change_and_return_self
Error: Call to protected method Core\Profile\Domain\Module::setPosition() from scope Tests\Feature\Core\Profile\Domain\ModuleTest

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Domain/ModuleTest.php:329

ERRORS!
Tests: 26, Assertions: 59, Errors: 1.

[Killed] PublicVisibility
core/Profile/Domain/Module.php:196:5
         return $this;
     }
 
-    public function haveChildren(): bool
+    protected function haveChildren(): bool
     {
         return count($this->options()) > 0;
killedBy: Tests\Feature\Core\Profile\Domain\ModuleTest::test_haveChildren_should_return_boolean
statusReason: 1) Tests\Feature\Core\Profile\Domain\ModuleTest::test_haveChildren_should_return_boolean
Error: Call to protected method Core\Profile\Domain\Module::haveChildren() from scope Tests\Feature\Core\Profile\Domain\ModuleTest

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Domain/ModuleTest.php:262

ERRORS!
Tests: 26, Assertions: 60, Errors: 1.

[Killed] GreaterThanNegotiation
core/Profile/Domain/Module.php:198:9
 
     public function haveChildren(): bool
     {
-        return count($this->options()) > 0;
+        return count($this->options()) <= 0;
     }
 
killedBy: Tests\Feature\Core\Profile\Domain\ModuleTest::test_haveChildren_should_return_boolean
statusReason: 1) Tests\Feature\Core\Profile\Domain\ModuleTest::test_haveChildren_should_return_boolean
Failed asserting that true is false.

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Domain/ModuleTest.php:264

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] GreaterThan
core/Profile/Domain/Module.php:198:9
 
     public function haveChildren(): bool
     {
-        return count($this->options()) > 0;
+        return count($this->options()) >= 0;
     }
 
killedBy: Tests\Feature\Core\Profile\Domain\ModuleTest::test_haveChildren_should_return_boolean
statusReason: 1) Tests\Feature\Core\Profile\Domain\ModuleTest::test_haveChildren_should_return_boolean
Failed asserting that true is false.

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Domain/ModuleTest.php:264

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] PublicVisibility
core/Profile/Domain/Module.php:201:5
         return count($this->options()) > 0;
     }
 
-    public function expanded(): bool
+    protected function expanded(): bool
     {
         return $this->expanded;
killedBy: Tests\Feature\Core\Profile\Domain\ModuleTest::test_setExpanded_should_return_self
statusReason: 1) Tests\Feature\Core\Profile\Domain\ModuleTest::test_setExpanded_should_return_self
Error: Call to protected method Core\Profile\Domain\Module::expanded() from scope Tests\Feature\Core\Profile\Domain\ModuleTest

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Domain/ModuleTest.php:280

2) Tests\Feature\Core\Profile\Domain\ModuleTest::test_expanded_should_return_boolean
Error: Call to protect

[Killed] PublicVisibility
core/Profile/Domain/Module.php:206:5
         return $this->expanded;
     }
 
-    public function setExpanded(bool $value): self
+    protected function setExpanded(bool $value): self
     {
         $this->expanded = $value;
killedBy: Tests\Feature\Core\Profile\Domain\ModuleTest::test_setExpanded_should_return_self
statusReason: 1) Tests\Feature\Core\Profile\Domain\ModuleTest::test_setExpanded_should_return_self
Error: Call to protected method Core\Profile\Domain\Module::setExpanded() from scope Tests\Feature\Core\Profile\Domain\ModuleTest

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Domain/ModuleTest.php:276

ERRORS!
Tests: 26, Assertions: 59, Errors: 1.

[Killed] MethodCallRemoval
core/Profile/Domain/Module.php:222:9
             $this->icon->value(),
         ];
 
-        $this->search->setValue(implode(' ', $dataSearch));
+        
 
         return $this;
killedBy: Tests\Feature\Core\Profile\Domain\ModuleTest::test_refreshSearch_should_return_self
statusReason: 1) Tests\Feature\Core\Profile\Domain\ModuleTest::test_refreshSearch_should_return_self
Expectation failed for method name is "setValue" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 7, Failures: 1.
