[Killed] Foreach_
core/Profile/Domain/Modules.php:13:9
 
     public function __construct(Module ...$modules)
     {
-        foreach ($modules as $module) {
-            $this->addItem($module);
-        }
+        foreach ([] as $module) {
     }
 
killedBy: Tests\Feature\Core\Profile\Domain\ModulesTest::test_moduleElementsOfKey_should_return_array
statusReason: 1) Tests\Feature\Core\Profile\Domain\ModulesTest::test_moduleElementsOfKey_should_return_array
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
-Array &0 [
-    0 => MockObject_Module_5dfc8641 Object #1118 (
-        'options' => Array &1 [],

[Killed] MethodCallRemoval
core/Profile/Domain/Modules.php:14:13
     public function __construct(Module ...$modules)
     {
         foreach ($modules as $module) {
-            $this->addItem($module);
+            
         }
     }
killedBy: Tests\Feature\Core\Profile\Domain\ModulesTest::test_moduleElementsOfKey_should_return_array
statusReason: 1) Tests\Feature\Core\Profile\Domain\ModulesTest::test_moduleElementsOfKey_should_return_array
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
-Array &0 [
-    0 => MockObject_Module_88acb5a7 Object #1118 (
-        'options' => Array &1 [],

[Killed] PublicVisibility
core/Profile/Domain/Modules.php:45:5
         return $this;
     }
 
-    public function moduleElementsOfKey(string $menuKey): array
+    protected function moduleElementsOfKey(string $menuKey): array
     {
         $this->rewind();
killedBy: Tests\Feature\Core\Profile\Domain\ModulesTest::test_moduleElementsOfKey_should_return_array
statusReason: 1) Tests\Feature\Core\Profile\Domain\ModulesTest::test_moduleElementsOfKey_should_return_array
Error: Call to protected method Core\Profile\Domain\Modules::moduleElementsOfKey() from scope Tests\Feature\Core\Profile\Domain\ModulesTest

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Domain/ModulesTest.php:87

ERRORS!
Tests: 7, Assertions: 11, Errors: 1.

[Survived] MethodCallRemoval
core/Profile/Domain/Modules.php:47:9
 
     public function moduleElementsOfKey(string $menuKey): array
     {
-        $this->rewind();
+        
         $modulesKeys = [];
 

[Killed] Foreach_
core/Profile/Domain/Modules.php:51:9
         $modulesKeys = [];
 
         /** @var Module $item */
-        foreach ($this as $item) {
-            if ($item->menuKey()->value() === $menuKey) {
-                $modulesKeys[] = $item;
-            }
-        }
+        foreach ([] as $item) {
 
         return $modulesKeys;
killedBy: Tests\Feature\Core\Profile\Domain\ModulesTest::test_moduleElementsOfKey_should_return_array
statusReason: 1) Tests\Feature\Core\Profile\Domain\ModulesTest::test_moduleElementsOfKey_should_return_array
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
-Array &0 [
-    0 => MockObject_Module_e28357d6 Object #1118 (
-        'options' => Array &1 [],

[Killed] Identical
core/Profile/Domain/Modules.php:52:13
 
         /** @var Module $item */
         foreach ($this as $item) {
-            if ($item->menuKey()->value() === $menuKey) {
+            if ($item->menuKey()->value() !== $menuKey) {
                 $modulesKeys[] = $item;
             }
killedBy: Tests\Feature\Core\Profile\Domain\ModulesTest::test_moduleElementsOfKey_should_return_array
statusReason: 1) Tests\Feature\Core\Profile\Domain\ModulesTest::test_moduleElementsOfKey_should_return_array
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
-Array &0 [
-    0 => MockObject_Module_3751a705 Object #1118 (
-        'options' => Array &1 [],
