[Killed] PublicVisibility
core/Profile/Domain/Profile.php:57:5
         return $this->id;
     }
 
-    public function setId(ProfileId $id): self
+    protected function setId(ProfileId $id): self
     {
         $this->id = $id;
killedBy: Tests\Feature\Core\Profile\Domain\ProfileTest::test_setId_should_return_self
statusReason: 1) Tests\Feature\Core\Profile\Domain\ProfileTest::test_setId_should_return_self
Error: Call to protected method Core\Profile\Domain\Profile::setId() from scope Tests\Feature\Core\Profile\Domain\ProfileTest

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Domain/ProfileTest.php:65

ERRORS!
Tests: 19, Assertions: 40, Errors: 1.

[Killed] PublicVisibility
core/Profile/Domain/Profile.php:64:5
         return $this;
     }
 
-    public function name(): ProfileName
+    protected function name(): ProfileName
     {
         return $this->name;
killedBy: Tests\Feature\Core\Profile\Domain\ProfileTest::test_setName_should_return_self
statusReason: 1) Tests\Feature\Core\Profile\Domain\ProfileTest::test_setName_should_return_self
Error: Call to protected method Core\Profile\Domain\Profile::name() from scope Tests\Feature\Core\Profile\Domain\ProfileTest

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Domain/ProfileTest.php:89

2) Tests\Feature\Core\Profile\Domain\ProfileTest::test_name_should_return_value_object
Error: Call to protected

[Killed] PublicVisibility
core/Profile/Domain/Profile.php:69:5
         return $this->name;
     }
 
-    public function setName(ProfileName $name): self
+    protected function setName(ProfileName $name): self
     {
         $this->name = $name;
killedBy: Tests\Feature\Core\Profile\Domain\ProfileTest::test_setName_should_return_self
statusReason: 1) Tests\Feature\Core\Profile\Domain\ProfileTest::test_setName_should_return_self
Error: Call to protected method Core\Profile\Domain\Profile::setName() from scope Tests\Feature\Core\Profile\Domain\ProfileTest

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Domain/ProfileTest.php:85

ERRORS!
Tests: 19, Assertions: 40, Errors: 1.

[Killed] PublicVisibility
core/Profile/Domain/Profile.php:76:5
         return $this;
     }
 
-    public function state(): ProfileState
+    protected function state(): ProfileState
     {
         return $this->state;
killedBy: Tests\Feature\Core\Profile\Domain\ProfileTest::test_setState_should_return_self
statusReason: 1) Tests\Feature\Core\Profile\Domain\ProfileTest::test_setState_should_return_self
Error: Call to protected method Core\Profile\Domain\Profile::state() from scope Tests\Feature\Core\Profile\Domain\ProfileTest

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Domain/ProfileTest.php:108

2) Tests\Feature\Core\Profile\Domain\ProfileTest::test_state_should_return_value_object
Error: Call to protec

[Killed] PublicVisibility
core/Profile/Domain/Profile.php:81:5
         return $this->state;
     }
 
-    public function setState(ProfileState $state): self
+    protected function setState(ProfileState $state): self
     {
         $this->state = $state;
killedBy: Tests\Feature\Core\Profile\Domain\ProfileTest::test_setState_should_return_self
statusReason: 1) Tests\Feature\Core\Profile\Domain\ProfileTest::test_setState_should_return_self
Error: Call to protected method Core\Profile\Domain\Profile::setState() from scope Tests\Feature\Core\Profile\Domain\ProfileTest

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Domain/ProfileTest.php:104

ERRORS!
Tests: 19, Assertions: 40, Errors: 1.

[Killed] PublicVisibility
core/Profile/Domain/Profile.php:88:5
         return $this;
     }
 
-    public function search(): ProfileSearch
+    protected function search(): ProfileSearch
     {
         return $this->search;
killedBy: Tests\Feature\Core\Profile\Domain\ProfileTest::test_setSearch_should_return_self
statusReason: 1) Tests\Feature\Core\Profile\Domain\ProfileTest::test_setSearch_should_return_self
Error: Call to protected method Core\Profile\Domain\Profile::search() from scope Tests\Feature\Core\Profile\Domain\ProfileTest

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Domain/ProfileTest.php:127

2) Tests\Feature\Core\Profile\Domain\ProfileTest::test_search_should_return_value_object
Error: Call to pro

[Killed] PublicVisibility
core/Profile/Domain/Profile.php:93:5
         return $this->search;
     }
 
-    public function setSearch(ProfileSearch $search): self
+    protected function setSearch(ProfileSearch $search): self
     {
         $this->search = $search;
killedBy: Tests\Feature\Core\Profile\Domain\ProfileTest::test_refreshSearch_should_return_self
statusReason: 1) Tests\Feature\Core\Profile\Domain\ProfileTest::test_refreshSearch_should_return_self
Error: Call to protected method Core\Profile\Domain\Profile::setSearch() from scope Tests\Feature\Core\Profile\Domain\ProfileTest

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Domain/ProfileTest.php:242

2) Tests\Feature\Core\Profile\Domain\ProfileTest::test_setSearch_should_return_self
Error: Call to p

[Killed] PublicVisibility
core/Profile/Domain/Profile.php:100:5
         return $this;
     }
 
-    public function description(): ProfileDescription
+    protected function description(): ProfileDescription
     {
         return $this->description;
killedBy: Tests\Feature\Core\Profile\Domain\ProfileTest::test_setDescription_should_return_self
statusReason: 1) Tests\Feature\Core\Profile\Domain\ProfileTest::test_setDescription_should_return_self
Error: Call to protected method Core\Profile\Domain\Profile::description() from scope Tests\Feature\Core\Profile\Domain\ProfileTest

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Domain/ProfileTest.php:146

2) Tests\Feature\Core\Profile\Domain\ProfileTest::test_description_should_return_value_object
Err

[Killed] PublicVisibility
core/Profile/Domain/Profile.php:105:5
         return $this->description;
     }
 
-    public function setDescription(ProfileDescription $description): self
+    protected function setDescription(ProfileDescription $description): self
     {
         $this->description = $description;
killedBy: Tests\Feature\Core\Profile\Domain\ProfileTest::test_refreshSearch_should_return_self
statusReason: 1) Tests\Feature\Core\Profile\Domain\ProfileTest::test_refreshSearch_should_return_self
Error: Call to protected method Core\Profile\Domain\Profile::setDescription() from scope Tests\Feature\Core\Profile\Domain\ProfileTest

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Domain/ProfileTest.php:235

2) Tests\Feature\Core\Profile\Domain\ProfileTest::test_setDescription_should_return_self
Error:

[Killed] PublicVisibility
core/Profile/Domain/Profile.php:112:5
         return $this;
     }
 
-    public function modules(): Modules
+    protected function modules(): Modules
     {
         return $this->modules;
killedBy: Tests\Feature\Core\Profile\Domain\ProfileTest::test_setModules_should_return_self
statusReason: 1) Tests\Feature\Core\Profile\Domain\ProfileTest::test_setModules_should_return_self
Error: Call to protected method Core\Profile\Domain\Profile::modules() from scope Tests\Feature\Core\Profile\Domain\ProfileTest

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Domain/ProfileTest.php:165

2) Tests\Feature\Core\Profile\Domain\ProfileTest::test_modules_should_return_value_object
Error: Call to

[Killed] PublicVisibility
core/Profile/Domain/Profile.php:117:5
         return $this->modules;
     }
 
-    public function setModules(Modules $modules): self
+    protected function setModules(Modules $modules): self
     {
         $this->modules = $modules;
killedBy: Tests\Feature\Core\Profile\Domain\ProfileTest::test_setModules_should_return_self
statusReason: 1) Tests\Feature\Core\Profile\Domain\ProfileTest::test_setModules_should_return_self
Error: Call to protected method Core\Profile\Domain\Profile::setModules() from scope Tests\Feature\Core\Profile\Domain\ProfileTest

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Domain/ProfileTest.php:161

ERRORS!
Tests: 19, Assertions: 40, Errors: 1.

[Killed] PublicVisibility
core/Profile/Domain/Profile.php:124:5
         return $this;
     }
 
-    public function modulesAggregator(): array
+    protected function modulesAggregator(): array
     {
         return $this->modulesAggregator;
killedBy: Tests\Feature\Core\Profile\Domain\ProfileTest::test_setModulesAggregator_should_return_self
statusReason: 1) Tests\Feature\Core\Profile\Domain\ProfileTest::test_setModulesAggregator_should_return_self
Error: Call to protected method Core\Profile\Domain\Profile::modulesAggregator() from scope Tests\Feature\Core\Profile\Domain\ProfileTest

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Domain/ProfileTest.php:181

2) Tests\Feature\Core\Profile\Domain\ProfileTest::test_modulesAggregator_should_retur

[Killed] PublicVisibility
core/Profile/Domain/Profile.php:129:5
         return $this->modulesAggregator;
     }
 
-    public function setModulesAggregator(array $ids): self
+    protected function setModulesAggregator(array $ids): self
     {
         $this->modulesAggregator = $ids;
killedBy: Tests\Feature\Core\Profile\Domain\ProfileTest::test_setModulesAggregator_should_return_self
statusReason: 1) Tests\Feature\Core\Profile\Domain\ProfileTest::test_setModulesAggregator_should_return_self
Error: Call to protected method Core\Profile\Domain\Profile::setModulesAggregator() from scope Tests\Feature\Core\Profile\Domain\ProfileTest

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Domain/ProfileTest.php:177

ERRORS!
Tests: 19, Assertions: 40, Errors: 1.

[Killed] PublicVisibility
core/Profile/Domain/Profile.php:136:5
         return $this;
     }
 
-    public function createdAt(): ProfileCreatedAt
+    protected function createdAt(): ProfileCreatedAt
     {
         return $this->createdAt;
killedBy: Tests\Feature\Core\Profile\Domain\ProfileTest::test_setCreatedAt_should_return_self
statusReason: 1) Tests\Feature\Core\Profile\Domain\ProfileTest::test_setCreatedAt_should_return_self
Error: Call to protected method Core\Profile\Domain\Profile::createdAt() from scope Tests\Feature\Core\Profile\Domain\ProfileTest

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Domain/ProfileTest.php:200

2) Tests\Feature\Core\Profile\Domain\ProfileTest::test_createdAt_should_return_value_object
Error: Ca

[Killed] PublicVisibility
core/Profile/Domain/Profile.php:141:5
         return $this->createdAt;
     }
 
-    public function setCreatedAt(ProfileCreatedAt $createdAt): self
+    protected function setCreatedAt(ProfileCreatedAt $createdAt): self
     {
         $this->createdAt = $createdAt;
killedBy: Tests\Feature\Core\Profile\Domain\ProfileTest::test_setCreatedAt_should_return_self
statusReason: 1) Tests\Feature\Core\Profile\Domain\ProfileTest::test_setCreatedAt_should_return_self
Error: Call to protected method Core\Profile\Domain\Profile::setCreatedAt() from scope Tests\Feature\Core\Profile\Domain\ProfileTest

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Domain/ProfileTest.php:196

ERRORS!
Tests: 19, Assertions: 40, Errors: 1.

[Killed] PublicVisibility
core/Profile/Domain/Profile.php:148:5
         return $this;
     }
 
-    public function updatedAt(): ProfileUpdatedAt
+    protected function updatedAt(): ProfileUpdatedAt
     {
         return $this->updatedAt;
killedBy: Tests\Feature\Core\Profile\Domain\ProfileTest::test_setUpdatedAt_should_return_self
statusReason: 1) Tests\Feature\Core\Profile\Domain\ProfileTest::test_setUpdatedAt_should_return_self
Error: Call to protected method Core\Profile\Domain\Profile::updatedAt() from scope Tests\Feature\Core\Profile\Domain\ProfileTest

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Domain/ProfileTest.php:219

2) Tests\Feature\Core\Profile\Domain\ProfileTest::test_updatedAt_should_return_value_object
Error: Ca

[Killed] PublicVisibility
core/Profile/Domain/Profile.php:153:5
         return $this->updatedAt;
     }
 
-    public function setUpdatedAt(ProfileUpdatedAt $updatedAt): self
+    protected function setUpdatedAt(ProfileUpdatedAt $updatedAt): self
     {
         $this->updatedAt = $updatedAt;
killedBy: Tests\Feature\Core\Profile\Domain\ProfileTest::test_setUpdatedAt_should_return_self
statusReason: 1) Tests\Feature\Core\Profile\Domain\ProfileTest::test_setUpdatedAt_should_return_self
Error: Call to protected method Core\Profile\Domain\Profile::setUpdatedAt() from scope Tests\Feature\Core\Profile\Domain\ProfileTest

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Domain/ProfileTest.php:215

ERRORS!
Tests: 19, Assertions: 40, Errors: 1.
