[Survived] Foreach_
core/Profile/Domain/Profiles.php:13:9
 
     public function __construct(Profile ...$profiles)
     {
-        foreach ($profiles as $profile) {
-            $this->addItem($profile);
-        }
+        foreach ([] as $profile) {
     }
 

[Survived] MethodCallRemoval
core/Profile/Domain/Profiles.php:14:13
     public function __construct(Profile ...$profiles)
     {
         foreach ($profiles as $profile) {
-            $this->addItem($profile);
+            
         }
     }
