[Killed] DecrementInteger
Profile/Domain/ValueObjects/ModulePosition.php:11:5
 {
     private int $value;
 
-    public function __construct(?int $value = 1)
+    public function __construct(?int $value = 0)
     {
         $this->value = $value;
killedBy: Tests\Feature\Core\Profile\Domain\ValueObjects\ModulePositionTest::test_value_should_return_null
statusReason: 1) Tests\Feature\Core\Profile\Domain\ValueObjects\ModulePositionTest::test_value_should_return_null
Failed asserting that 0 is identical to 1.

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Domain/ValueObjects/ModulePositionTest.php:30

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] IncrementInteger
Profile/Domain/ValueObjects/ModulePosition.php:11:5
 {
     private int $value;
 
-    public function __construct(?int $value = 1)
+    public function __construct(?int $value = 2)
     {
         $this->value = $value;
killedBy: Tests\Feature\Core\Profile\Domain\ValueObjects\ModulePositionTest::test_value_should_return_null
statusReason: 1) Tests\Feature\Core\Profile\Domain\ValueObjects\ModulePositionTest::test_value_should_return_null
Failed asserting that 2 is identical to 1.

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Domain/ValueObjects/ModulePositionTest.php:30

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.
