[Killed] DecrementInteger
Profile/Infrastructure/Commands/ModuleWarmup.php:59:9
      */
     public function handle(): int
     {
-        if ($this->option('id') == 0) {
+        if ($this->option('id') == -1) {
             $modules = $this->readRepository->getAll();
 
killedBy: Tests\Feature\Core\Profile\Infrastructure\Commands\ModuleWarmupTest::test_handle_should_update_module_in_repositories
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Commands\ModuleWarmupTest::test_handle_should_update_module_in_repositories
Symfony\Component\Console\Input\InputInterface::getOption('id'): mixed was not expected to be called more than once.

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Console/Concerns/InteractsWithIO.php:120
/var/www/abacusSystem-new/src/core/Profile/Infrastruct

[Killed] Equal
Profile/Infrastructure/Commands/ModuleWarmup.php:59:9
      */
     public function handle(): int
     {
-        if ($this->option('id') == 0) {
+        if ($this->option('id') != 0) {
             $modules = $this->readRepository->getAll();
 
killedBy: Tests\Feature\Core\Profile\Infrastructure\Commands\ModuleWarmupTest::test_handle_should_update_module_in_repositories
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Commands\ModuleWarmupTest::test_handle_should_update_module_in_repositories
Symfony\Component\Console\Input\InputInterface::getOption('id'): mixed was not expected to be called more than once.

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Console/Concerns/InteractsWithIO.php:120
/var/www/abacusSystem-new/src/core/Profile/Infrastruct

[Killed] Foreach_
Profile/Infrastructure/Commands/ModuleWarmup.php:62:13
         if ($this->option('id') == 0) {
             $modules = $this->readRepository->getAll();
 
-            foreach ($this->repositories as $repository) {
-                foreach ($modules->aggregator() as $item) {
-
-                    try {
-                        $module = $this->readRepository->find($this->moduleFactory->buildModuleId($item));
-
-                        $repository->persistModule($module);
-                    } catch (Exception $exception) {
-                        $this->logger->error($exception->getMessage(), $exception->getTrace());
-
-                        return CommandSymfony::FAILURE;
-                    }
-                }
-            }
+            foreach ([] as $repository) {
         } else {
             $moduleId = $this->moduleFactory->buildModuleId($this->option('id'));
killedBy: Tests\Feature\Core\Profile\Infrastructure\Commands\ModuleWarmupTest::test_handle_should_update_module_in_repositories
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Commands\ModuleWarmupTest::test_handle_should_update_module_in_repositories
Expectation failed for method name is "buildModuleId" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] Foreach_
Profile/Infrastructure/Commands/ModuleWarmup.php:63:17
             $modules = $this->readRepository->getAll();
 
             foreach ($this->repositories as $repository) {
-                foreach ($modules->aggregator() as $item) {
-
-                    try {
-                        $module = $this->readRepository->find($this->moduleFactory->buildModuleId($item));
-
-                        $repository->persistModule($module);
-                    } catch (Exception $exception) {
-                        $this->logger->error($exception->getMessage(), $exception->getTrace());
-
-                        return CommandSymfony::FAILURE;
-                    }
-                }
+                foreach ([] as $item) {
             }
         } else {
killedBy: Tests\Feature\Core\Profile\Infrastructure\Commands\ModuleWarmupTest::test_handle_should_update_module_in_repositories
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Commands\ModuleWarmupTest::test_handle_should_update_module_in_repositories
Expectation failed for method name is "buildModuleId" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] MethodCallRemoval
Profile/Infrastructure/Commands/ModuleWarmup.php:68:25
                     try {
                         $module = $this->readRepository->find($this->moduleFactory->buildModuleId($item));
 
-                        $repository->persistModule($module);
+                        
                     } catch (Exception $exception) {
                         $this->logger->error($exception->getMessage(), $exception->getTrace());
killedBy: Tests\Feature\Core\Profile\Infrastructure\Commands\ModuleWarmupTest::test_handle_should_update_module_in_repositories
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Commands\ModuleWarmupTest::test_handle_should_update_module_in_repositories
Expectation failed for method name is "persistModule" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 6, Failures: 1.

[Killed] Foreach_
Profile/Infrastructure/Commands/ModuleWarmup.php:79:13
         } else {
             $moduleId = $this->moduleFactory->buildModuleId($this->option('id'));
 
-            foreach ($this->repositories as $repository) {
-                try {
-                    $module = $this->readRepository->find($moduleId);
-
-                    $repository->persistModule($module);
-                } catch (Exception $exception) {
-                    $this->logger->error($exception->getMessage(), $exception->getTrace());
-
-                    return CommandSymfony::FAILURE;
-                }
-            }
+            foreach ([] as $repository) {
         }
 
killedBy: Tests\Feature\Core\Profile\Infrastructure\Commands\ModuleWarmupTest::test_handle_should_update_module_with_option_id_in_repositories
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Commands\ModuleWarmupTest::test_handle_should_update_module_with_option_id_in_repositories
Expectation failed for method name is "find" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.

[Killed] MethodCallRemoval
Profile/Infrastructure/Commands/ModuleWarmup.php:92:9
             }
         }
 
-        $this->logger->info('Command executed');
+        
         return CommandSymfony::SUCCESS;
     }
killedBy: Tests\Feature\Core\Profile\Infrastructure\Commands\ModuleWarmupTest::test_handle_should_update_module_in_repositories
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Commands\ModuleWarmupTest::test_handle_should_update_module_in_repositories
Expectation failed for method name is "info" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.
