[Killed] MethodCallRemoval
Profile/Infrastructure/Commands/ProfileWarmup.php:30:9
         ProfileRepositoryContract ...$repositories,
     ) {
 
-        parent::__construct();
+        
         $this->logger = $logger;
         $this->profileFactory = $profileFactory;
killedBy: Tests\Feature\Core\Profile\Infrastructure\Commands\ProfileWarmupTest::test_name_and_description_should_return_correct
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Commands\ProfileWarmupTest::test_name_and_description_should_return_correct
Failed asserting that null is identical to 'profile:warmup'.

/var/www/abacusSystem-new/tests/Feature/Core/Profile/Infrastructure/Commands/ProfileWarmupTest.php:61

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Foreach_
Profile/Infrastructure/Commands/ProfileWarmup.php:63:13
         if ($this->option('id') == 0) {
             $profiles = $this->readRepository->getAll();
 
-            foreach ($this->repositories as $repository) {
-                foreach ($profiles->aggregator() as $item) {
-                    try {
-                        $profile = $this->readRepository->find($this->profileFactory->buildProfileId($item));
-                        $repository->persistProfile($profile);
-                    } catch (Exception $exception) {
-                        $this->logger->error($exception->getMessage(), $exception->getTrace());
-                        return CommandSymfony::FAILURE;
-                    }
-                }
-            }
+            foreach ([] as $repository) {
         } else {
             $profileId = $this->profileFactory->buildProfileId($this->option('id'));
killedBy: Tests\Feature\Core\Profile\Infrastructure\Commands\ProfileWarmupTest::test_handle_should_update_profile_in_repositories
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Commands\ProfileWarmupTest::test_handle_should_update_profile_in_repositories
Expectation failed for method name is "find" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] Foreach_
Profile/Infrastructure/Commands/ProfileWarmup.php:64:17
             $profiles = $this->readRepository->getAll();
 
             foreach ($this->repositories as $repository) {
-                foreach ($profiles->aggregator() as $item) {
-                    try {
-                        $profile = $this->readRepository->find($this->profileFactory->buildProfileId($item));
-                        $repository->persistProfile($profile);
-                    } catch (Exception $exception) {
-                        $this->logger->error($exception->getMessage(), $exception->getTrace());
-                        return CommandSymfony::FAILURE;
-                    }
-                }
+                foreach ([] as $item) {
             }
         } else {
killedBy: Tests\Feature\Core\Profile\Infrastructure\Commands\ProfileWarmupTest::test_handle_should_update_profile_in_repositories
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Commands\ProfileWarmupTest::test_handle_should_update_profile_in_repositories
Expectation failed for method name is "find" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
Profile/Infrastructure/Commands/ProfileWarmup.php:67:25
                 foreach ($profiles->aggregator() as $item) {
                     try {
                         $profile = $this->readRepository->find($this->profileFactory->buildProfileId($item));
-                        $repository->persistProfile($profile);
+                        
                     } catch (Exception $exception) {
                         $this->logger->error($exception->getMessage(), $exception->getTrace());
killedBy: Tests\Feature\Core\Profile\Infrastructure\Commands\ProfileWarmupTest::test_handle_should_update_profile_in_repositories
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Commands\ProfileWarmupTest::test_handle_should_update_profile_in_repositories
Expectation failed for method name is "persistProfile" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] Foreach_
Profile/Infrastructure/Commands/ProfileWarmup.php:77:13
         } else {
             $profileId = $this->profileFactory->buildProfileId($this->option('id'));
 
-            foreach ($this->repositories as $repository) {
-                try {
-                    $profile = $this->readRepository->find($profileId);
-
-                    $repository->persistProfile($profile);
-                } catch (Exception $exception) {
-                    $this->logger->error($exception->getMessage(), $exception->getTrace());
-                    return CommandSymfony::FAILURE;
-                }
-            }
+            foreach ([] as $repository) {
         }
 
killedBy: Tests\Feature\Core\Profile\Infrastructure\Commands\ProfileWarmupTest::test_handle_should_update_profile_with_id_in_repositories
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Commands\ProfileWarmupTest::test_handle_should_update_profile_with_id_in_repositories
Expectation failed for method name is "find" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
Profile/Infrastructure/Commands/ProfileWarmup.php:81:21
                 try {
                     $profile = $this->readRepository->find($profileId);
 
-                    $repository->persistProfile($profile);
+                    
                 } catch (Exception $exception) {
                     $this->logger->error($exception->getMessage(), $exception->getTrace());
killedBy: Tests\Feature\Core\Profile\Infrastructure\Commands\ProfileWarmupTest::test_handle_should_update_profile_with_id_in_repositories
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Commands\ProfileWarmupTest::test_handle_should_update_profile_with_id_in_repositories
Expectation failed for method name is "persistProfile" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.
