[Killed] Foreach_
Profile/Infrastructure/Management/ModuleService.php:66:9
         $request = new SearchModulesRequest($filters);
 
         $modules = $this->searchModules->execute($request);
-        foreach ($modules->aggregator() as $item) {
-            $module = $this->searchModuleById($item);
-            $modules->addItem($module);
-        }
+        foreach ([] as $item) {
 
         return $modules;
killedBy: Tests\Feature\Core\Profile\Infrastructure\Management\ModuleServiceTest::test_searchModules_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Management\ModuleServiceTest::test_searchModules_should_return_object
Expectation failed for method name is "buildModuleId" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
Profile/Infrastructure/Management/ModuleService.php:68:13
         $modules = $this->searchModules->execute($request);
         foreach ($modules->aggregator() as $item) {
             $module = $this->searchModuleById($item);
-            $modules->addItem($module);
+            
         }
 
killedBy: Tests\Feature\Core\Profile\Infrastructure\Management\ModuleServiceTest::test_searchModules_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Management\ModuleServiceTest::test_searchModules_should_return_object
Expectation failed for method name is "addItem" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 6, Failures: 1.

[Killed] MethodCallRemoval
Profile/Infrastructure/Management/ModuleService.php:96:9
             $this->moduleFactory->buildModuleId($moduleId)
         );
 
-        $this->deleteModule->execute($request);
+        
     }
 
killedBy: Tests\Feature\Core\Profile\Infrastructure\Management\ModuleServiceTest::test_deleteModule_should_return_void
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Management\ModuleServiceTest::test_deleteModule_should_return_void
Expectation failed for method name is "execute" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.
