[Killed] Foreach_
Profile/Infrastructure/Management/ProfileService.php:69:9
         $profile = $this->searchProfileById->execute($request);
 
         $modules = new Modules;
-        foreach ($profile->modulesAggregator() as $item) {
-            try {
-                $module = $this->moduleService->searchModuleById($item);
-
-                if ($module->state()->isActivated()) {
-                    $modules->addItem($module);
-                }
-            } catch (Exception $exception) {
-                $this->logger->warning($exception->getMessage(), $exception->getTrace());
-            }
-        }
+        foreach ([] as $item) {
         $profile->setModules($modules);
 
killedBy: Tests\Feature\Core\Profile\Infrastructure\Management\ProfileServiceTest::test_searchProfileById_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Management\ProfileServiceTest::test_searchProfileById_should_return_object
Expectation failed for method name is "searchModuleById" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Survived] IfNegation
Profile/Infrastructure/Management/ProfileService.php:73:17
             try {
                 $module = $this->moduleService->searchModuleById($item);
 
-                if ($module->state()->isActivated()) {
-                    $modules->addItem($module);
-                }
+                if (!$module->state()->isActivated()) {
             } catch (Exception $exception) {
                 $this->logger->warning($exception->getMessage(), $exception->getTrace());

[Survived] MethodCallRemoval
Profile/Infrastructure/Management/ProfileService.php:74:21
                 $module = $this->moduleService->searchModuleById($item);
 
                 if ($module->state()->isActivated()) {
-                    $modules->addItem($module);
+                    
                 }
             } catch (Exception $exception) {

[Killed] MethodCallRemoval
Profile/Infrastructure/Management/ProfileService.php:77:17
                     $modules->addItem($module);
                 }
             } catch (Exception $exception) {
-                $this->logger->warning($exception->getMessage(), $exception->getTrace());
+                
             }
         }
killedBy: Tests\Feature\Core\Profile\Infrastructure\Management\ProfileServiceTest::test_searchProfileById_should_return_exception
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Management\ProfileServiceTest::test_searchProfileById_should_return_exception
Expectation failed for method name is "warning" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 6, Failures: 1.

[Survived] MethodCallRemoval
Profile/Infrastructure/Management/ProfileService.php:80:9
                 $this->logger->warning($exception->getMessage(), $exception->getTrace());
             }
         }
-        $profile->setModules($modules);
+        
 
         return $profile;

[Killed] Foreach_
Profile/Infrastructure/Management/ProfileService.php:93:9
         $request = new SearchProfilesRequest($filters);
 
         $profiles = $this->searchProfiles->execute($request);
-        foreach ($profiles->aggregator() as $item) {
-            $profile = $this->searchProfileById($item);
-            $profiles->addItem($profile);
-        }
+        foreach ([] as $item) {
 
         return $profiles;
killedBy: Tests\Feature\Core\Profile\Infrastructure\Management\ProfileServiceTest::test_searchProfiles_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Management\ProfileServiceTest::test_searchProfiles_should_return_object
Expectation failed for method name is "execute" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
Profile/Infrastructure/Management/ProfileService.php:95:13
         $profiles = $this->searchProfiles->execute($request);
         foreach ($profiles->aggregator() as $item) {
             $profile = $this->searchProfileById($item);
-            $profiles->addItem($profile);
+            
         }
 
killedBy: Tests\Feature\Core\Profile\Infrastructure\Management\ProfileServiceTest::test_searchProfiles_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Management\ProfileServiceTest::test_searchProfiles_should_return_object
Expectation failed for method name is "addItem" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.

[Killed] MethodCallRemoval
Profile/Infrastructure/Management/ProfileService.php:123:9
             $this->profileFactory->buildProfileId($id)
         );
 
-        $this->deleteProfile->execute($request);
+        
     }
 
killedBy: Tests\Feature\Core\Profile\Infrastructure\Management\ProfileServiceTest::test_deleteProfile_should_return_void
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Management\ProfileServiceTest::test_deleteProfile_should_return_void
Expectation failed for method name is "execute" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.
