[NoCoverage] ConcatOperandRemoval
Infrastructure/Persistence/Repositories/ChainModuleRepository.php:38:13
         try {
             return $this->read(__FUNCTION__, $id);
         } catch (Exception $exception) {
-            throw new ModuleNotFoundException('Module not found by id '.$id->value());
+            throw new ModuleNotFoundException('Module not found by id ');
         }
     }

[NoCoverage] Throw_
Infrastructure/Persistence/Repositories/ChainModuleRepository.php:38:13
         try {
             return $this->read(__FUNCTION__, $id);
         } catch (Exception $exception) {
-            throw new ModuleNotFoundException('Module not found by id '.$id->value());
+            new ModuleNotFoundException('Module not found by id ' . $id->value());
         }
     }

[NoCoverage] Throw_
Infrastructure/Persistence/Repositories/ChainModuleRepository.php:63:13
         try {
             return $this->read(__FUNCTION__, $filters);
         } catch (Exception $exception) {
-            throw new ModulesNotFoundException('Modules no found');
+            new ModulesNotFoundException('Modules no found');
         }
     }
