[NoCoverage] Throw_
Infrastructure/Persistence/Repositories/ChainProfileRepository.php:44:13
         try {
             return $this->read(__FUNCTION__, $id);
         } catch (Exception $exception) {
-            throw new ProfileNotFoundException($exception->getMessage());
+            new ProfileNotFoundException($exception->getMessage());
         }
     }

[NoCoverage] Throw_
Infrastructure/Persistence/Repositories/ChainProfileRepository.php:73:13
         try {
             return $this->read(__FUNCTION__, $filters);
         } catch (Exception $exception) {
-            throw new ProfilesNotFoundException($exception->getMessage());
+            new ProfilesNotFoundException($exception->getMessage());
         }
     }

[NoCoverage] PublicVisibility
Infrastructure/Persistence/Repositories/ChainProfileRepository.php:77:5
         }
     }
 
-    public function save(Profile $profile): void
+    protected function save(Profile $profile): void
     {
         $this->persistence(__FUNCTION__, $profile);

[NoCoverage] MethodCallRemoval
Infrastructure/Persistence/Repositories/ChainProfileRepository.php:79:9
 
     public function save(Profile $profile): void
     {
-        $this->persistence(__FUNCTION__, $profile);
+        
     }
 

[NoCoverage] PublicVisibility
Infrastructure/Persistence/Repositories/ChainProfileRepository.php:82:5
         $this->persistence(__FUNCTION__, $profile);
     }
 
-    public function update(ProfileId $id, Profile $profile): void
+    protected function update(ProfileId $id, Profile $profile): void
     {
         $this->persistence(__FUNCTION__, $id, $profile);

[NoCoverage] MethodCallRemoval
Infrastructure/Persistence/Repositories/ChainProfileRepository.php:84:9
 
     public function update(ProfileId $id, Profile $profile): void
     {
-        $this->persistence(__FUNCTION__, $id, $profile);
+        
     }
 

[NoCoverage] PublicVisibility
Infrastructure/Persistence/Repositories/ChainProfileRepository.php:100:5
         return $this->write(__FUNCTION__, $profile);
     }
 
-    public function persistProfiles(Profiles $profiles): Profiles
+    protected function persistProfiles(Profiles $profiles): Profiles
     {
         return $this->write(__FUNCTION__, $profiles);
