[Killed] IfNegation
Infrastructure/Persistence/Repositories/EloquentModuleRepository.php:67:9
 
         $data = $builder->first();
 
-        if (is_null($data)) {
-            throw new ModuleNotFoundException('Module not found with id: '.$id->value());
-        }
+        if (!is_null($data)) {
 
         $moduleModel = $this->updateAttributesModelModule((array) $data);
killedBy: Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\EloquentModuleRepositoryTest::test_find_should_return_module_object
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\EloquentModuleRepositoryTest::test_find_should_return_module_object
Core\Profile\Domain\ValueObjects\ModuleId::value(): int was not expected to be called more than once.

/var/www/abacusSystem-new/src/core/Profile/Infrastructure/Persistence/Repositories/EloquentModuleRepository.php:50
/var/www/abacusSystem-new/tests/Feature/Core

[Killed] Throw_
Infrastructure/Persistence/Repositories/EloquentModuleRepository.php:68:13
         $data = $builder->first();
 
         if (is_null($data)) {
-            throw new ModuleNotFoundException('Module not found with id: '.$id->value());
+            new ModuleNotFoundException('Module not found with id: ' . $id->value());
         }
 
killedBy: Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\EloquentModuleRepositoryTest::test_find_should_return_exception
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\EloquentModuleRepositoryTest::test_find_should_return_exception
Illuminate\Database\Eloquent\Model::fill([]) was not expected to be called.

/var/www/abacusSystem-new/src/core/Profile/Infrastructure/Persistence/Repositories/EloquentModuleRepository.php:138
/var/www/abacusSystem-new/src/core/Profile/Infrastructure/Persistence/Rep

[Killed] Concat
Infrastructure/Persistence/Repositories/EloquentModuleRepository.php:68:13
         $data = $builder->first();
 
         if (is_null($data)) {
-            throw new ModuleNotFoundException('Module not found with id: '.$id->value());
+            throw new ModuleNotFoundException($id->value() . 'Module not found with id: ');
         }
 
killedBy: Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\EloquentModuleRepositoryTest::test_find_should_return_exception
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\EloquentModuleRepositoryTest::test_find_should_return_exception
Failed asserting that exception message '1Module not found with id: ' contains 'Module not found with id: 1'.

FAILURES!
Tests: 1, Assertions: 6, Failures: 1.

[Killed] IfNegation
Infrastructure/Persistence/Repositories/EloquentModuleRepository.php:84:9
 
         $builder = $this->database->table($this->getTable());
 
-        if (is_null($moduleId)) {
-            $moduleId = $builder->insertGetId($dataModel);
-            $module->id()->setValue($moduleId);
-        } else {
-            $builder->where('mod_id', $moduleId);
-            $builder->update($dataModel);
-        }
+        if (!is_null($moduleId)) {
 
         return $module;
killedBy: Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\EloquentModuleRepositoryTest::test_persistModule_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\EloquentModuleRepositoryTest::test_persistModule_should_update_and_return_object
Core\Profile\Domain\Module::id(): Core\Profile\Domain\ValueObjects\ModuleId was not expected to be called more than 2 times.

/var/www/abacusSystem-new/src/core/Profile/Infrastructure/Persistence/Repositories/EloquentModuleRepository.php:63
/var/www

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentModuleRepository.php:86:13
 
         if (is_null($moduleId)) {
             $moduleId = $builder->insertGetId($dataModel);
-            $module->id()->setValue($moduleId);
+            
         } else {
             $builder->where('mod_id', $moduleId);
killedBy: Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\EloquentModuleRepositoryTest::test_persistModule_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\EloquentModuleRepositoryTest::test_persistModule_should_return_object
Expectation failed for method name is "id" when invoked 3 times.
Method was expected to be called 3 times, actually called 2 times.

FAILURES!
Tests: 1, Assertions: 8, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentModuleRepository.php:88:13
             $moduleId = $builder->insertGetId($dataModel);
             $module->id()->setValue($moduleId);
         } else {
-            $builder->where('mod_id', $moduleId);
+            
             $builder->update($dataModel);
         }
killedBy: Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\EloquentModuleRepositoryTest::test_persistModule_should_update_and_return_object
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\EloquentModuleRepositoryTest::test_persistModule_should_update_and_return_object
Mockery\Exception\InvalidCountException: Method where('mod_id', 2) from Mockery_1_Illuminate_Database_Query_Builder should be called
 exactly 2 times but called 1 times.

/var/www/abacusSystem-new/vendor/mockery/mockery/library/Mockery/CountValidato

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentModuleRepository.php:89:13
             $module->id()->setValue($moduleId);
         } else {
             $builder->where('mod_id', $moduleId);
-            $builder->update($dataModel);
+            
         }
 
killedBy: Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\EloquentModuleRepositoryTest::test_persistModule_should_update_and_return_object
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\EloquentModuleRepositoryTest::test_persistModule_should_update_and_return_object
Mockery\Exception\InvalidCountException: Method update([]) from Mockery_1_Illuminate_Database_Query_Builder should be called
 exactly 1 times but called 0 times.

/var/www/abacusSystem-new/vendor/mockery/mockery/library/Mockery/CountValidator/Exact.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentModuleRepository.php:109:9
             $builder->whereFullText($this->model->getSearchField(), $filters['q']);
         }
 
-        $builder->orderBy('mod_position');
+        
         $moduleCollection = $builder->get(['mod_id']);
 
killedBy: Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\EloquentModuleRepositoryTest::test_getAll_should_return_exception
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\EloquentModuleRepositoryTest::test_getAll_should_return_exception
Mockery\Exception\InvalidCountException: Method orderBy('mod_position') from Mockery_1_Illuminate_Database_Query_Builder should be called
 exactly 1 times but called 0 times.

/var/www/abacusSystem-new/vendor/mockery/mockery/library/Mockery/CountValidator/Exact.ph

[Killed] Throw_
Infrastructure/Persistence/Repositories/EloquentModuleRepository.php:113:13
         $moduleCollection = $builder->get(['mod_id']);
 
         if (empty($moduleCollection)) {
-            throw new ModulesNotFoundException('Modules not found');
+            new ModulesNotFoundException('Modules not found');
         }
 
killedBy: Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\EloquentModuleRepositoryTest::test_getAll_should_return_exception
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\EloquentModuleRepositoryTest::test_getAll_should_return_exception
Core\Profile\Infrastructure\Persistence\Translators\ModuleTranslator::setCollection([]): Core\Profile\Infrastructure\Persistence\Translators\ModuleTranslator was not expected to be called.

/var/www/abacusSystem-new/src/core/Profile/Infrastructure/Persistence/Repo

[Killed] Foreach_
Infrastructure/Persistence/Repositories/EloquentModuleRepository.php:117:9
         }
 
         $collection = [];
-        foreach ($moduleCollection as $item) {
-            $moduleModel = $this->updateAttributesModelModule((array) $item);
-            $collection[] = $moduleModel->id();
-        }
+        foreach ([] as $item) {
 
         $modules = $this->moduleTranslator->setCollection($collection)->toDomainCollection();
killedBy: Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\EloquentModuleRepositoryTest::test_getAll_should_return_collection
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\EloquentModuleRepositoryTest::test_getAll_should_return_collection
Expectation failed for method name is "setCollection" when invoked 1 time
Parameter 0 for invocation Core\Profile\Infrastructure\Persistence\Translators\ModuleTranslator::setCollection([]): Core\Profile\Infrastructure\Persistence\Translators\ModuleTranslator does

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentModuleRepository.php:123:9
         }
 
         $modules = $this->moduleTranslator->setCollection($collection)->toDomainCollection();
-        $modules->setFilters($filters);
+        
 
         return $modules;
killedBy: Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\EloquentModuleRepositoryTest::test_getAll_should_return_collection
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\EloquentModuleRepositoryTest::test_getAll_should_return_collection
Expectation failed for method name is "setFilters" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 10, Failures: 1.

[Killed] PublicVisibility
Infrastructure/Persistence/Repositories/EloquentModuleRepository.php:128:5
         return $modules;
     }
 
-    public function persistModules(Modules $modules): Modules
+    protected function persistModules(Modules $modules): Modules
     {
         return $modules;
killedBy: Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\EloquentModuleRepositoryTest::test_persistModules_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\EloquentModuleRepositoryTest::test_persistModules_should_return_object
Error: Call to protected method Core\Profile\Infrastructure\Persistence\Repositories\EloquentModuleRepository::persistModules() from scope Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\EloquentModuleRepositoryTest

/var/www/abacusSystem-n

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentModuleRepository.php:140:9
     public function deleteModule(ModuleId $id): void
     {
         $builder = $this->database->table($this->getTable());
-        $builder->where('mod_id', $id->value());
+        
         $data = $builder->first();
 
killedBy: Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\EloquentModuleRepositoryTest::test_deleteModule_should_return_void
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\EloquentModuleRepositoryTest::test_deleteModule_should_return_void
Expectation failed for method name is "value" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 7, Failures: 1.

[Killed] ConcatOperandRemoval
Infrastructure/Persistence/Repositories/EloquentModuleRepository.php:144:13
         $data = $builder->first();
 
         if (is_null($data)) {
-            throw new ModuleNotFoundException('Module not found with id: '.$id->value());
+            throw new ModuleNotFoundException($id->value());
         }
 
killedBy: Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\EloquentModuleRepositoryTest::test_deleteModule_should_return_exception
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\EloquentModuleRepositoryTest::test_deleteModule_should_return_exception
Failed asserting that exception message '1' contains 'Module not found with id: 1'.

FAILURES!
Tests: 1, Assertions: 6, Failures: 1.

[Killed] CastArray
Infrastructure/Persistence/Repositories/EloquentModuleRepository.php:147:9
             throw new ModuleNotFoundException('Module not found with id: '.$id->value());
         }
 
-        $moduleModel = $this->updateAttributesModelModule((array) $data);
+        $moduleModel = $this->updateAttributesModelModule($data);
         $moduleModel->changeState(ValueObjectStatus::STATE_DELETE);
         $moduleModel->changeDeletedAt(new \DateTime);
killedBy: Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\EloquentModuleRepositoryTest::test_deleteModule_should_return_void
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\EloquentModuleRepositoryTest::test_deleteModule_should_return_void

/var/www/abacusSystem-new/src/core/Profile/Infrastructure/Persistence/Repositories/EloquentModuleRepository.php:136
/var/www/abacusSystem-new/src/core/Profile/Infrastructure/Persistence/Repositories/EloquentModuleRepository.php:110
/var/www/abacusSystem-new/test

[Survived] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentModuleRepository.php:148:9
         }
 
         $moduleModel = $this->updateAttributesModelModule((array) $data);
-        $moduleModel->changeState(ValueObjectStatus::STATE_DELETE);
+        
         $moduleModel->changeDeletedAt(new \DateTime);
         $dataModel = $moduleModel->toArray();

[Survived] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentModuleRepository.php:149:9
 
         $moduleModel = $this->updateAttributesModelModule((array) $data);
         $moduleModel->changeState(ValueObjectStatus::STATE_DELETE);
-        $moduleModel->changeDeletedAt(new \DateTime);
+        
         $dataModel = $moduleModel->toArray();
 

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentModuleRepository.php:152:9
         $moduleModel->changeDeletedAt(new \DateTime);
         $dataModel = $moduleModel->toArray();
 
-        $builder->update($dataModel);
+        
     }
 
killedBy: Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\EloquentModuleRepositoryTest::test_deleteModule_should_return_void
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\EloquentModuleRepositoryTest::test_deleteModule_should_return_void
Mockery\Exception\InvalidCountException: Method update([]) from Mockery_1_Illuminate_Database_Query_Builder should be called
 exactly 1 times but called 0 times.

/var/www/abacusSystem-new/vendor/mockery/mockery/library/Mockery/CountValidator/Exact.php:32
/var/ww

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentModuleRepository.php:158:9
     private function domainToModel(Module $domain): ModuleModel
     {
         $builder = $this->database->table($this->getTable());
-        $builder->where('mod_id', $domain->id()->value());
+        
         $data = $builder->first();
         $model = $this->updateAttributesModelModule((array) $data);
killedBy: Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\EloquentModuleRepositoryTest::test_persistModule_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\EloquentModuleRepositoryTest::test_persistModule_should_return_object
Expectation failed for method name is "id" when invoked 3 times.
Method was expected to be called 3 times, actually called 2 times.

FAILURES!
Tests: 1, Assertions: 8, Failures: 1.

[Survived] CastArray
Infrastructure/Persistence/Repositories/EloquentModuleRepository.php:160:9
         $builder = $this->database->table($this->getTable());
         $builder->where('mod_id', $domain->id()->value());
         $data = $builder->first();
-        $model = $this->updateAttributesModelModule((array) $data);
+        $model = $this->updateAttributesModelModule($data);
 
         $model->changeId($domain->id()->value());

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentModuleRepository.php:164:9
 
         $model->changeId($domain->id()->value());
         $model->changeName($domain->name()->value());
-        $model->changeMenuKey($domain->menuKey()->value());
+        
         $model->changeRoute($domain->route()->value());
         $model->changeIcon($domain->icon()->value());
killedBy: Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\EloquentModuleRepositoryTest::test_persistModule_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\EloquentModuleRepositoryTest::test_persistModule_should_return_object
Expectation failed for method name is "changeMenuKey" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 7, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentModuleRepository.php:165:9
         $model->changeId($domain->id()->value());
         $model->changeName($domain->name()->value());
         $model->changeMenuKey($domain->menuKey()->value());
-        $model->changeRoute($domain->route()->value());
+        
         $model->changeIcon($domain->icon()->value());
         $model->changeState($domain->state()->value());
killedBy: Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\EloquentModuleRepositoryTest::test_persistModule_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\EloquentModuleRepositoryTest::test_persistModule_should_return_object
Expectation failed for method name is "changeRoute" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 7, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentModuleRepository.php:166:9
         $model->changeName($domain->name()->value());
         $model->changeMenuKey($domain->menuKey()->value());
         $model->changeRoute($domain->route()->value());
-        $model->changeIcon($domain->icon()->value());
+        
         $model->changeState($domain->state()->value());
         $model->changeSearch($domain->search()->value());
killedBy: Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\EloquentModuleRepositoryTest::test_persistModule_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\EloquentModuleRepositoryTest::test_persistModule_should_return_object
Expectation failed for method name is "changeIcon" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 7, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentModuleRepository.php:167:9
         $model->changeMenuKey($domain->menuKey()->value());
         $model->changeRoute($domain->route()->value());
         $model->changeIcon($domain->icon()->value());
-        $model->changeState($domain->state()->value());
+        
         $model->changeSearch($domain->search()->value());
         $model->changePosition($domain->position()->value());
killedBy: Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\EloquentModuleRepositoryTest::test_persistModule_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\EloquentModuleRepositoryTest::test_persistModule_should_return_object
Expectation failed for method name is "changeState" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 7, Failures: 1.

[Survived] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentModuleRepository.php:169:9
         $model->changeIcon($domain->icon()->value());
         $model->changeState($domain->state()->value());
         $model->changeSearch($domain->search()->value());
-        $model->changePosition($domain->position()->value());
+        
         $model->changeCreatedAt($domain->createdAt()->value());
 

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentModuleRepository.php:170:9
         $model->changeState($domain->state()->value());
         $model->changeSearch($domain->search()->value());
         $model->changePosition($domain->position()->value());
-        $model->changeCreatedAt($domain->createdAt()->value());
+        
 
         if (! is_null($domain->updatedAt()->value())) {
killedBy: Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\EloquentModuleRepositoryTest::test_persistModule_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\EloquentModuleRepositoryTest::test_persistModule_should_return_object
Expectation failed for method name is "changeCreatedAt" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 7, Failures: 1.
