[Killed] Throw_
Infrastructure/Persistence/Repositories/RedisModuleRepository.php:67:13
             $data = Redis::get($this->moduleKey($id));
         } catch (Exception $exception) {
             $this->logger->error($exception->getMessage(), $exception->getTrace());
-            throw new ModuleNotFoundException('Module not found by id '.$id->value());
+            new ModuleNotFoundException('Module not found by id ' . $id->value());
         }
 
killedBy: Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\RedisModuleRepositoryTest::test_find_should_return_exception
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\RedisModuleRepositoryTest::test_find_should_return_exception
Failed asserting that exception of type "ErrorException" matches expected exception "Core\Profile\Exceptions\ModuleNotFoundException". Message was: "Undefined variable $data" at
/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Foundation/Bootstrap/Hand

[Killed] ConcatOperandRemoval
Infrastructure/Persistence/Repositories/RedisModuleRepository.php:67:13
             $data = Redis::get($this->moduleKey($id));
         } catch (Exception $exception) {
             $this->logger->error($exception->getMessage(), $exception->getTrace());
-            throw new ModuleNotFoundException('Module not found by id '.$id->value());
+            throw new ModuleNotFoundException($id->value());
         }
 
killedBy: Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\RedisModuleRepositoryTest::test_find_should_return_exception
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\RedisModuleRepositoryTest::test_find_should_return_exception
Failed asserting that exception message '1' contains 'Module not found by id 1'.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/RedisModuleRepository.php:94:13
 
         $moduleData = $this->moduleDataTransformer->write($module)->read();
         try {
-            Redis::set($moduleKey, json_encode($moduleData));
+            
         } catch (Exception $exception) {
             $this->logger->error($exception->getMessage(), $exception->getTrace());
killedBy: Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\RedisModuleRepositoryTest::test_persistModule_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\RedisModuleRepositoryTest::test_persistModule_should_return_exception
Failed asserting that exception of type "Core\Profile\Exceptions\ModulePersistException" is thrown.

ERRORS!
Tests: 2, Assertions: 8, Errors: 1, Failures: 1.

[Killed] ConcatOperandRemoval
Infrastructure/Persistence/Repositories/RedisModuleRepository.php:97:13
             Redis::set($moduleKey, json_encode($moduleData));
         } catch (Exception $exception) {
             $this->logger->error($exception->getMessage(), $exception->getTrace());
-            throw new ModulePersistException('It could not persist Module with key '.$moduleKey.' in redis');
+            throw new ModulePersistException($moduleKey . ' in redis');
         }
 
killedBy: Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\RedisModuleRepositoryTest::test_persistModule_should_return_exception
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\RedisModuleRepositoryTest::test_persistModule_should_return_exception
Failed asserting that exception message 'module::1 in redis' contains 'It could not persist Module with key module::1 in redis'.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] ConcatOperandRemoval
Infrastructure/Persistence/Repositories/RedisModuleRepository.php:97:13
             Redis::set($moduleKey, json_encode($moduleData));
         } catch (Exception $exception) {
             $this->logger->error($exception->getMessage(), $exception->getTrace());
-            throw new ModulePersistException('It could not persist Module with key '.$moduleKey.' in redis');
+            throw new ModulePersistException('It could not persist Module with key ' . $moduleKey);
         }
 
killedBy: Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\RedisModuleRepositoryTest::test_persistModule_should_return_exception
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\RedisModuleRepositoryTest::test_persistModule_should_return_exception
Failed asserting that exception message 'It could not persist Module with key module::1' contains 'It could not persist Module with key module::1 in redis'.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/RedisModuleRepository.php:120:9
 
     public function deleteModule(ModuleId $id): void
     {
-        Redis::delete($this->moduleKey($id));
+        
     }
 }
killedBy: Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\RedisModuleRepositoryTest::test_deleteModule_should_return_void
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\RedisModuleRepositoryTest::test_deleteModule_should_return_void
Expectation failed for method name is "value" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.
