[Killed] Throw_
Infrastructure/Persistence/Repositories/RedisProfileRepository.php:73:13
             $data = Redis::get($this->profileKey($id));
         } catch (Exception $exception) {
             $this->logger->error($exception->getMessage(), $exception->getTrace());
-            throw new ProfileNotFoundException('Profile not found by id '.$id->value());
+            new ProfileNotFoundException('Profile not found by id ' . $id->value());
         }
 
killedBy: Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\RedisProfileRepositoryTest::test_find_should_return_exception
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\RedisProfileRepositoryTest::test_find_should_return_exception
Failed asserting that exception of type "ErrorException" matches expected exception "Core\Profile\Exceptions\ProfileNotFoundException". Message was: "Undefined variable $data" at
/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Foundation/Bootstrap/Ha

[Killed] ConcatOperandRemoval
Infrastructure/Persistence/Repositories/RedisProfileRepository.php:73:13
             $data = Redis::get($this->profileKey($id));
         } catch (Exception $exception) {
             $this->logger->error($exception->getMessage(), $exception->getTrace());
-            throw new ProfileNotFoundException('Profile not found by id '.$id->value());
+            throw new ProfileNotFoundException('Profile not found by id ');
         }
 
killedBy: Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\RedisProfileRepositoryTest::test_find_should_return_exception
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\RedisProfileRepositoryTest::test_find_should_return_exception
Failed asserting that exception message 'Profile not found by id ' contains 'Profile not found by id 1'.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] ConcatOperandRemoval
Infrastructure/Persistence/Repositories/RedisProfileRepository.php:99:13
             $data = Redis::get($this->profileKeyWithName($name));
         } catch (Exception $exception) {
             $this->logger->error($exception->getMessage(), $exception->getTrace());
-            throw new ProfileNotFoundException('Profile not found by name '.$name->value());
+            throw new ProfileNotFoundException($name->value());
         }
 
killedBy: Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\RedisProfileRepositoryTest::test_findCriteria_should_return_exception
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\RedisProfileRepositoryTest::test_findCriteria_should_return_exception
Failed asserting that exception message 'Jame' contains 'Profile not found by name Jame'.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] Concat
Infrastructure/Persistence/Repositories/RedisProfileRepository.php:99:13
             $data = Redis::get($this->profileKeyWithName($name));
         } catch (Exception $exception) {
             $this->logger->error($exception->getMessage(), $exception->getTrace());
-            throw new ProfileNotFoundException('Profile not found by name '.$name->value());
+            throw new ProfileNotFoundException($name->value() . 'Profile not found by name ');
         }
 
killedBy: Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\RedisProfileRepositoryTest::test_findCriteria_should_return_exception
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\RedisProfileRepositoryTest::test_findCriteria_should_return_exception
Failed asserting that exception message 'JameProfile not found by name ' contains 'Profile not found by name Jame'.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/RedisProfileRepository.php:118:9
 
     public function deleteProfile(ProfileId $id): void
     {
-        Redis::delete($this->profileKey($id));
+        
     }
 
killedBy: Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\RedisProfileRepositoryTest::test_deleteProfile_should_return_void
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\RedisProfileRepositoryTest::test_deleteProfile_should_return_void
Expectation failed for method name is "value" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/RedisProfileRepository.php:131:13
 
         try {
             $profileData = $this->dataTransformer->write($profile)->read();
-            Redis::set($profileKey, json_encode($profileData));
+            
             Redis::set($profileKeyName, json_encode($profileData));
         } catch (Exception $exception) {
killedBy: Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\RedisProfileRepositoryTest::test_persistProfile_should_return_exception
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\RedisProfileRepositoryTest::test_persistProfile_should_return_exception
Mockery\Exception\InvalidCountException: Method set('profile::1', '[]') from Mockery_0_Illuminate_Redis_RedisManager should be called
 exactly 1 times but called 0 times.

/var/www/abacusSystem-new/vendor/mockery/mockery/library/Mockery/CountValidator/Exact.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/RedisProfileRepository.php:132:13
         try {
             $profileData = $this->dataTransformer->write($profile)->read();
             Redis::set($profileKey, json_encode($profileData));
-            Redis::set($profileKeyName, json_encode($profileData));
+            
         } catch (Exception $exception) {
             $this->logger->error($exception->getMessage(), $exception->getTrace());
killedBy: Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\RedisProfileRepositoryTest::test_persistProfile_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\RedisProfileRepositoryTest::test_persistProfile_should_return_exception
Failed asserting that exception of type "Core\Profile\Exceptions\ProfilePersistException" is thrown.

ERRORS!
Tests: 2, Assertions: 11, Errors: 1, Failures: 1.

[Killed] Concat
Infrastructure/Persistence/Repositories/RedisProfileRepository.php:135:13
             Redis::set($profileKeyName, json_encode($profileData));
         } catch (Exception $exception) {
             $this->logger->error($exception->getMessage(), $exception->getTrace());
-            throw new ProfilePersistException('It could not persist Profile with key '.$profileKey.' in redis');
+            throw new ProfilePersistException($profileKey . 'It could not persist Profile with key ' . ' in redis');
         }
 
killedBy: Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\RedisProfileRepositoryTest::test_persistProfile_should_return_exception
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\RedisProfileRepositoryTest::test_persistProfile_should_return_exception
Failed asserting that exception message 'profile::1It could not persist Profile with key  in redis' contains 'It could not persist Profile with key profile::1 in redis'.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.

[Killed] Concat
Infrastructure/Persistence/Repositories/RedisProfileRepository.php:135:13
             Redis::set($profileKeyName, json_encode($profileData));
         } catch (Exception $exception) {
             $this->logger->error($exception->getMessage(), $exception->getTrace());
-            throw new ProfilePersistException('It could not persist Profile with key '.$profileKey.' in redis');
+            throw new ProfilePersistException('It could not persist Profile with key ' . ' in redis' . $profileKey);
         }
 
killedBy: Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\RedisProfileRepositoryTest::test_persistProfile_should_return_exception
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Persistence\Repositories\RedisProfileRepositoryTest::test_persistProfile_should_return_exception
Failed asserting that exception message 'It could not persist Profile with key  in redisprofile::1' contains 'It could not persist Profile with key profile::1 in redis'.

FAILURES!
Tests: 1, Assertions: 4, Failures: 1.
