[Killed] MethodCallRemoval
Infrastructure/Persistence/Translators/ModuleTranslator.php:52:9
             $this->moduleFactory->buildModuleCreatedAt($this->model->createdAt())
         );
 
-        $module->setPosition($this->moduleFactory->buildModulePosition($this->model->position()));
+        
 
         $module->setSearch(
killedBy: Tests\Feature\Core\Profile\Infrastructure\Persistence\Translators\ModuleTranslatorTest::test_toDomain_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Persistence\Translators\ModuleTranslatorTest::test_toDomain_should_return_object
Expectation failed for method name is "buildModulePosition" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Translators/ModuleTranslator.php:54:9
 
         $module->setPosition($this->moduleFactory->buildModulePosition($this->model->position()));
 
-        $module->setSearch(
-            $this->moduleFactory->buildModuleSearch($this->model->search())
-        );
+        
 
         $module->setUpdatedAt($this->moduleFactory->buildModuleUpdatedAt($this->model->updatedAt()));
killedBy: Tests\Feature\Core\Profile\Infrastructure\Persistence\Translators\ModuleTranslatorTest::test_toDomain_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Persistence\Translators\ModuleTranslatorTest::test_toDomain_should_return_object
Expectation failed for method name is "buildModuleSearch" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Translators/ModuleTranslator.php:58:9
             $this->moduleFactory->buildModuleSearch($this->model->search())
         );
 
-        $module->setUpdatedAt($this->moduleFactory->buildModuleUpdatedAt($this->model->updatedAt()));
+        
 
         return $module;
killedBy: Tests\Feature\Core\Profile\Infrastructure\Persistence\Translators\ModuleTranslatorTest::test_toDomain_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Persistence\Translators\ModuleTranslatorTest::test_toDomain_should_return_object
Expectation failed for method name is "buildModuleUpdatedAt" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] PublicVisibility
Infrastructure/Persistence/Translators/ModuleTranslator.php:70:5
         return $this;
     }
 
-    public function toDomainCollection(): Modules
+    protected function toDomainCollection(): Modules
     {
         $modules = new Modules;
killedBy: Tests\Feature\Core\Profile\Infrastructure\Persistence\Translators\ModuleTranslatorTest::test_toDomainCollection_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Persistence\Translators\ModuleTranslatorTest::test_toDomainCollection_should_return_object
Error: Call to protected method Core\Profile\Infrastructure\Persistence\Translators\ModuleTranslator::toDomainCollection() from scope Tests\Feature\Core\Profile\Infrastructure\Persistence\Translators\ModuleTranslatorTest

/var/www/abacusSystem-new/tests/Feature/Co

[Killed] Foreach_
Infrastructure/Persistence/Translators/ModuleTranslator.php:73:9
     public function toDomainCollection(): Modules
     {
         $modules = new Modules;
-        foreach ($this->collection as $id) {
-            $modules->addId($id);
-        }
+        foreach ([] as $id) {
 
         return $modules;
killedBy: Tests\Feature\Core\Profile\Infrastructure\Persistence\Translators\ModuleTranslatorTest::test_toDomainCollection_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Persistence\Translators\ModuleTranslatorTest::test_toDomainCollection_should_return_object
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
-Array &0 [
-    0 => 1,
-]

[Killed] MethodCallRemoval
Infrastructure/Persistence/Translators/ModuleTranslator.php:74:13
     {
         $modules = new Modules;
         foreach ($this->collection as $id) {
-            $modules->addId($id);
+            
         }
 
killedBy: Tests\Feature\Core\Profile\Infrastructure\Persistence\Translators\ModuleTranslatorTest::test_toDomainCollection_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Persistence\Translators\ModuleTranslatorTest::test_toDomainCollection_should_return_object
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
-Array &0 [
-    0 => 1,
-]
