[Killed] MethodCallRemoval
Infrastructure/Persistence/Translators/ProfileTranslator.php:52:9
             $this->profileFactory->buildProfileCreatedAt($this->model->createdAt())
         );
 
-        $profile->setDescription(
-            $this->profileFactory->buildProfileDescription($this->model->description())
-        );
+        
 
         $profile->setSearch(
killedBy: Tests\Feature\Core\Profile\Infrastructure\Persistence\Translators\ProfileTranslatorTest::test_toDomain_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Persistence\Translators\ProfileTranslatorTest::test_toDomain_should_return_object
Expectation failed for method name is "buildProfileDescription" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Translators/ProfileTranslator.php:56:9
             $this->profileFactory->buildProfileDescription($this->model->description())
         );
 
-        $profile->setSearch(
-            $this->profileFactory->buildProfileSearch($this->model->search())
-        );
+        
 
         $profile->setUpdatedAt(
killedBy: Tests\Feature\Core\Profile\Infrastructure\Persistence\Translators\ProfileTranslatorTest::test_toDomain_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Persistence\Translators\ProfileTranslatorTest::test_toDomain_should_return_object
Expectation failed for method name is "buildProfileSearch" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Translators/ProfileTranslator.php:60:9
             $this->profileFactory->buildProfileSearch($this->model->search())
         );
 
-        $profile->setUpdatedAt(
-            $this->profileFactory->buildProfileUpdateAt($this->model->updatedAt())
-        );
+        
 
         $modulesModel = $this->model->pivotModules();
killedBy: Tests\Feature\Core\Profile\Infrastructure\Persistence\Translators\ProfileTranslatorTest::test_toDomain_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Persistence\Translators\ProfileTranslatorTest::test_toDomain_should_return_object
Expectation failed for method name is "buildProfileUpdateAt" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.

[Killed] Foreach_
Infrastructure/Persistence/Translators/ProfileTranslator.php:67:9
         $modulesModel = $this->model->pivotModules();
         $modules = [];
         /** @var Module $item */
-        foreach ($modulesModel->get() as $item) {
-            if ($item->state() === ValueObjectStatus::STATE_ACTIVE) {
-                $modules[] = $item->id();
-            }
-        }
+        foreach ([] as $item) {
         $profile->setModulesAggregator($modules);
 
killedBy: Tests\Feature\Core\Profile\Infrastructure\Persistence\Translators\ProfileTranslatorTest::test_toDomain_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Persistence\Translators\ProfileTranslatorTest::test_toDomain_should_return_object
Expectation failed for method name is "setModulesAggregator" when invoked 1 time
Parameter 0 for invocation Core\Profile\Domain\Profile::setModulesAggregator([]): Core\Profile\Domain\Profile does not match expected value.
Failed asserting that two arrays are equal.
--- Exp

[Killed] Identical
Infrastructure/Persistence/Translators/ProfileTranslator.php:68:13
         $modules = [];
         /** @var Module $item */
         foreach ($modulesModel->get() as $item) {
-            if ($item->state() === ValueObjectStatus::STATE_ACTIVE) {
+            if ($item->state() !== ValueObjectStatus::STATE_ACTIVE) {
                 $modules[] = $item->id();
             }
killedBy: Tests\Feature\Core\Profile\Infrastructure\Persistence\Translators\ProfileTranslatorTest::test_toDomain_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Persistence\Translators\ProfileTranslatorTest::test_toDomain_should_return_object
Expectation failed for method name is "setModulesAggregator" when invoked 1 time
Parameter 0 for invocation Core\Profile\Domain\Profile::setModulesAggregator([]): Core\Profile\Domain\Profile does not match expected value.
Failed asserting that two arrays are equal.
--- Exp

[Killed] MethodCallRemoval
Infrastructure/Persistence/Translators/ProfileTranslator.php:72:9
                 $modules[] = $item->id();
             }
         }
-        $profile->setModulesAggregator($modules);
+        
 
         return $profile;
killedBy: Tests\Feature\Core\Profile\Infrastructure\Persistence\Translators\ProfileTranslatorTest::test_toDomain_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Persistence\Translators\ProfileTranslatorTest::test_toDomain_should_return_object
Expectation failed for method name is "setModulesAggregator" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 7, Failures: 1.

[Killed] PublicVisibility
Infrastructure/Persistence/Translators/ProfileTranslator.php:84:5
         return $this;
     }
 
-    public function toDomainCollection(): Profiles
+    protected function toDomainCollection(): Profiles
     {
         $profiles = new Profiles;
killedBy: Tests\Feature\Core\Profile\Infrastructure\Persistence\Translators\ProfileTranslatorTest::test_toDomainCollection_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Persistence\Translators\ProfileTranslatorTest::test_toDomainCollection_should_return_object
Error: Call to protected method Core\Profile\Infrastructure\Persistence\Translators\ProfileTranslator::toDomainCollection() from scope Tests\Feature\Core\Profile\Infrastructure\Persistence\Translators\ProfileTranslatorTest

/var/www/abacusSystem-new/tests/Feature

[Killed] Foreach_
Infrastructure/Persistence/Translators/ProfileTranslator.php:87:9
     public function toDomainCollection(): Profiles
     {
         $profiles = new Profiles;
-        foreach ($this->collection as $id) {
-            $profiles->addId($id);
-        }
+        foreach ([] as $id) {
 
         return $profiles;
killedBy: Tests\Feature\Core\Profile\Infrastructure\Persistence\Translators\ProfileTranslatorTest::test_toDomainCollection_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Persistence\Translators\ProfileTranslatorTest::test_toDomainCollection_should_return_object
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
-Array &0 [
-    0 => 1,
-]

[Killed] MethodCallRemoval
Infrastructure/Persistence/Translators/ProfileTranslator.php:88:13
     {
         $profiles = new Profiles;
         foreach ($this->collection as $id) {
-            $profiles->addId($id);
+            
         }
 
killedBy: Tests\Feature\Core\Profile\Infrastructure\Persistence\Translators\ProfileTranslatorTest::test_toDomainCollection_should_return_object
statusReason: 1) Tests\Feature\Core\Profile\Infrastructure\Persistence\Translators\ProfileTranslatorTest::test_toDomainCollection_should_return_object
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
-Array &0 [
-    0 => 1,
-]
