[NoCoverage] PublicVisibility
SharedContext/Infrastructure/Persistence/AbstractChainRepository.php:20:5
 
     abstract public function functionNamePersist(): string;
 
-    public function addRepository(ChainPriority $repository): self
+    protected function addRepository(ChainPriority $repository): self
     {
         $this->repositories[] = $repository;

[NoCoverage] FunctionCallRemoval
SharedContext/Infrastructure/Persistence/AbstractChainRepository.php:24:9
     {
         $this->repositories[] = $repository;
 
-        usort($this->repositories, $this->prioritySort());
+        
 
         return $this;

[NoCoverage] ProtectedVisibility
SharedContext/Infrastructure/Persistence/AbstractChainRepository.php:29:5
         return $this;
     }
 
-    protected function write(string $functionName, ...$source)
+    private function write(string $functionName, ...$source)
     {
         $result = null;

[NoCoverage] DoWhile
SharedContext/Infrastructure/Persistence/AbstractChainRepository.php:34:9
         $result = null;
         $repository = end($this->repositories);
 
-        do {
-            $callable = [$repository, $functionName];
-            if (is_callable($callable)) {
-                $result = call_user_func_array($callable, $source);
-            }
-        } while (false !== ($repository = prev($this->repositories)));
+        } while (false);ile (false !== ($repository = prev($this->repositories)));
 
         return $result;

[NoCoverage] ArrayItemRemoval
SharedContext/Infrastructure/Persistence/AbstractChainRepository.php:35:13
         $repository = end($this->repositories);
 
         do {
-            $callable = [$repository, $functionName];
+            $callable = [$functionName];
             if (is_callable($callable)) {
                 $result = call_user_func_array($callable, $source);

[NoCoverage] IfNegation
SharedContext/Infrastructure/Persistence/AbstractChainRepository.php:36:13
 
         do {
             $callable = [$repository, $functionName];
-            if (is_callable($callable)) {
-                $result = call_user_func_array($callable, $source);
-            }
+            if (!is_callable($callable)) {
         } while (false !== ($repository = prev($this->repositories)));
 

[NoCoverage] FalseValue
SharedContext/Infrastructure/Persistence/AbstractChainRepository.php:39:9
             if (is_callable($callable)) {
                 $result = call_user_func_array($callable, $source);
             }
-        } while (false !== ($repository = prev($this->repositories)));
+        } while (true !== $repository = prev($this->repositories));
 
         return $result;

[NoCoverage] NotIdentical
SharedContext/Infrastructure/Persistence/AbstractChainRepository.php:39:9
             if (is_callable($callable)) {
                 $result = call_user_func_array($callable, $source);
             }
-        } while (false !== ($repository = prev($this->repositories)));
+        } while (false === $repository = prev($this->repositories));
 
         return $result;

[NoCoverage] ProtectedVisibility
SharedContext/Infrastructure/Persistence/AbstractChainRepository.php:47:5
     /**
      * @throws Throwable
      */
-    protected function read(string $functionName, ...$source)
+    private function read(string $functionName, ...$source)
     {
         $result = $this->readFromRepositories($functionName, ...$source);

[NoCoverage] LogicalNot
SharedContext/Infrastructure/Persistence/AbstractChainRepository.php:51:9
     {
         $result = $this->readFromRepositories($functionName, ...$source);
 
-        if (! $this->functionNameDelete()) {
+        if ($this->functionNameDelete()) {
             $this->persistence($this->functionNamePersist(), $result);
         }

[NoCoverage] MethodCallRemoval
SharedContext/Infrastructure/Persistence/AbstractChainRepository.php:52:13
         $result = $this->readFromRepositories($functionName, ...$source);
 
         if (! $this->functionNameDelete()) {
-            $this->persistence($this->functionNamePersist(), $result);
+            
         }
 

[NoCoverage] ProtectedVisibility
SharedContext/Infrastructure/Persistence/AbstractChainRepository.php:61:5
     /**
      * @throws Throwable
      */
-    protected function readFromRepositories(string $functionName, ...$source)
+    private function readFromRepositories(string $functionName, ...$source)
     {
         $result = null;

[NoCoverage] DoWhile
SharedContext/Infrastructure/Persistence/AbstractChainRepository.php:67:9
         $lastThrowable = new SourceNotFoundException('Source not found');
 
         $repository = reset($this->repositories);
-        do {
-            try {
-                $callable = [$repository, $functionName];
-                if (is_callable($callable)) {
-                    $result = call_user_func_array($callable, $source);
-                }
-            } catch (Throwable $throwable) {
-                $lastThrowable = $throwable;
-            }
-        } while ((null === $result) and (false !== ($repository = next($this->repositories))));
+        } while (false);ile ((null === $result) and (false !== ($repository = next($this->repositories))));
 
         if (is_null($result)) {

[NoCoverage] NotIdentical
SharedContext/Infrastructure/Persistence/AbstractChainRepository.php:76:9
             } catch (Throwable $throwable) {
                 $lastThrowable = $throwable;
             }
-        } while ((null === $result) and (false !== ($repository = next($this->repositories))));
+        } while (null === $result and false === $repository = next($this->repositories));
 
         if (is_null($result)) {

[NoCoverage] LogicalLowerAnd
SharedContext/Infrastructure/Persistence/AbstractChainRepository.php:76:9
             } catch (Throwable $throwable) {
                 $lastThrowable = $throwable;
             }
-        } while ((null === $result) and (false !== ($repository = next($this->repositories))));
+        } while (null === $result or false !== $repository = next($this->repositories));
 
         if (is_null($result)) {

[NoCoverage] IfNegation
SharedContext/Infrastructure/Persistence/AbstractChainRepository.php:78:9
             }
         } while ((null === $result) and (false !== ($repository = next($this->repositories))));
 
-        if (is_null($result)) {
-            throw $lastThrowable;
-        }
+        if (!is_null($result)) {
 
         return $result;

[NoCoverage] Throw_
SharedContext/Infrastructure/Persistence/AbstractChainRepository.php:79:13
         } while ((null === $result) and (false !== ($repository = next($this->repositories))));
 
         if (is_null($result)) {
-            throw $lastThrowable;
+            $lastThrowable;
         }
 

[NoCoverage] ProtectedVisibility
SharedContext/Infrastructure/Persistence/AbstractChainRepository.php:85:5
         return $result;
     }
 
-    protected function persistence(string $functionName, ...$sources): void
+    private function persistence(string $functionName, ...$sources): void
     {
         while (false !== ($repository = prev($this->repositories))) {

[NoCoverage] While_
SharedContext/Infrastructure/Persistence/AbstractChainRepository.php:87:9
 
     protected function persistence(string $functionName, ...$sources): void
     {
-        while (false !== ($repository = prev($this->repositories))) {
-            try {
-                $callable = [$repository, $functionName];
-                if (is_callable($callable)) {
-                    call_user_func_array($callable, $sources);
-                }
-            } catch (Exception $exception) {
-            }
-        }
+        while (false) {
     }
 

[NoCoverage] FalseValue
SharedContext/Infrastructure/Persistence/AbstractChainRepository.php:87:9
 
     protected function persistence(string $functionName, ...$sources): void
     {
-        while (false !== ($repository = prev($this->repositories))) {
+        while (true !== $repository = prev($this->repositories)) {
             try {
                 $callable = [$repository, $functionName];

[NoCoverage] IfNegation
SharedContext/Infrastructure/Persistence/AbstractChainRepository.php:90:17
         while (false !== ($repository = prev($this->repositories))) {
             try {
                 $callable = [$repository, $functionName];
-                if (is_callable($callable)) {
-                    call_user_func_array($callable, $sources);
-                }
+                if (!is_callable($callable)) {
             } catch (Exception $exception) {
             }

[NoCoverage] FunctionCallRemoval
SharedContext/Infrastructure/Persistence/AbstractChainRepository.php:91:21
             try {
                 $callable = [$repository, $functionName];
                 if (is_callable($callable)) {
-                    call_user_func_array($callable, $sources);
+                    
                 }
             } catch (Exception $exception) {

[NoCoverage] Identical
SharedContext/Infrastructure/Persistence/AbstractChainRepository.php:101:13
     private function prioritySort(): Closure
     {
         return static function (ChainPriority $current, ChainPriority $next) {
-            if ($current->priority() === $next->priority()) {
+            if ($current->priority() !== $next->priority()) {
                 return 0;
             }

[NoCoverage] DecrementInteger
SharedContext/Infrastructure/Persistence/AbstractChainRepository.php:102:17
     {
         return static function (ChainPriority $current, ChainPriority $next) {
             if ($current->priority() === $next->priority()) {
-                return 0;
+                return -1;
             }
 

[NoCoverage] IncrementInteger
SharedContext/Infrastructure/Persistence/AbstractChainRepository.php:102:17
     {
         return static function (ChainPriority $current, ChainPriority $next) {
             if ($current->priority() === $next->priority()) {
-                return 0;
+                return 1;
             }
 

[NoCoverage] IncrementInteger
SharedContext/Infrastructure/Persistence/AbstractChainRepository.php:105:13
                 return 0;
             }
 
-            return ($current->priority() < $next->priority()) ? 1 : -1;
+            return ($current->priority() < $next->priority()) ? 2 : -1;
         };
     }

[NoCoverage] IncrementInteger
SharedContext/Infrastructure/Persistence/AbstractChainRepository.php:105:13
                 return 0;
             }
 
-            return ($current->priority() < $next->priority()) ? 1 : -1;
+            return ($current->priority() < $next->priority()) ? 1 : -0;
         };
     }
