[NoCoverage] FunctionCall
core/SharedContext/Model/ArrayIterator.php:39:9
     #[ReturnTypeWillChange]
     public function next()
     {
-        return \next($this->items);
+        \next($this->items);
+        return null;
     }
 

[NoCoverage] FunctionCall
core/SharedContext/Model/ArrayIterator.php:45:9
     #[ReturnTypeWillChange]
     public function key()
     {
-        return \key($this->items);
+        \key($this->items);
+        return null;
     }
 

[NoCoverage] NotIdentical
core/SharedContext/Model/ArrayIterator.php:50:9
 
     public function valid(): bool
     {
-        return \current($this->items) !== false;
+        return \current($this->items) === false;
     }
 

[NoCoverage] FalseValue
core/SharedContext/Model/ArrayIterator.php:50:9
 
     public function valid(): bool
     {
-        return \current($this->items) !== false;
+        return \current($this->items) !== true;
     }
 

[NoCoverage] FunctionCall
core/SharedContext/Model/ArrayIterator.php:56:9
     #[ReturnTypeWillChange]
     public function rewind()
     {
-        return \reset($this->items);
+        \reset($this->items);
+        return null;
     }
 
