[NoCoverage] MethodCallRemoval
core/SharedContext/Model/ValueObjectStatus.php:53:9
      */
     public function __construct(int $value)
     {
-        $this->validateState($value);
+        
         $this->value = $value;
 

[NoCoverage] MethodCallRemoval
core/SharedContext/Model/ValueObjectStatus.php:56:9
         $this->validateState($value);
         $this->value = $value;
 
-        $this->changeValueLiteral($value);
+        
     }
 

[NoCoverage] PublicVisibility
core/SharedContext/Model/ValueObjectStatus.php:78:5
         return $this;
     }
 
-    public function getValueLiteral(): string
+    protected function getValueLiteral(): string
     {
         return $this->valueLiteral;

[NoCoverage] PublicVisibility
core/SharedContext/Model/ValueObjectStatus.php:83:5
         return $this->valueLiteral;
     }
 
-    public function activate(): self
+    protected function activate(): self
     {
         $this->value = self::STATE_ACTIVE;

[NoCoverage] MethodCallRemoval
core/SharedContext/Model/ValueObjectStatus.php:86:9
     public function activate(): self
     {
         $this->value = self::STATE_ACTIVE;
-        $this->changeValueLiteral(self::STATE_INACTIVE);
+        
 
         return $this;

[NoCoverage] PublicVisibility
core/SharedContext/Model/ValueObjectStatus.php:91:5
         return $this;
     }
 
-    public function inactive(): self
+    protected function inactive(): self
     {
         $this->value = self::STATE_INACTIVE;

[NoCoverage] MethodCallRemoval
core/SharedContext/Model/ValueObjectStatus.php:94:9
     public function inactive(): self
     {
         $this->value = self::STATE_INACTIVE;
-        $this->changeValueLiteral(self::STATE_INACTIVE);
+        
 
         return $this;

[NoCoverage] PublicVisibility
core/SharedContext/Model/ValueObjectStatus.php:99:5
         return $this;
     }
 
-    public function isNew(): bool
+    protected function isNew(): bool
     {
         return $this->value() === self::STATE_NEW;

[NoCoverage] Identical
core/SharedContext/Model/ValueObjectStatus.php:101:9
 
     public function isNew(): bool
     {
-        return $this->value() === self::STATE_NEW;
+        return $this->value() !== self::STATE_NEW;
     }
 

[NoCoverage] PublicVisibility
core/SharedContext/Model/ValueObjectStatus.php:104:5
         return $this->value() === self::STATE_NEW;
     }
 
-    public function isActivated(): bool
+    protected function isActivated(): bool
     {
         return $this->value() === self::STATE_ACTIVE;

[NoCoverage] Identical
core/SharedContext/Model/ValueObjectStatus.php:106:9
 
     public function isActivated(): bool
     {
-        return $this->value() === self::STATE_ACTIVE;
+        return $this->value() !== self::STATE_ACTIVE;
     }
 

[NoCoverage] PublicVisibility
core/SharedContext/Model/ValueObjectStatus.php:109:5
         return $this->value() === self::STATE_ACTIVE;
     }
 
-    public function isInactivated(): bool
+    protected function isInactivated(): bool
     {
         return $this->value() === self::STATE_INACTIVE;

[NoCoverage] Identical
core/SharedContext/Model/ValueObjectStatus.php:111:9
 
     public function isInactivated(): bool
     {
-        return $this->value() === self::STATE_INACTIVE;
+        return $this->value() !== self::STATE_INACTIVE;
     }
 

[NoCoverage] PublicVisibility
core/SharedContext/Model/ValueObjectStatus.php:114:5
         return $this->value() === self::STATE_INACTIVE;
     }
 
-    public function formatHtmlToState(): string
+    protected function formatHtmlToState(): string
     {
         $state = $this->value;

[NoCoverage] ProtectedVisibility
core/SharedContext/Model/ValueObjectStatus.php:122:5
         return sprintf('<span class="badge %s">%s</span>', $style['class'], $this->valueLiteral);
     }
 
-    protected function changeValueLiteral(int $state): self
+    private function changeValueLiteral(int $state): self
     {
         if ($state !== self::STATE_DELETE) {

[NoCoverage] NotIdentical
core/SharedContext/Model/ValueObjectStatus.php:124:9
 
     protected function changeValueLiteral(int $state): self
     {
-        if ($state !== self::STATE_DELETE) {
+        if ($state === self::STATE_DELETE) {
             $literal = self::STYLE_LITERAL_STATE[$state]['literal'];
             $this->valueLiteral = $literal;

[NoCoverage] ProtectedVisibility
core/SharedContext/Model/ValueObjectStatus.php:135:5
     /**
      * @throws Exception
      */
-    protected function validateState(int $value): void
+    private function validateState(int $value): void
     {
         if (! in_array($value, self::REGISTRY_STATES)) {

[NoCoverage] LogicalNot
core/SharedContext/Model/ValueObjectStatus.php:137:9
      */
     protected function validateState(int $value): void
     {
-        if (! in_array($value, self::REGISTRY_STATES)) {
+        if (in_array($value, self::REGISTRY_STATES)) {
             throw new Exception(
                 sprintf('<%s> does not allow the invalid state: <%s>.', static::class, $value)

[NoCoverage] Throw_
core/SharedContext/Model/ValueObjectStatus.php:138:13
     protected function validateState(int $value): void
     {
         if (! in_array($value, self::REGISTRY_STATES)) {
-            throw new Exception(
-                sprintf('<%s> does not allow the invalid state: <%s>.', static::class, $value)
-            );
+            new Exception(sprintf('<%s> does not allow the invalid state: <%s>.', static::class, $value));
         }
     }
