[Killed] ArrayItemRemoval
User/Application/DataTransformer/UserDataTransformer.php:25:9
 
     public function read(): array
     {
-        return [
-            User::TYPE => [
-                'id' => $this->user->id()->value(),
-                'employeeId' => $this->user->employeeId()->value(),
-                'profileId' => $this->user->profileId()->value(),
-                'login' => $this->user->login()->value(),
-                'password' => $this->user->password()->value(),
-                'state' => $this->user->state()->value(),
-                'photo' => $this->user->photo()->value(),
-                'createdAt' => $this->user->createdAt()->value(),
-                'updatedAt' => $this->user->updatedAt()->value(),
-            ],
-        ];
+        return [];
     }
 }
statusReason: 1) Tests\Feature\Core\User\Application\DataTransformer\UserDataTransformerTest::test_read_should_return_array with data set #0 ([[1, 1, 1, 'login', '12345', 1, 'test.jpg', DateTime Object (...), DateTime Object (...)]], DateTime Object (...))
Failed asserting that two arrays are identical.
--- Expected
+++ Actual
@@ @@
-Array &0 [
-    'user' => Array &1 [
-        'id' => 1,
