[Killed] MethodCallRemoval
User/Application/Factory/UserFactory.php:40:9
             $this->buildState($data['state']),
             $this->buildCreatedAt($data['createdAt'])
         );
-        $user->photo()->setValue($data['photo']);
+        
 
         return $user;
statusReason: 1) Tests\Feature\Core\User\Application\Factory\UserFactoryTest::test_buildUserFromArray_should_return_user with data set #0 ([[1, 1, 1, 'login', '12345', 2, DateTime Object (...), 'image.jpg']])
Failed asserting that 'image.jpg' is identical to null.

/var/www/abacusSystem-new/tests/Feature/Core/User/Application/Factory/UserFactoryTest.php:79

FAILURES!
Tests: 1, Assertions: 18, Failures: 1.
