[Killed] MethodCallRemoval
Application/UseCases/CreateUser/CreateUser.php:19:9
 {
     public function __construct(UserRepositoryContract $userRepository)
     {
-        parent::__construct($userRepository);
+        
     }
 
killedBy: Tests\Feature\Core\User\Application\UseCases\CreateUser\CreateUserTest::test_execute_should_return_User_object
statusReason: 1) Tests\Feature\Core\User\Application\UseCases\CreateUser\CreateUserTest::test_execute_should_return_User_object
Error: Typed property Core\User\Application\UseCases\UseCasesService::$userRepository must not be accessed before initialization

/var/www/abacusSystem-new/src/core/User/Application/UseCases/CreateUser/CreateUser.php:26
/var/www/abacusSystem-new/tests/Feature/Core/User/Application/UseC

[Killed] MethodCallRemoval
Application/UseCases/CreateUser/CreateUser.php:27:9
      */
     public function execute(RequestService $request): User
     {
-        $this->validateRequest($request, CreateUserRequest::class);
+        
 
         /** @var CreateUserRequest $request */
killedBy: Tests\Feature\Core\User\Application\UseCases\CreateUser\CreateUserTest::test_execute_should_return_exception
statusReason: 1) Tests\Feature\Core\User\Application\UseCases\CreateUser\CreateUserTest::test_execute_should_return_exception
Failed asserting that exception of type "Error" matches expected exception "Exception". Message was: "Call to undefined method MockObject_DeleteUserRequest_5d38a9da::user()" at
/var/www/abacusSystem-new/src/core/User/Application/UseCases/CreateUser/CreateUser.php:26
/var/www/abacusSystem
