[Survived] MethodCallRemoval
Application/UseCases/DeleteUser/DeleteUser.php:26:9
      */
     public function execute(RequestService $request): null
     {
-        $this->validateRequest($request, DeleteUserRequest::class);
+        
 
         /** @var DeleteUserRequest $request */

[Killed] MethodCallRemoval
Application/UseCases/DeleteUser/DeleteUser.php:29:9
         $this->validateRequest($request, DeleteUserRequest::class);
 
         /** @var DeleteUserRequest $request */
-        $this->userRepository->delete($request->userId());
+        
 
         return null;
killedBy: Tests\Feature\Core\User\Application\UseCases\DeleteUser\DeleteUserTest::test_execute_should_return_user_object
statusReason: 1) Tests\Feature\Core\User\Application\UseCases\DeleteUser\DeleteUserTest::test_execute_should_return_user_object
Expectation failed for method name is "delete" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.
