[Killed] PublicVisibility
Application/UseCases/DeleteUser/DeleteUserRequest.php:21:5
         $this->id = $id;
     }
 
-    public function userId(): UserId
+    protected function userId(): UserId
     {
         return $this->id;
killedBy: Tests\Feature\Core\User\Application\UseCases\DeleteUser\DeleteUserRequestTest::test_userId_should_return_value_object
statusReason: 1) Tests\Feature\Core\User\Application\UseCases\DeleteUser\DeleteUserRequestTest::test_userId_should_return_value_object
Error: Call to protected method Core\User\Application\UseCases\DeleteUser\DeleteUserRequest::userId() from scope Tests\Feature\Core\User\Application\UseCases\DeleteUser\DeleteUserRequestTest

/var/www/abacusSystem-new/tests/Feature/Core/User/Application/UseCases/DeleteUser/Delet
