[Killed] MethodCallRemoval
Application/UseCases/SearchUser/SearchUserById.php:27:9
      */
     public function execute(RequestService $request): ?User
     {
-        $this->validateRequest($request, SearchUserByIdRequest::class);
+        
 
         /** @var SearchUserByIdRequest $request */
killedBy: Tests\Feature\Core\User\Application\UseCases\SearchUser\SearchUserByIdTest::test_execute_request_fail_should_return_exception
statusReason: 1) Tests\Feature\Core\User\Application\UseCases\SearchUser\SearchUserByIdTest::test_execute_request_fail_should_return_exception
Failed asserting that exception of type "Error" matches expected exception "Exception". Message was: "Call to undefined method MockObject_SearchUserByLoginRequest_80a99e81::userId()" at
/var/www/abacusSystem-new/src/core/User/Application/UseCases/SearchUser/SearchUserByI
