[Killed] MethodCallRemoval
Application/UseCases/UpdateUser/UpdateUser.php:21:9
     public function __construct(
         UserRepositoryContract $userRepository,
     ) {
-        parent::__construct($userRepository);
+        
     }
 
statusReason: 1) Tests\Feature\Core\User\Application\UseCases\UpdateUser\UpdateUserTest::test_execute_should_return_user_object with data set #0 ([2, 2, 'login-new', 'prueba', 2, DateTime Object (...), DateTime Object (...), 'photo.jpg'])
Error: Typed property Core\User\Application\UseCases\UseCasesService::$userRepository must not be accessed before initialization

/var/www/abacusSystem-new/src/core/User/Appli

[Killed] MethodCallRemoval
Application/UseCases/UpdateUser/UpdateUser.php:29:9
      */
     public function execute(RequestService $request): User
     {
-        $this->validateRequest($request, UpdateUserRequest::class);
+        
 
         /** @var UpdateUserRequest $request */
killedBy: Tests\Feature\Core\User\Application\UseCases\UpdateUser\UpdateUserTest::test_execute_request_fail_should_return_exception
statusReason: 1) Tests\Feature\Core\User\Application\UseCases\UpdateUser\UpdateUserTest::test_execute_request_fail_should_return_exception
Failed asserting that exception of type "Error" matches expected exception "Exception". Message was: "Call to undefined method MockObject_CreateUserRequest_28c6d1a9::userId()" at
/var/www/abacusSystem-new/src/core/User/Application/UseCases/UpdateUser/UpdateUser.php:27
/var/w

[Killed] Foreach_
Application/UseCases/UpdateUser/UpdateUser.php:34:9
         /** @var UpdateUserRequest $request */
         $user = $this->userRepository->find($request->userId());
 
-        foreach ($request->data() as $field => $value) {
-            $methodName = 'change'.\ucfirst($field);
-
-            if (\is_callable([$this, $methodName])) {
-                $user = $this->{$methodName}($user, $value);
-            }
-        }
+        foreach ([] as $field => $value) {
 
         return $this->userRepository->persistUser($user);
statusReason: 1) Tests\Feature\Core\User\Application\UseCases\UpdateUser\UpdateUserTest::test_execute_should_return_user_object with data set #0 ([2, 2, 'login-new', 'prueba', 2, DateTime Object (...), DateTime Object (...), 'photo.jpg'])
Expectation failed for method name is "data" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 4, Failure

[Killed] Concat
Application/UseCases/UpdateUser/UpdateUser.php:35:13
         $user = $this->userRepository->find($request->userId());
 
         foreach ($request->data() as $field => $value) {
-            $methodName = 'change'.\ucfirst($field);
+            $methodName = \ucfirst($field) . 'change';
 
             if (\is_callable([$this, $methodName])) {
statusReason: 1) Tests\Feature\Core\User\Application\UseCases\UpdateUser\UpdateUserTest::test_execute_should_return_user_object with data set #0 ([2, 2, 'login-new', 'prueba', 2, DateTime Object (...), DateTime Object (...), 'photo.jpg'])
Expectation failed for method name is "employeeId" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 5, F

[Killed] IfNegation
Application/UseCases/UpdateUser/UpdateUser.php:37:13
         foreach ($request->data() as $field => $value) {
             $methodName = 'change'.\ucfirst($field);
 
-            if (\is_callable([$this, $methodName])) {
-                $user = $this->{$methodName}($user, $value);
-            }
+            if (!\is_callable([$this, $methodName])) {
         }
 
statusReason: 1) Tests\Feature\Core\User\Application\UseCases\UpdateUser\UpdateUserTest::test_execute_should_return_user_object with data set #0 ([2, 2, 'login-new', 'prueba', 2, DateTime Object (...), DateTime Object (...), 'photo.jpg'])
Expectation failed for method name is "employeeId" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 5, F

[Killed] MethodCallRemoval
Application/UseCases/UpdateUser/UpdateUser.php:47:9
 
     private function changeEmployeeId(User $user, int $value): User
     {
-        $user->employeeId()->setValue($value);
+        
 
         return $user;
statusReason: 1) Tests\Feature\Core\User\Application\UseCases\UpdateUser\UpdateUserTest::test_execute_should_return_user_object with data set #0 ([2, 2, 'login-new', 'prueba', 2, DateTime Object (...), DateTime Object (...), 'photo.jpg'])
Expectation failed for method name is "employeeId" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 5, F

[Killed] MethodCallRemoval
Application/UseCases/UpdateUser/UpdateUser.php:54:9
 
     private function changeProfileId(User $user, int $value): User
     {
-        $user->profileId()->setValue($value);
+        
 
         return $user;
statusReason: 1) Tests\Feature\Core\User\Application\UseCases\UpdateUser\UpdateUserTest::test_execute_should_return_user_object with data set #0 ([2, 2, 'login-new', 'prueba', 2, DateTime Object (...), DateTime Object (...), 'photo.jpg'])
Expectation failed for method name is "profileId" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 5, Fa

[Killed] MethodCallRemoval
Application/UseCases/UpdateUser/UpdateUser.php:61:9
 
     private function changeLogin(User $user, string $value): User
     {
-        $user->login()->setValue($value);
+        
 
         return $user;
statusReason: 1) Tests\Feature\Core\User\Application\UseCases\UpdateUser\UpdateUserTest::test_execute_should_return_user_object with data set #0 ([2, 2, 'login-new', 'prueba', 2, DateTime Object (...), DateTime Object (...), 'photo.jpg'])
Expectation failed for method name is "login" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 5, Failur

[Killed] MethodCallRemoval
Application/UseCases/UpdateUser/UpdateUser.php:68:9
 
     private function changePassword(User $user, string $value): User
     {
-        $user->password()->setValue($value);
+        
 
         return $user;
statusReason: 1) Tests\Feature\Core\User\Application\UseCases\UpdateUser\UpdateUserTest::test_execute_should_return_user_object with data set #0 ([2, 2, 'login-new', 'prueba', 2, DateTime Object (...), DateTime Object (...), 'photo.jpg'])
Expectation failed for method name is "password" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 5, Fai

[Killed] MethodCallRemoval
Application/UseCases/UpdateUser/UpdateUser.php:78:9
      */
     private function changeState(User $user, int $value): User
     {
-        $user->state()->setValue($value);
+        
 
         return $user;
statusReason: 1) Tests\Feature\Core\User\Application\UseCases\UpdateUser\UpdateUserTest::test_execute_should_return_user_object with data set #0 ([2, 2, 'login-new', 'prueba', 2, DateTime Object (...), DateTime Object (...), 'photo.jpg'])
Expectation failed for method name is "state" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 5, Failur

[Killed] MethodCallRemoval
Application/UseCases/UpdateUser/UpdateUser.php:85:9
 
     private function changeCreatedAt(User $user, DateTime $value): User
     {
-        $user->createdAt()->setValue($value);
+        
 
         return $user;
statusReason: 1) Tests\Feature\Core\User\Application\UseCases\UpdateUser\UpdateUserTest::test_execute_should_return_user_object with data set #0 ([2, 2, 'login-new', 'prueba', 2, DateTime Object (...), DateTime Object (...), 'photo.jpg'])
Expectation failed for method name is "createdAt" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 5, Fa

[Killed] MethodCallRemoval
Application/UseCases/UpdateUser/UpdateUser.php:92:9
 
     private function changeUpdatedAt(User $user, DateTime $value): User
     {
-        $user->updatedAt()->setValue($value);
+        
 
         return $user;
statusReason: 1) Tests\Feature\Core\User\Application\UseCases\UpdateUser\UpdateUserTest::test_execute_should_return_user_object with data set #0 ([2, 2, 'login-new', 'prueba', 2, DateTime Object (...), DateTime Object (...), 'photo.jpg'])
Expectation failed for method name is "updatedAt" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 5, Fa

[Killed] MethodCallRemoval
Application/UseCases/UpdateUser/UpdateUser.php:99:9
 
     private function changeImage(User $user, string $image): User
     {
-        $user->photo()->setValue($image);
+        
 
         return $user;
statusReason: 1) Tests\Feature\Core\User\Application\UseCases\UpdateUser\UpdateUserTest::test_execute_should_return_user_object with data set #0 ([2, 2, 'login-new', 'prueba', 2, DateTime Object (...), DateTime Object (...), 'photo.jpg'])
Expectation failed for method name is "photo" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 5, Failur
