[Killed] PublicVisibility
core/User/Domain/User.php:63:5
         $this->photo = new UserPhoto;
     }
 
-    public function id(): UserId
+    protected function id(): UserId
     {
         return $this->id;
killedBy: Tests\Feature\Core\User\Domain\UserTest::test_set_id_should_change_id_and_return_object
statusReason: 1) Tests\Feature\Core\User\Domain\UserTest::test_set_id_should_change_id_and_return_object
Error: Call to protected method Core\User\Domain\User::id() from scope Tests\Feature\Core\User\Domain\UserTest

/var/www/abacusSystem-new/tests/Feature/Core/User/Domain/UserTest.php:106

2) Tests\Feature\Core\User\Domain\UserTest::test_id_should_return_user_id
Error: Call to protected method Core\User\Domain

[Killed] PublicVisibility
core/User/Domain/User.php:68:5
         return $this->id;
     }
 
-    public function setId(UserId $id): self
+    protected function setId(UserId $id): self
     {
         $this->id = $id;
killedBy: Tests\Feature\Core\User\Domain\UserTest::test_set_id_should_change_id_and_return_object
statusReason: 1) Tests\Feature\Core\User\Domain\UserTest::test_set_id_should_change_id_and_return_object
Error: Call to protected method Core\User\Domain\User::setId() from scope Tests\Feature\Core\User\Domain\UserTest

/var/www/abacusSystem-new/tests/Feature/Core/User/Domain/UserTest.php:104

ERRORS!
Tests: 18, Assertions: 34, Errors: 1.

[Killed] PublicVisibility
core/User/Domain/User.php:75:5
         return $this;
     }
 
-    public function employeeId(): UserEmployeeId
+    protected function employeeId(): UserEmployeeId
     {
         return $this->employeeId;
killedBy: Tests\Feature\Core\User\Domain\UserTest::test_set_employee_id_should_change_id_and_return_object
statusReason: 1) Tests\Feature\Core\User\Domain\UserTest::test_set_employee_id_should_change_id_and_return_object
Error: Call to protected method Core\User\Domain\User::employeeId() from scope Tests\Feature\Core\User\Domain\UserTest

/var/www/abacusSystem-new/tests/Feature/Core/User/Domain/UserTest.php:125

2) Tests\Feature\Core\User\Domain\UserTest::test_employee_id_should_return_employee_id
Error: Call to pro

[Killed] PublicVisibility
core/User/Domain/User.php:80:5
         return $this->employeeId;
     }
 
-    public function setEmployeeId(UserEmployeeId $employeeId): self
+    protected function setEmployeeId(UserEmployeeId $employeeId): self
     {
         $this->employeeId = $employeeId;
killedBy: Tests\Feature\Core\User\Domain\UserTest::test_set_employee_id_should_change_id_and_return_object
statusReason: 1) Tests\Feature\Core\User\Domain\UserTest::test_set_employee_id_should_change_id_and_return_object
Error: Call to protected method Core\User\Domain\User::setEmployeeId() from scope Tests\Feature\Core\User\Domain\UserTest

/var/www/abacusSystem-new/tests/Feature/Core/User/Domain/UserTest.php:123

ERRORS!
Tests: 18, Assertions: 34, Errors: 1.

[Killed] PublicVisibility
core/User/Domain/User.php:87:5
         return $this;
     }
 
-    public function profileId(): UserProfileId
+    protected function profileId(): UserProfileId
     {
         return $this->profileId;
killedBy: Tests\Feature\Core\User\Domain\UserTest::test_set_profile_id_should_change_id_and_return_object
statusReason: 1) Tests\Feature\Core\User\Domain\UserTest::test_set_profile_id_should_change_id_and_return_object
Error: Call to protected method Core\User\Domain\User::profileId() from scope Tests\Feature\Core\User\Domain\UserTest

/var/www/abacusSystem-new/tests/Feature/Core/User/Domain/UserTest.php:144

2) Tests\Feature\Core\User\Domain\UserTest::test_profile_id_should_return_profile_id
Error: Call to protect

[Killed] PublicVisibility
core/User/Domain/User.php:92:5
         return $this->profileId;
     }
 
-    public function setProfileId(UserProfileId $profileId): self
+    protected function setProfileId(UserProfileId $profileId): self
     {
         $this->profileId = $profileId;
killedBy: Tests\Feature\Core\User\Domain\UserTest::test_set_profile_id_should_change_id_and_return_object
statusReason: 1) Tests\Feature\Core\User\Domain\UserTest::test_set_profile_id_should_change_id_and_return_object
Error: Call to protected method Core\User\Domain\User::setProfileId() from scope Tests\Feature\Core\User\Domain\UserTest

/var/www/abacusSystem-new/tests/Feature/Core/User/Domain/UserTest.php:142

ERRORS!
Tests: 18, Assertions: 34, Errors: 1.

[Killed] PublicVisibility
core/User/Domain/User.php:99:5
         return $this;
     }
 
-    public function login(): UserLogin
+    protected function login(): UserLogin
     {
         return $this->login;
killedBy: Tests\Feature\Core\User\Domain\UserTest::test_set_login_should_change_id_and_return_object
statusReason: 1) Tests\Feature\Core\User\Domain\UserTest::test_set_login_should_change_id_and_return_object
Error: Call to protected method Core\User\Domain\User::login() from scope Tests\Feature\Core\User\Domain\UserTest

/var/www/abacusSystem-new/tests/Feature/Core/User/Domain/UserTest.php:163

2) Tests\Feature\Core\User\Domain\UserTest::test_login_should_return_login
Error: Call to protected method Core\User

[Killed] PublicVisibility
core/User/Domain/User.php:104:5
         return $this->login;
     }
 
-    public function setLogin(UserLogin $login): self
+    protected function setLogin(UserLogin $login): self
     {
         $this->login = $login;
killedBy: Tests\Feature\Core\User\Domain\UserTest::test_set_login_should_change_id_and_return_object
statusReason: 1) Tests\Feature\Core\User\Domain\UserTest::test_set_login_should_change_id_and_return_object
Error: Call to protected method Core\User\Domain\User::setLogin() from scope Tests\Feature\Core\User\Domain\UserTest

/var/www/abacusSystem-new/tests/Feature/Core/User/Domain/UserTest.php:161

ERRORS!
Tests: 18, Assertions: 34, Errors: 1.

[Killed] PublicVisibility
core/User/Domain/User.php:111:5
         return $this;
     }
 
-    public function password(): UserPassword
+    protected function password(): UserPassword
     {
         return $this->password;
killedBy: Tests\Feature\Core\User\Domain\UserTest::test_set_password_should_change_id_and_return_object
statusReason: 1) Tests\Feature\Core\User\Domain\UserTest::test_set_password_should_change_id_and_return_object
Error: Call to protected method Core\User\Domain\User::password() from scope Tests\Feature\Core\User\Domain\UserTest

/var/www/abacusSystem-new/tests/Feature/Core/User/Domain/UserTest.php:182

2) Tests\Feature\Core\User\Domain\UserTest::test_password_should_return_password
Error: Call to protected meth

[Killed] PublicVisibility
core/User/Domain/User.php:116:5
         return $this->password;
     }
 
-    public function setPassword(UserPassword $password): self
+    protected function setPassword(UserPassword $password): self
     {
         $this->password = $password;
killedBy: Tests\Feature\Core\User\Domain\UserTest::test_set_password_should_change_id_and_return_object
statusReason: 1) Tests\Feature\Core\User\Domain\UserTest::test_set_password_should_change_id_and_return_object
Error: Call to protected method Core\User\Domain\User::setPassword() from scope Tests\Feature\Core\User\Domain\UserTest

/var/www/abacusSystem-new/tests/Feature/Core/User/Domain/UserTest.php:180

ERRORS!
Tests: 18, Assertions: 34, Errors: 1.

[Killed] PublicVisibility
core/User/Domain/User.php:123:5
         return $this;
     }
 
-    public function state(): UserState
+    protected function state(): UserState
     {
         return $this->state;
killedBy: Tests\Feature\Core\User\Domain\UserTest::test_set_state_should_change_id_and_return_object
statusReason: 1) Tests\Feature\Core\User\Domain\UserTest::test_set_state_should_change_id_and_return_object
Error: Call to protected method Core\User\Domain\User::state() from scope Tests\Feature\Core\User\Domain\UserTest

/var/www/abacusSystem-new/tests/Feature/Core/User/Domain/UserTest.php:201

2) Tests\Feature\Core\User\Domain\UserTest::test_state_should_return_state
Error: Call to protected method Core\User

[Killed] PublicVisibility
core/User/Domain/User.php:128:5
         return $this->state;
     }
 
-    public function setState(UserState $state): self
+    protected function setState(UserState $state): self
     {
         $this->state = $state;
killedBy: Tests\Feature\Core\User\Domain\UserTest::test_set_state_should_change_id_and_return_object
statusReason: 1) Tests\Feature\Core\User\Domain\UserTest::test_set_state_should_change_id_and_return_object
Error: Call to protected method Core\User\Domain\User::setState() from scope Tests\Feature\Core\User\Domain\UserTest

/var/www/abacusSystem-new/tests/Feature/Core/User/Domain/UserTest.php:199

ERRORS!
Tests: 18, Assertions: 34, Errors: 1.

[Killed] PublicVisibility
core/User/Domain/User.php:135:5
         return $this;
     }
 
-    public function createdAt(): UserCreatedAt
+    protected function createdAt(): UserCreatedAt
     {
         return $this->createdAt;
killedBy: Tests\Feature\Core\User\Domain\UserTest::test_set_created_at_should_change_id_and_return_object
statusReason: 1) Tests\Feature\Core\User\Domain\UserTest::test_set_created_at_should_change_id_and_return_object
Error: Call to protected method Core\User\Domain\User::createdAt() from scope Tests\Feature\Core\User\Domain\UserTest

/var/www/abacusSystem-new/tests/Feature/Core/User/Domain/UserTest.php:220

2) Tests\Feature\Core\User\Domain\UserTest::test_created_at_should_return_created_at
Error: Call to protect

[Killed] PublicVisibility
core/User/Domain/User.php:140:5
         return $this->createdAt;
     }
 
-    public function setCreatedAt(UserCreatedAt $createdAt): self
+    protected function setCreatedAt(UserCreatedAt $createdAt): self
     {
         $this->createdAt = $createdAt;
killedBy: Tests\Feature\Core\User\Domain\UserTest::test_set_created_at_should_change_id_and_return_object
statusReason: 1) Tests\Feature\Core\User\Domain\UserTest::test_set_created_at_should_change_id_and_return_object
Error: Call to protected method Core\User\Domain\User::setCreatedAt() from scope Tests\Feature\Core\User\Domain\UserTest

/var/www/abacusSystem-new/tests/Feature/Core/User/Domain/UserTest.php:218

ERRORS!
Tests: 18, Assertions: 34, Errors: 1.

[Killed] PublicVisibility
core/User/Domain/User.php:147:5
         return $this;
     }
 
-    public function updatedAt(): UserUpdatedAt
+    protected function updatedAt(): UserUpdatedAt
     {
         return $this->updatedAt;
killedBy: Tests\Feature\Core\User\Domain\UserTest::test_set_updated_at_should_change_id_and_return_object
statusReason: 1) Tests\Feature\Core\User\Domain\UserTest::test_set_updated_at_should_change_id_and_return_object
Error: Call to protected method Core\User\Domain\User::updatedAt() from scope Tests\Feature\Core\User\Domain\UserTest

/var/www/abacusSystem-new/tests/Feature/Core/User/Domain/UserTest.php:240

2) Tests\Feature\Core\User\Domain\UserTest::test_updated_at_should_return_updated_at
Error: Call to protect

[Killed] PublicVisibility
core/User/Domain/User.php:152:5
         return $this->updatedAt;
     }
 
-    public function setUpdatedAt(UserUpdatedAt $updatedAt): self
+    protected function setUpdatedAt(UserUpdatedAt $updatedAt): self
     {
         $this->updatedAt = $updatedAt;
killedBy: Tests\Feature\Core\User\Domain\UserTest::test_set_updated_at_should_change_id_and_return_object
statusReason: 1) Tests\Feature\Core\User\Domain\UserTest::test_set_updated_at_should_change_id_and_return_object
Error: Call to protected method Core\User\Domain\User::setUpdatedAt() from scope Tests\Feature\Core\User\Domain\UserTest

/var/www/abacusSystem-new/tests/Feature/Core/User/Domain/UserTest.php:238

2) Tests\Feature\Core\User\Domain\UserTest::test_updated_at_should_return_updated_at
Error: Call to prot

[Killed] PublicVisibility
core/User/Domain/User.php:159:5
         return $this;
     }
 
-    public function photo(): UserPhoto
+    protected function photo(): UserPhoto
     {
         return $this->photo;
killedBy: Tests\Feature\Core\User\Domain\UserTest::test_set_photo_should_change_id_and_return_object
statusReason: 1) Tests\Feature\Core\User\Domain\UserTest::test_set_photo_should_change_id_and_return_object
Error: Call to protected method Core\User\Domain\User::photo() from scope Tests\Feature\Core\User\Domain\UserTest

/var/www/abacusSystem-new/tests/Feature/Core/User/Domain/UserTest.php:260

2) Tests\Feature\Core\User\Domain\UserTest::test_photo_should_return_photo
Error: Call to protected method Core\User

[Killed] PublicVisibility
core/User/Domain/User.php:164:5
         return $this->photo;
     }
 
-    public function setPhoto(UserPhoto $photo): self
+    protected function setPhoto(UserPhoto $photo): self
     {
         $this->photo = $photo;
killedBy: Tests\Feature\Core\User\Domain\UserTest::test_set_photo_should_change_id_and_return_object
statusReason: 1) Tests\Feature\Core\User\Domain\UserTest::test_set_photo_should_change_id_and_return_object
Error: Call to protected method Core\User\Domain\User::setPhoto() from scope Tests\Feature\Core\User\Domain\UserTest

/var/www/abacusSystem-new/tests/Feature/Core/User/Domain/UserTest.php:258

2) Tests\Feature\Core\User\Domain\UserTest::test_photo_should_return_photo
Error: Call to protected method Core\U
