[Survived] ArrayItemRemoval
User/Domain/ValueObjects/UserEmployeeId.php:44:9
 
     private function validate(int $id): void
     {
-        $options = [
-            'options' => [
-                'min_range' => 1,
-            ],
-        ];
+        $options = [];
 
         if (! filter_var($id, FILTER_VALIDATE_INT, $options)) {

[Killed] LogicalNot
User/Domain/ValueObjects/UserEmployeeId.php:50:9
             ],
         ];
 
-        if (! filter_var($id, FILTER_VALIDATE_INT, $options)) {
+        if (filter_var($id, FILTER_VALIDATE_INT, $options)) {
             throw new InvalidArgumentException(
                 sprintf('<%s> does not allow the value <%s>.', static::class, $id)
killedBy: Tests\Feature\Core\User\Domain\ValueObjects\UserEmployeeIdTest::test_value_should_return_int
statusReason: 1) Tests\Feature\Core\User\Domain\ValueObjects\UserEmployeeIdTest::test_value_should_return_int
InvalidArgumentException: <Core\User\Domain\ValueObjects\UserEmployeeId> does not allow the value <1>.

/var/www/abacusSystem-new/src/core/User/Domain/ValueObjects/UserEmployeeId.php:38
/var/www/abacusSystem-new/src/core/User/Domain/ValueObjects/UserEmployeeId.php:16
/var/www/abacusSystem-new/tests/Feat

[Killed] Throw_
User/Domain/ValueObjects/UserEmployeeId.php:51:13
         ];
 
         if (! filter_var($id, FILTER_VALIDATE_INT, $options)) {
-            throw new InvalidArgumentException(
-                sprintf('<%s> does not allow the value <%s>.', static::class, $id)
-            );
+            new InvalidArgumentException(sprintf('<%s> does not allow the value <%s>.', static::class, $id));
         }
     }
killedBy: Tests\Feature\Core\User\Domain\ValueObjects\UserEmployeeIdTest::test_setValue_should_return_exception
statusReason: PHPUnit 10.5.20 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.2.20
Configuration: /tmp/infection/phpunitConfiguration.4cba618f9472a293f86e4402a0237f90.infection.xml

R...                                                                4 / 4 (100%)

Time: 00:00.070, Memory: 26.00 MB
