[Killed] Throw_
User/Domain/ValueObjects/UserId.php:49:13
         ];
 
         if (! filter_var($value, FILTER_VALIDATE_INT, $options)) {
-            throw new \InvalidArgumentException(
-                sprintf('<%s> does not allow the value <%s>.', static::class, $value)
-            );
+            new \InvalidArgumentException(sprintf('<%s> does not allow the value <%s>.', static::class, $value));
         }
     }
killedBy: Tests\Feature\Core\User\Domain\ValueObjects\UserIdTest::test_setValue_should_return_exception
statusReason: PHPUnit 10.5.20 by Sebastian Bergmann and contributors.

Runtime:       PHP 8.2.20
Configuration: /tmp/infection/phpunitConfiguration.9a479087faba3841837890bb9ee87ac2.infection.xml

R...                                                                4 / 4 (100%)

Time: 00:00.069, Memory: 26.00 MB
