[Killed] Foreach_
User/Infrastructure/Commands/UserWarmup.php:68:13
         try {
             $user = $this->readRepository->find($userId);
 
-            foreach ($this->repositories as $repository) {
-                $repository->persistUser($user);
-            }
+            foreach ([] as $repository) {
         } catch (Exception $exception) {
             $this->logger->error($exception->getMessage(), $exception->getTrace());
killedBy: Tests\Feature\Core\User\Infrastructure\Commands\UserWarmupTest::test_handle_should_persist_user_in_write_repository
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Commands\UserWarmupTest::test_handle_should_persist_user_in_write_repository
Expectation failed for method name is "persistUser" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 6, Failures: 1.

[Killed] MethodCallRemoval
User/Infrastructure/Commands/UserWarmup.php:69:17
             $user = $this->readRepository->find($userId);
 
             foreach ($this->repositories as $repository) {
-                $repository->persistUser($user);
+                
             }
         } catch (Exception $exception) {
killedBy: Tests\Feature\Core\User\Infrastructure\Commands\UserWarmupTest::test_handle_should_persist_user_in_write_repository
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Commands\UserWarmupTest::test_handle_should_persist_user_in_write_repository
Expectation failed for method name is "persistUser" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 6, Failures: 1.

[Killed] MethodCallRemoval
User/Infrastructure/Commands/UserWarmup.php:77:9
             return CommandSymfony::FAILURE;
         }
 
-        $this->logger->info('User command executed');
+        
 
         return CommandSymfony::SUCCESS;
killedBy: Tests\Feature\Core\User\Infrastructure\Commands\UserWarmupTest::test_handle_should_persist_user_in_write_repository
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Commands\UserWarmupTest::test_handle_should_persist_user_in_write_repository
Expectation failed for method name is "info" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.
