[Killed] MethodCallRemoval
User/Infrastructure/Management/UserService.php:104:9
             $this->userFactory->buildId($id)
         );
 
-        $this->deleteUser->execute($request);
+        
     }
 }
killedBy: Tests\Feature\Core\User\Infrastructure\Management\UserServiceTest::test_delete_user_should_void
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Management\UserServiceTest::test_delete_user_should_void
Expectation failed for method name is "execute" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.
