[Killed] PublicVisibility
Persistence/Eloquent/Model/User.php:108:5
         return $this->mainSearchField;
     }
 
-    public function relationWithEmployee(): BelongsTo
+    protected function relationWithEmployee(): BelongsTo
     {
         return $this->belongsTo(Employee::class, 'user__emp_id', 'emp_id');
killedBy: Tests\Feature\Core\User\Infrastructure\Persistence\Eloquent\Model\UserTest::test_relationWithEmployee_should_return_belongsTo
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Eloquent\Model\UserTest::test_relationWithEmployee_should_return_belongsTo
BadMethodCallException: Call to undefined method MockObject_User_bf85639a::relationWithEmployee()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Supp

[Killed] PublicVisibility
Persistence/Eloquent/Model/User.php:113:5
         return $this->belongsTo(Employee::class, 'user__emp_id', 'emp_id');
     }
 
-    public function employee(): Model
+    protected function employee(): Model
     {
         return $this->relationWithEmployee()->getModel();
killedBy: Tests\Feature\Core\User\Infrastructure\Persistence\Eloquent\Model\UserTest::test_employee_should_return_employee_model
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Eloquent\Model\UserTest::test_employee_should_return_employee_model
BadMethodCallException: Call to undefined method Core\User\Infrastructure\Persistence\Eloquent\Model\User::employee()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/vendor/laravel/framework/src/Il

[Killed] PublicVisibility
Persistence/Eloquent/Model/User.php:118:5
         return $this->relationWithEmployee()->getModel();
     }
 
-    public function relationWithProfile(): BelongsTo
+    protected function relationWithProfile(): BelongsTo
     {
         return $this->belongsTo(Profile::class, 'user__pro_id', 'pro_id');
killedBy: Tests\Feature\Core\User\Infrastructure\Persistence\Eloquent\Model\UserTest::test_relationWithProfile_should_return_belongsTo
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Eloquent\Model\UserTest::test_relationWithProfile_should_return_belongsTo
BadMethodCallException: Call to undefined method MockObject_User_7dcc6f4e::relationWithProfile()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Suppor

[Killed] PublicVisibility
Persistence/Eloquent/Model/User.php:123:5
         return $this->belongsTo(Profile::class, 'user__pro_id', 'pro_id');
     }
 
-    public function profile(): Model
+    protected function profile(): Model
     {
         return $this->relationWithProfile()->getModel();
killedBy: Tests\Feature\Core\User\Infrastructure\Persistence\Eloquent\Model\UserTest::test_profile_should_return_profile_model
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Eloquent\Model\UserTest::test_profile_should_return_profile_model
BadMethodCallException: Call to undefined method Core\User\Infrastructure\Persistence\Eloquent\Model\User::profile()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/vendor/laravel/framework/src/Illum

[Killed] MethodCallRemoval
Persistence/Eloquent/Model/User.php:135:9
 
     public function changeId(?int $id): self
     {
-        $this->setAttribute('user_id', $id);
+        
 
         return $this;
killedBy: Tests\Feature\Core\User\Infrastructure\Persistence\Eloquent\Model\UserTest::test_changeId_should_return_self
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Eloquent\Model\UserTest::test_changeId_should_return_self
Expectation failed for method name is "setAttribute" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] PublicVisibility
Persistence/Eloquent/Model/User.php:140:5
         return $this;
     }
 
-    public function employeeId(): ?int
+    protected function employeeId(): ?int
     {
         return $this->getAttribute('user__emp_id');
killedBy: Tests\Feature\Core\User\Infrastructure\Persistence\Eloquent\Model\UserTest::test_employeeId_should_return_null
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Eloquent\Model\UserTest::test_employeeId_should_return_null
BadMethodCallException: Call to undefined method MockObject_User_9f85d638::employeeId()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.

[Killed] PublicVisibility
Persistence/Eloquent/Model/User.php:145:5
         return $this->getAttribute('user__emp_id');
     }
 
-    public function changeEmployeeId(int $id): self
+    protected function changeEmployeeId(int $id): self
     {
         $this->setAttribute('user__emp_id', $id);
killedBy: Tests\Feature\Core\User\Infrastructure\Persistence\Eloquent\Model\UserTest::test_changeEmployeeId_should_return_self
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Eloquent\Model\UserTest::test_changeEmployeeId_should_return_self
BadMethodCallException: Call to undefined method MockObject_User_57314c51::changeEmployeeId()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/Fo

[Killed] MethodCallRemoval
Persistence/Eloquent/Model/User.php:147:9
 
     public function changeEmployeeId(int $id): self
     {
-        $this->setAttribute('user__emp_id', $id);
+        
 
         return $this;
killedBy: Tests\Feature\Core\User\Infrastructure\Persistence\Eloquent\Model\UserTest::test_changeEmployeeId_should_return_self
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Eloquent\Model\UserTest::test_changeEmployeeId_should_return_self
Expectation failed for method name is "setAttribute" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] PublicVisibility
Persistence/Eloquent/Model/User.php:152:5
         return $this;
     }
 
-    public function profileId(): ?int
+    protected function profileId(): ?int
     {
         return $this->getAttribute('user__pro_id');
killedBy: Tests\Feature\Core\User\Infrastructure\Persistence\Eloquent\Model\UserTest::test_profileId_should_return_null
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Eloquent\Model\UserTest::test_profileId_should_return_null
BadMethodCallException: Call to undefined method MockObject_User_8e95fc95::profileId()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.ph

[Killed] PublicVisibility
Persistence/Eloquent/Model/User.php:157:5
         return $this->getAttribute('user__pro_id');
     }
 
-    public function changeProfileId(int $id): self
+    protected function changeProfileId(int $id): self
     {
         $this->setAttribute('user__pro_id', $id);
killedBy: Tests\Feature\Core\User\Infrastructure\Persistence\Eloquent\Model\UserTest::test_changeProfileId_should_return_self
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Eloquent\Model\UserTest::test_changeProfileId_should_return_self
BadMethodCallException: Call to undefined method MockObject_User_241ad6eb::changeProfileId()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/Forw

[Killed] MethodCallRemoval
Persistence/Eloquent/Model/User.php:159:9
 
     public function changeProfileId(int $id): self
     {
-        $this->setAttribute('user__pro_id', $id);
+        
 
         return $this;
killedBy: Tests\Feature\Core\User\Infrastructure\Persistence\Eloquent\Model\UserTest::test_changeProfileId_should_return_self
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Eloquent\Model\UserTest::test_changeProfileId_should_return_self
Expectation failed for method name is "setAttribute" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] PublicVisibility
Persistence/Eloquent/Model/User.php:164:5
         return $this;
     }
 
-    public function login(): ?string
+    protected function login(): ?string
     {
         return $this->getAttribute('user_login');
killedBy: Tests\Feature\Core\User\Infrastructure\Persistence\Eloquent\Model\UserTest::test_login_should_return_null
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Eloquent\Model\UserTest::test_login_should_return_null
BadMethodCallException: Call to undefined method MockObject_User_a89d0ed1::login()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:36
/va

[Killed] PublicVisibility
Persistence/Eloquent/Model/User.php:169:5
         return $this->getAttribute('user_login');
     }
 
-    public function changeLogin(string $login): self
+    protected function changeLogin(string $login): self
     {
         $this->setAttribute('user_login', $login);
killedBy: Tests\Feature\Core\User\Infrastructure\Persistence\Eloquent\Model\UserTest::test_changeLogin_should_return_self
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Eloquent\Model\UserTest::test_changeLogin_should_return_self
BadMethodCallException: Call to undefined method MockObject_User_13d3d35b::changeLogin()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCall

[Killed] MethodCallRemoval
Persistence/Eloquent/Model/User.php:171:9
 
     public function changeLogin(string $login): self
     {
-        $this->setAttribute('user_login', $login);
+        
 
         return $this;
killedBy: Tests\Feature\Core\User\Infrastructure\Persistence\Eloquent\Model\UserTest::test_changeLogin_should_return_self
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Eloquent\Model\UserTest::test_changeLogin_should_return_self
Expectation failed for method name is "setAttribute" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] PublicVisibility
Persistence/Eloquent/Model/User.php:176:5
         return $this;
     }
 
-    public function password(): ?string
+    protected function password(): ?string
     {
         return $this->getAttribute('password');
killedBy: Tests\Feature\Core\User\Infrastructure\Persistence\Eloquent\Model\UserTest::test_password_should_return_null
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Eloquent\Model\UserTest::test_password_should_return_null
BadMethodCallException: Call to undefined method MockObject_User_2b97e54d::password()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:

[Killed] PublicVisibility
Persistence/Eloquent/Model/User.php:181:5
         return $this->getAttribute('password');
     }
 
-    public function changePassword(string $password): self
+    protected function changePassword(string $password): self
     {
         $this->setAttribute('password', $password);
killedBy: Tests\Feature\Core\User\Infrastructure\Persistence\Eloquent\Model\UserTest::test_changePassword_should_return_self
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Eloquent\Model\UserTest::test_changePassword_should_return_self
BadMethodCallException: Call to undefined method MockObject_User_8d9b6a8a::changePassword()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/Forwar

[Killed] MethodCallRemoval
Persistence/Eloquent/Model/User.php:183:9
 
     public function changePassword(string $password): self
     {
-        $this->setAttribute('password', $password);
+        
 
         return $this;
killedBy: Tests\Feature\Core\User\Infrastructure\Persistence\Eloquent\Model\UserTest::test_changePassword_should_return_self
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Eloquent\Model\UserTest::test_changePassword_should_return_self
Expectation failed for method name is "setAttribute" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
Persistence/Eloquent/Model/User.php:195:9
 
     public function changeState(int $state): self
     {
-        $this->setAttribute('user_state', $state);
+        
 
         return $this;
killedBy: Tests\Feature\Core\User\Infrastructure\Persistence\Eloquent\Model\UserTest::test_changeState_should_return_self
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Eloquent\Model\UserTest::test_changeState_should_return_self
Expectation failed for method name is "setAttribute" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] Ternary
Persistence/Eloquent/Model/User.php:207:9
     {
         $dateTime = $this->getAttribute('created_at');
 
-        return ($dateTime) ? $this->getDateTime($dateTime) : $dateTime;
+        return $dateTime ? $dateTime : $this->getDateTime($dateTime);
 
     }
killedBy: Tests\Feature\Core\User\Infrastructure\Persistence\Eloquent\Model\UserTest::test_createdAt_should_return_datetime
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Eloquent\Model\UserTest::test_createdAt_should_return_null
Failed asserting that DateTime Object #1554 (
    'date' => '2024-06-12 11:26:03.576911',
    'timezone_type' => 3,
    'timezone' => 'UTC',
) is null.

/var/www/abacusSystem-new/tests/Feature/Core/User/Infrastructure/Persistence/Eloquent/Model/UserTest.php:474

[Killed] PublicVisibility
Persistence/Eloquent/Model/User.php:211:5
 
     }
 
-    public function changeCreatedAt(DateTime $datetime): self
+    protected function changeCreatedAt(DateTime $datetime): self
     {
         $this->setAttribute('created_at', $datetime);
killedBy: Tests\Feature\Core\User\Infrastructure\Persistence\Eloquent\Model\UserTest::test_changeCreatedAt_should_return_self
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Eloquent\Model\UserTest::test_changeCreatedAt_should_return_self
BadMethodCallException: Call to undefined method MockObject_User_cd076a5f::changeCreatedAt()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/Forw

[Killed] PublicVisibility
Persistence/Eloquent/Model/User.php:252:5
         return $this;
     }
 
-    public function photo(): ?string
+    protected function photo(): ?string
     {
         return $this->getAttribute('user_photo');
killedBy: Tests\Feature\Core\User\Infrastructure\Persistence\Eloquent\Model\UserTest::test_photo_should_return_null
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Eloquent\Model\UserTest::test_photo_should_return_null
BadMethodCallException: Call to undefined method MockObject_User_a659bd56::photo()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:36
/va

[Killed] PublicVisibility
Persistence/Eloquent/Model/User.php:257:5
         return $this->getAttribute('user_photo');
     }
 
-    public function changePhoto(?string $photo): self
+    protected function changePhoto(?string $photo): self
     {
         $this->setAttribute('user_photo', $photo);
killedBy: Tests\Feature\Core\User\Infrastructure\Persistence\Eloquent\Model\UserTest::test_changePhoto_should_return_self
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Eloquent\Model\UserTest::test_changePhoto_should_return_self
BadMethodCallException: Call to undefined method MockObject_User_e8300a13::changePhoto()

/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCalls.php:67
/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Support/Traits/ForwardsCall

[Killed] MethodCallRemoval
Persistence/Eloquent/Model/User.php:259:9
 
     public function changePhoto(?string $photo): self
     {
-        $this->setAttribute('user_photo', $photo);
+        
 
         return $this;
killedBy: Tests\Feature\Core\User\Infrastructure\Persistence\Eloquent\Model\UserTest::test_changePhoto_should_return_self
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Eloquent\Model\UserTest::test_changePhoto_should_return_self
Expectation failed for method name is "setAttribute" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.
