[NoCoverage] ConcatOperandRemoval
Infrastructure/Persistence/Repositories/ChainUserRepository.php:44:13
         try {
             return $this->read(__FUNCTION__, $id);
         } catch (Exception $exception) {
-            throw new UserNotFoundException('User not found by id '.$id->value());
+            throw new UserNotFoundException($id->value());
         }
     }

[NoCoverage] Throw_
Infrastructure/Persistence/Repositories/ChainUserRepository.php:44:13
         try {
             return $this->read(__FUNCTION__, $id);
         } catch (Exception $exception) {
-            throw new UserNotFoundException('User not found by id '.$id->value());
+            new UserNotFoundException('User not found by id ' . $id->value());
         }
     }

[NoCoverage] Concat
Infrastructure/Persistence/Repositories/ChainUserRepository.php:58:13
         try {
             return $this->read(__FUNCTION__, $login);
         } catch (Exception $exception) {
-            throw new UserNotFoundException('User not found by login '.$login->value());
+            throw new UserNotFoundException($login->value() . 'User not found by login ');
         }
     }

[NoCoverage] Throw_
Infrastructure/Persistence/Repositories/ChainUserRepository.php:58:13
         try {
             return $this->read(__FUNCTION__, $login);
         } catch (Exception $exception) {
-            throw new UserNotFoundException('User not found by login '.$login->value());
+            new UserNotFoundException('User not found by login ' . $login->value());
         }
     }
