[Killed] IfNegation
Infrastructure/Persistence/Repositories/EloquentUserRepository.php:55:9
             ->where('user_state', '>', ValueObjectStatus::STATE_DELETE);
         $data = $builder->first();
 
-        if (is_null($data)) {
-            throw new UserNotFoundException('User not found with id: '.$id->value());
-        }
+        if (!is_null($data)) {
 
         $userModel = $this->updateAttributesModelUser((array) $data);
killedBy: Tests\Feature\Core\User\Infrastructure\Persistence\Repositories\EloquentUserRepositoryTest::test_find_should_return_user_object
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Repositories\EloquentUserRepositoryTest::test_find_should_return_user_object
Core\User\Domain\ValueObjects\UserId::value(): int was not expected to be called more than once.

/var/www/abacusSystem-new/src/core/User/Infrastructure/Persistence/Repositories/EloquentUserRepository.php:41
/var/www/abacusSystem-new/tests/Feature/Core/User/Infrastruct

[Killed] ConcatOperandRemoval
Infrastructure/Persistence/Repositories/EloquentUserRepository.php:56:13
         $data = $builder->first();
 
         if (is_null($data)) {
-            throw new UserNotFoundException('User not found with id: '.$id->value());
+            throw new UserNotFoundException('User not found with id: ');
         }
 
killedBy: Tests\Feature\Core\User\Infrastructure\Persistence\Repositories\EloquentUserRepositoryTest::test_find_should_return_exception
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Repositories\EloquentUserRepositoryTest::test_find_should_return_exception
Failed asserting that exception message 'User not found with id: ' contains 'User not found with id: 1'.

FAILURES!
Tests: 1, Assertions: 6, Failures: 1.

[Killed] ConcatOperandRemoval
Infrastructure/Persistence/Repositories/EloquentUserRepository.php:56:13
         $data = $builder->first();
 
         if (is_null($data)) {
-            throw new UserNotFoundException('User not found with id: '.$id->value());
+            throw new UserNotFoundException($id->value());
         }
 
killedBy: Tests\Feature\Core\User\Infrastructure\Persistence\Repositories\EloquentUserRepositoryTest::test_find_should_return_exception
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Repositories\EloquentUserRepositoryTest::test_find_should_return_exception
Failed asserting that exception message '1' contains 'User not found with id: 1'.

FAILURES!
Tests: 1, Assertions: 6, Failures: 1.

[Killed] IfNegation
Infrastructure/Persistence/Repositories/EloquentUserRepository.php:74:9
             ->where('user_state', '>', ValueObjectStatus::STATE_DELETE);
         $data = $builder->first();
 
-        if (is_null($data)) {
-            throw new UserNotFoundException('User not found with login: '.$login->value());
-        }
+        if (!is_null($data)) {
 
         $userModel = $this->updateAttributesModelUser((array) $data);
killedBy: Tests\Feature\Core\User\Infrastructure\Persistence\Repositories\EloquentUserRepositoryTest::test_findCriteria_should_return_user_object
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Repositories\EloquentUserRepositoryTest::test_findCriteria_should_return_user_object
Core\User\Domain\ValueObjects\UserLogin::value(): string was not expected to be called more than once.

/var/www/abacusSystem-new/src/core/User/Infrastructure/Persistence/Repositories/EloquentUserRepository.php:54
/var/www/abacusSystem-new/tests/Feature/Core/Us

[Killed] Throw_
Infrastructure/Persistence/Repositories/EloquentUserRepository.php:75:13
         $data = $builder->first();
 
         if (is_null($data)) {
-            throw new UserNotFoundException('User not found with login: '.$login->value());
+            new UserNotFoundException('User not found with login: ' . $login->value());
         }
 
killedBy: Tests\Feature\Core\User\Infrastructure\Persistence\Repositories\EloquentUserRepositoryTest::test_findCriteria_should_return_exception
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Repositories\EloquentUserRepositoryTest::test_findCriteria_should_return_exception
Failed asserting that exception of type "Core\User\Exceptions\UserNotFoundException" is thrown.

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.

[Killed] ConcatOperandRemoval
Infrastructure/Persistence/Repositories/EloquentUserRepository.php:75:13
         $data = $builder->first();
 
         if (is_null($data)) {
-            throw new UserNotFoundException('User not found with login: '.$login->value());
+            throw new UserNotFoundException('User not found with login: ');
         }
 
killedBy: Tests\Feature\Core\User\Infrastructure\Persistence\Repositories\EloquentUserRepositoryTest::test_findCriteria_should_return_exception
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Repositories\EloquentUserRepositoryTest::test_findCriteria_should_return_exception
Failed asserting that exception message 'User not found with login: ' contains 'User not found with login: login'.

FAILURES!
Tests: 1, Assertions: 6, Failures: 1.

[Killed] CastArray
Infrastructure/Persistence/Repositories/EloquentUserRepository.php:78:9
             throw new UserNotFoundException('User not found with login: '.$login->value());
         }
 
-        $userModel = $this->updateAttributesModelUser((array) $data);
+        $userModel = $this->updateAttributesModelUser($data);
 
         return $this->userTranslator->setModel($userModel)->toDomain();
killedBy: Tests\Feature\Core\User\Infrastructure\Persistence\Repositories\EloquentUserRepositoryTest::test_findCriteria_should_return_user_object
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Repositories\EloquentUserRepositoryTest::test_findCriteria_should_return_user_object
TypeError: Core\User\Infrastructure\Persistence\Repositories\EloquentUserRepository::updateAttributesModelUser(): Argument #1 ($data) must be of type array, stdClass given, called in /var/www/abacusSystem-new/src/core/User/Infrastructure/Persistence/Repositorie

[Killed] IfNegation
Infrastructure/Persistence/Repositories/EloquentUserRepository.php:94:9
         $builder = $this->database->table($this->getTable());
 
         $userId = $userModel->id();
-        if (is_null($userId)) {
-            $userId = $builder->insertGetId($dataModel);
-            $user->id()->setValue($userId);
-        } else {
-            $builder->where('user_id', $userId);
-            $builder->update($dataModel);
-        }
+        if (!is_null($userId)) {
 
         return $user;
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Repositories\EloquentUserRepositoryTest::test_persistUser_should_return_user_object with data set #0 ([1, null, 1, 1, 'login', 'image.jpg', '2024-04-28T09:46:00.000000Z', '2024-04-28T09:46:00.000000Z'], DateTime Object (...))
Mockery\Exception\BadMethodCallException: Received Mockery_1_Illuminate_Database_Query_Builder::update(), but no expecta

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentUserRepository.php:96:13
         $userId = $userModel->id();
         if (is_null($userId)) {
             $userId = $builder->insertGetId($dataModel);
-            $user->id()->setValue($userId);
+            
         } else {
             $builder->where('user_id', $userId);
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Repositories\EloquentUserRepositoryTest::test_persistUser_should_return_user_object with data set #0 ([1, null, 1, 1, 'login', 'image.jpg', '2024-04-28T09:46:00.000000Z', '2024-04-28T09:46:00.000000Z'], DateTime Object (...))
Expectation failed for method name is "id" when invoked 3 times.
Method was expected to be called 3 times, actually call

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentUserRepository.php:98:13
             $userId = $builder->insertGetId($dataModel);
             $user->id()->setValue($userId);
         } else {
-            $builder->where('user_id', $userId);
+            
             $builder->update($dataModel);
         }
statusReason: Mockery\Exception\InvalidCountException: Method where('user_id', 10) from Mockery_1_Illuminate_Database_Query_Builder should be called
 exactly 2 times but called 1 times.

/var/www/abacusSystem-new/vendor/mockery/mockery/library/Mockery/CountValidator/Exact.php:32
/var/www/abacusSystem-new/vendor/mockery/mockery/library/Mockery/Expectation.php:739
/var/www/abacusSystem-new/vendor/mockery/mockery/

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentUserRepository.php:99:13
             $user->id()->setValue($userId);
         } else {
             $builder->where('user_id', $userId);
-            $builder->update($dataModel);
+            
         }
 
statusReason:  exactly 1 times but called 0 times.

/var/www/abacusSystem-new/vendor/mockery/mockery/library/Mockery/CountValidator/Exact.php:32
/var/www/abacusSystem-new/vendor/mockery/mockery/library/Mockery/Expectation.php:739
/var/www/abacusSystem-new/vendor/mockery/mockery/library/Mockery/ExpectationDirector.php:202
/var/www/abacusSystem-new/vendor/mockery/mockery/library/Mockery/Container.php:583

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentUserRepository.php:123:9
     public function delete(UserId $id): void
     {
         $builder = $this->database->table($this->getTable());
-        $builder->where('user_id', $id->value());
+        
         $dataUser = $builder->first();
 
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Repositories\EloquentUserRepositoryTest::test_delete_should_delete_row with data set #0 ([1, 7, 1, 1, 'login', 'image.jpg', '2024-04-28T09:46:00.000000Z', '2024-04-28T09:46:00.000000Z'])
Expectation failed for method name is "value" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 3, Asser

[Killed] IfNegation
Infrastructure/Persistence/Repositories/EloquentUserRepository.php:126:9
         $builder->where('user_id', $id->value());
         $dataUser = $builder->first();
 
-        if (is_null($dataUser)) {
-            throw new UserNotFoundException('User not found with id: '.$id->value());
-        }
+        if (!is_null($dataUser)) {
 
         $userModel = $this->updateAttributesModelUser((array) $dataUser);
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Repositories\EloquentUserRepositoryTest::test_delete_should_delete_row with data set #0 ([1, 7, 1, 1, 'login', 'image.jpg', '2024-04-28T09:46:00.000000Z', '2024-04-28T09:46:00.000000Z'])
Core\User\Domain\ValueObjects\UserId::value(): int was not expected to be called more than once.

/var/www/abacusSystem-new/src/core/User/Infrastructure/Persis

[Killed] Throw_
Infrastructure/Persistence/Repositories/EloquentUserRepository.php:127:13
         $dataUser = $builder->first();
 
         if (is_null($dataUser)) {
-            throw new UserNotFoundException('User not found with id: '.$id->value());
+            new UserNotFoundException('User not found with id: ' . $id->value());
         }
 
killedBy: Tests\Feature\Core\User\Infrastructure\Persistence\Repositories\EloquentUserRepositoryTest::test_delete_user_null_should_return_exception
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Repositories\EloquentUserRepositoryTest::test_delete_user_null_should_return_exception
/var/www/abacusSystem-new/src/core/User/Infrastructure/Persistence/Repositories/EloquentUserRepository.php:100
/var/www/abacusSystem-new/tests/Feature/Core/User/Infrastructure/Persistence/Repositories/EloquentUserRepositoryTest.php:700
.

FAILURES!
Tests: 1,

[Killed] ConcatOperandRemoval
Infrastructure/Persistence/Repositories/EloquentUserRepository.php:127:13
         $dataUser = $builder->first();
 
         if (is_null($dataUser)) {
-            throw new UserNotFoundException('User not found with id: '.$id->value());
+            throw new UserNotFoundException('User not found with id: ');
         }
 
killedBy: Tests\Feature\Core\User\Infrastructure\Persistence\Repositories\EloquentUserRepositoryTest::test_delete_user_null_should_return_exception
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Repositories\EloquentUserRepositoryTest::test_delete_user_null_should_return_exception
Failed asserting that exception message 'User not found with id: ' contains 'User not found with id: 7'.

FAILURES!
Tests: 1, Assertions: 5, Failures: 1.

[Survived] CastArray
Infrastructure/Persistence/Repositories/EloquentUserRepository.php:130:9
             throw new UserNotFoundException('User not found with id: '.$id->value());
         }
 
-        $userModel = $this->updateAttributesModelUser((array) $dataUser);
+        $userModel = $this->updateAttributesModelUser($dataUser);
         $userModel->changeState(ValueObjectStatus::STATE_DELETE);
         $userModel->changeDeletedAt(new \DateTime);

[Survived] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentUserRepository.php:131:9
         }
 
         $userModel = $this->updateAttributesModelUser((array) $dataUser);
-        $userModel->changeState(ValueObjectStatus::STATE_DELETE);
+        
         $userModel->changeDeletedAt(new \DateTime);
 

[Survived] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentUserRepository.php:132:9
 
         $userModel = $this->updateAttributesModelUser((array) $dataUser);
         $userModel->changeState(ValueObjectStatus::STATE_DELETE);
-        $userModel->changeDeletedAt(new \DateTime);
+        
 
         $builder->update($userModel->toArray());

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentUserRepository.php:134:9
         $userModel->changeState(ValueObjectStatus::STATE_DELETE);
         $userModel->changeDeletedAt(new \DateTime);
 
-        $builder->update($userModel->toArray());
+        
     }
 
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Repositories\EloquentUserRepositoryTest::test_delete_should_delete_row with data set #0 ([1, 7, 1, 1, 'login', 'image.jpg', '2024-04-28T09:46:00.000000Z', '2024-04-28T09:46:00.000000Z'])
Expectation failed for method name is "toArray" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 3, Ass

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentUserRepository.php:143:9
     private function domainToModel(User $domain): UserModel
     {
         $builder = $this->database->table($this->getTable());
-        $builder->where('user_id', $domain->id()->value());
+        
         $data = $builder->first();
         $model = $this->updateAttributesModelUser((array) $data);
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Repositories\EloquentUserRepositoryTest::test_persistUser_should_return_user_object with data set #0 ([1, null, 1, 1, 'login', 'image.jpg', '2024-04-28T09:46:00.000000Z', '2024-04-28T09:46:00.000000Z'], DateTime Object (...))
Expectation failed for method name is "id" when invoked 3 times.
Method was expected to be called 3 times, actually call

[Survived] CastArray
Infrastructure/Persistence/Repositories/EloquentUserRepository.php:145:9
         $builder = $this->database->table($this->getTable());
         $builder->where('user_id', $domain->id()->value());
         $data = $builder->first();
-        $model = $this->updateAttributesModelUser((array) $data);
+        $model = $this->updateAttributesModelUser($data);
 
         $model->changeId($domain->id()->value());

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentUserRepository.php:148:9
         $model = $this->updateAttributesModelUser((array) $data);
 
         $model->changeId($domain->id()->value());
-        $model->changeEmployeeId($domain->employeeId()->value());
+        
         $model->changeProfileId($domain->profileId()->value());
         $model->changeLogin($domain->login()->value());
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Repositories\EloquentUserRepositoryTest::test_persistUser_should_return_user_object with data set #0 ([1, null, 1, 1, 'login', 'image.jpg', '2024-04-28T09:46:00.000000Z', '2024-04-28T09:46:00.000000Z'], DateTime Object (...))
Expectation failed for method name is "changeEmployeeId" when invoked 1 time.
Method was expected to be called 1 time, a

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentUserRepository.php:149:9
 
         $model->changeId($domain->id()->value());
         $model->changeEmployeeId($domain->employeeId()->value());
-        $model->changeProfileId($domain->profileId()->value());
+        
         $model->changeLogin($domain->login()->value());
         $model->changePassword($domain->password()->value());
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Repositories\EloquentUserRepositoryTest::test_persistUser_should_return_user_object with data set #0 ([1, null, 1, 1, 'login', 'image.jpg', '2024-04-28T09:46:00.000000Z', '2024-04-28T09:46:00.000000Z'], DateTime Object (...))
Expectation failed for method name is "changeProfileId" when invoked 1 time.
Method was expected to be called 1 time, ac

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentUserRepository.php:150:9
         $model->changeId($domain->id()->value());
         $model->changeEmployeeId($domain->employeeId()->value());
         $model->changeProfileId($domain->profileId()->value());
-        $model->changeLogin($domain->login()->value());
+        
         $model->changePassword($domain->password()->value());
         $model->changeState($domain->state()->value());
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Repositories\EloquentUserRepositoryTest::test_persistUser_should_return_user_object with data set #0 ([1, null, 1, 1, 'login', 'image.jpg', '2024-04-28T09:46:00.000000Z', '2024-04-28T09:46:00.000000Z'], DateTime Object (...))
Expectation failed for method name is "changeLogin" when invoked 1 time.
Method was expected to be called 1 time, actual

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentUserRepository.php:151:9
         $model->changeEmployeeId($domain->employeeId()->value());
         $model->changeProfileId($domain->profileId()->value());
         $model->changeLogin($domain->login()->value());
-        $model->changePassword($domain->password()->value());
+        
         $model->changeState($domain->state()->value());
         $model->changePhoto($domain->photo()->value());
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Repositories\EloquentUserRepositoryTest::test_persistUser_should_return_user_object with data set #0 ([1, null, 1, 1, 'login', 'image.jpg', '2024-04-28T09:46:00.000000Z', '2024-04-28T09:46:00.000000Z'], DateTime Object (...))
Expectation failed for method name is "changePassword" when invoked 1 time.
Method was expected to be called 1 time, act

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentUserRepository.php:152:9
         $model->changeProfileId($domain->profileId()->value());
         $model->changeLogin($domain->login()->value());
         $model->changePassword($domain->password()->value());
-        $model->changeState($domain->state()->value());
+        
         $model->changePhoto($domain->photo()->value());
         $model->changeCreatedAt($domain->createdAt()->value());
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Repositories\EloquentUserRepositoryTest::test_persistUser_should_return_user_object with data set #0 ([1, null, 1, 1, 'login', 'image.jpg', '2024-04-28T09:46:00.000000Z', '2024-04-28T09:46:00.000000Z'], DateTime Object (...))
Expectation failed for method name is "changeState" when invoked 1 time.
Method was expected to be called 1 time, actual

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentUserRepository.php:153:9
         $model->changeLogin($domain->login()->value());
         $model->changePassword($domain->password()->value());
         $model->changeState($domain->state()->value());
-        $model->changePhoto($domain->photo()->value());
+        
         $model->changeCreatedAt($domain->createdAt()->value());
 
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Repositories\EloquentUserRepositoryTest::test_persistUser_should_return_user_object with data set #0 ([1, null, 1, 1, 'login', 'image.jpg', '2024-04-28T09:46:00.000000Z', '2024-04-28T09:46:00.000000Z'], DateTime Object (...))
Expectation failed for method name is "changePhoto" when invoked 1 time.
Method was expected to be called 1 time, actual

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/EloquentUserRepository.php:154:9
         $model->changePassword($domain->password()->value());
         $model->changeState($domain->state()->value());
         $model->changePhoto($domain->photo()->value());
-        $model->changeCreatedAt($domain->createdAt()->value());
+        
 
         if (! is_null($domain->updatedAt()->value())) {
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Repositories\EloquentUserRepositoryTest::test_persistUser_should_return_user_object with data set #0 ([1, null, 1, 1, 'login', 'image.jpg', '2024-04-28T09:46:00.000000Z', '2024-04-28T09:46:00.000000Z'], DateTime Object (...))
Expectation failed for method name is "changeCreatedAt" when invoked 1 time.
Method was expected to be called 1 time, ac
