[Killed] Concat
Infrastructure/Persistence/Repositories/RedisUserRepository.php:63:13
             $data = Redis::get($this->userLoginKey($login));
         } catch (Exception $exception) {
             $this->logger->error($exception->getMessage(), $exception->getTrace());
-            throw new UserNotFoundException('User not found by login '.$login->value());
+            throw new UserNotFoundException($login->value() . 'User not found by login ');
         }
 
killedBy: Tests\Feature\Core\User\Infrastructure\Persistence\Repositories\RedisUserRepositoryTest::test_findCriteria_should_return_exception
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Repositories\RedisUserRepositoryTest::test_findCriteria_should_return_exception
Failed asserting that exception message 'login-testUser not found by login ' contains 'User not found by login login-test'.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] ConcatOperandRemoval
Infrastructure/Persistence/Repositories/RedisUserRepository.php:63:13
             $data = Redis::get($this->userLoginKey($login));
         } catch (Exception $exception) {
             $this->logger->error($exception->getMessage(), $exception->getTrace());
-            throw new UserNotFoundException('User not found by login '.$login->value());
+            throw new UserNotFoundException('User not found by login ');
         }
 
killedBy: Tests\Feature\Core\User\Infrastructure\Persistence\Repositories\RedisUserRepositoryTest::test_findCriteria_should_return_exception
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Repositories\RedisUserRepositoryTest::test_findCriteria_should_return_exception
Failed asserting that exception message 'User not found by login ' contains 'User not found by login login-test'.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] Concat
Infrastructure/Persistence/Repositories/RedisUserRepository.php:85:13
             $data = Redis::get($this->userKey($id));
         } catch (Exception $exception) {
             $this->logger->error($exception->getMessage(), $exception->getTrace());
-            throw new UserNotFoundException('User not found by id '.$id->value());
+            throw new UserNotFoundException($id->value() . 'User not found by id ');
         }
 
killedBy: Tests\Feature\Core\User\Infrastructure\Persistence\Repositories\RedisUserRepositoryTest::test_find_should_return_exception
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Repositories\RedisUserRepositoryTest::test_find_should_return_exception
Failed asserting that exception message '1User not found by id ' contains 'User not found by id 1'.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] Throw_
Infrastructure/Persistence/Repositories/RedisUserRepository.php:85:13
             $data = Redis::get($this->userKey($id));
         } catch (Exception $exception) {
             $this->logger->error($exception->getMessage(), $exception->getTrace());
-            throw new UserNotFoundException('User not found by id '.$id->value());
+            new UserNotFoundException('User not found by id ' . $id->value());
         }
 
killedBy: Tests\Feature\Core\User\Infrastructure\Persistence\Repositories\RedisUserRepositoryTest::test_find_should_return_exception
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Repositories\RedisUserRepositoryTest::test_find_should_return_exception
Failed asserting that exception of type "ErrorException" matches expected exception "Core\User\Exceptions\UserNotFoundException". Message was: "Undefined variable $data" at
/var/www/abacusSystem-new/vendor/laravel/framework/src/Illuminate/Foundation/Bootstrap/HandleExceptio

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/RedisUserRepository.php:108:13
 
         $userData = $this->dataTransformer->write($user)->read();
         try {
-            Redis::set($userLoginKey, json_encode($userData));
+            
             Redis::set($userKey, json_encode($userData));
         } catch (Exception $exception) {
killedBy: Tests\Feature\Core\User\Infrastructure\Persistence\Repositories\RedisUserRepositoryTest::test_persistUser_should_return_user_object
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Repositories\RedisUserRepositoryTest::test_persistUser_should_return_exception
Expectation failed for method name is "error" when invoked 1 time
Parameter 0 for invocation Psr\Log\LoggerInterface::error('No matching handler found for...od\n\n', [...]): void does not match expected value.
Failed asserting that two strings are equal.
--- Expected

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/RedisUserRepository.php:109:13
         $userData = $this->dataTransformer->write($user)->read();
         try {
             Redis::set($userLoginKey, json_encode($userData));
-            Redis::set($userKey, json_encode($userData));
+            
         } catch (Exception $exception) {
             $this->logger->error($exception->getMessage(), $exception->getTrace());
killedBy: Tests\Feature\Core\User\Infrastructure\Persistence\Repositories\RedisUserRepositoryTest::test_persistUser_should_return_user_object
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Repositories\RedisUserRepositoryTest::test_persistUser_should_return_user_object
Mockery\Exception\InvalidCountException: Method set('user::1', '[]') from Mockery_0_Illuminate_Redis_RedisManager should be called
 exactly 1 times but called 0 times.

/var/www/abacusSystem-new/vendor/mockery/mockery/library/Mockery/CountValidator/Exact.php:32
/va

[Killed] Concat
Infrastructure/Persistence/Repositories/RedisUserRepository.php:112:13
             Redis::set($userKey, json_encode($userData));
         } catch (Exception $exception) {
             $this->logger->error($exception->getMessage(), $exception->getTrace());
-            throw new UserPersistException('It could not persist User with key '.$userKey.' in redis');
+            throw new UserPersistException('It could not persist User with key ' . ' in redis' . $userKey);
         }
 
killedBy: Tests\Feature\Core\User\Infrastructure\Persistence\Repositories\RedisUserRepositoryTest::test_persistUser_should_return_exception
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Repositories\RedisUserRepositoryTest::test_persistUser_should_return_exception
Failed asserting that exception message 'It could not persist User with key  in redisuser::1' contains 'It could not persist User with key user::1 in redis'.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] ConcatOperandRemoval
Infrastructure/Persistence/Repositories/RedisUserRepository.php:112:13
             Redis::set($userKey, json_encode($userData));
         } catch (Exception $exception) {
             $this->logger->error($exception->getMessage(), $exception->getTrace());
-            throw new UserPersistException('It could not persist User with key '.$userKey.' in redis');
+            throw new UserPersistException('It could not persist User with key ' . ' in redis');
         }
 
killedBy: Tests\Feature\Core\User\Infrastructure\Persistence\Repositories\RedisUserRepositoryTest::test_persistUser_should_return_exception
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Repositories\RedisUserRepositoryTest::test_persistUser_should_return_exception
Failed asserting that exception message 'It could not persist User with key  in redis' contains 'It could not persist User with key user::1 in redis'.

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Repositories/RedisUserRepository.php:142:9
 
     public function delete(UserId $id): void
     {
-        Redis::delete($this->userKey($id));
+        
     }
 }
killedBy: Tests\Feature\Core\User\Infrastructure\Persistence\Repositories\RedisUserRepositoryTest::test_delete_should_delete_data_user
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Repositories\RedisUserRepositoryTest::test_delete_should_delete_data_user
Expectation failed for method name is "value" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
