[Killed] MethodCallRemoval
Infrastructure/Persistence/Translators/UserTranslator.php:53:9
             $this->factory->buildCreatedAt($this->model->createdAt())
         );
 
-        $user->setPhoto($this->factory->buildUserPhoto($this->model->photo()));
+        
         $user->setUpdatedAt($this->factory->buildUpdatedAt($this->model->updatedAt()));
 
killedBy: Tests\Feature\Core\User\Infrastructure\Persistence\Translators\UserTranslatorTest::test_toDomain_should_return_user_class
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Translators\UserTranslatorTest::test_toDomain_should_return_user_class
Expectation failed for method name is "buildUserPhoto" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] MethodCallRemoval
Infrastructure/Persistence/Translators/UserTranslator.php:54:9
         );
 
         $user->setPhoto($this->factory->buildUserPhoto($this->model->photo()));
-        $user->setUpdatedAt($this->factory->buildUpdatedAt($this->model->updatedAt()));
+        
 
         return $user;
killedBy: Tests\Feature\Core\User\Infrastructure\Persistence\Translators\UserTranslatorTest::test_toDomain_should_return_user_class
statusReason: 1) Tests\Feature\Core\User\Infrastructure\Persistence\Translators\UserTranslatorTest::test_toDomain_should_return_user_class
Expectation failed for method name is "buildUpdatedAt" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.
