[NoCoverage] MethodCallRemoval
app/Listeners/EmployeeWarmup.php:26:9
      */
     public function handle(EmployeeUpdateOrDeletedEvent $event): void
     {
-        ProcessCommandWarmup::dispatch(sprintf('employee:warmup %d', $event->employeeId()));
+        
     }
 }
