[NoCoverage] MethodCallRemoval
app/Listeners/UserWarmup.php:26:9
      */
     public function handle(UserUpdateOrDeleteEvent $event): void
     {
-        ProcessCommandWarmup::dispatch(sprintf('user:warmup %d', $event->userId()));
+        
     }
 }
